.config/nixos/modules/emacs/config.org
#+title: Literate Emacs configuration
#
#+author: Jack Baldry
#+email: mail@jdb.sh
#
#+html_head: <style>code {font-weight: bold}</style>
#+html_head: <style>.src {background-color: #111111; color: #ffffff}</style>
#+html_head: <style>.note {margin: 1.2em; border-left: 3px solid; padding: 6px 12px 6px 24px}</style>
#+property: header-args :mkdirp yes :comments link
#+startup: fold

Useful reminders for working in this file:
- Add footnotes with ~C-c C-x f~[fn:1]
- Export the file with ~C-c C-e~
- Add a structure with ~C-c C-,~
- Tangle org file with ~C-c C-v t~
- Format buffer with ~C-x h C-M-\ C-u C-SPC C-u C-SPC~
- Add a source code block tangled into ~~/.emacs.d/init.el~ with yasnippet key ~init.el~
- Add a note with yasnippet key ~note~

* Early init

Executed before the startup of the GUI.

** Add header for linting

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;;; early-init.el --- Early init file

  ;;; Commentary:
  ;;; This file is managed in a literate org file ~/ext/.config/nixos/modules/emacs/config.org
  ;;; Code:
#+end_src

** Message the init time and number of garbage collections

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "Emacs ready in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time (time-subtract after-init-time before-init-time)))
                       gcs-done)))
#+end_src

** Test "best possible" startup time[fn:2]

#+begin_src shell
  emacs -q --eval='(message "%s" (emacs-init-time))'
#+end_src

** Make startup faster by reducing the frequency of garbage collection

The default is 800 kilobytes.
Measured in bytes.

In the init, this is tuned back down to speed up garbage collections during runtime.

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (setq gc-cons-threshold (* 50 1000 1000))
#+end_src

** Require use-package which is used to manage all other packages

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (eval-when-compile
    (require 'package)
    (add-to-list 'package-archives
                 '("MELPA" . "http://melpa.org/packages/"))
    (require 'use-package)
    (setq use-package-expand-minimally byte-compile-current-file))
#+end_src

** Start the Emacs server

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (server-start)
#+end_src

** Unbind the jdb (Java debugger) function that interferes with my namespacing

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (fmakunbound 'jdb)
#+end_src

** Increase usable space and inhibit startup screen

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (setq inhibit-startup-screen t)

  ;; Disable menu, tool, and scroll bars.
  (menu-bar-mode 0)
  (tool-bar-mode 0)
  (scroll-bar-mode 0)
#+end_src

