.config/nixos/modules/emacs/config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-21 Tue 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Literate Emacs configuration</title>
<meta name="author" content="Jack Baldry" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Literate Emacs configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0a7d0a9">1. Early init</a>
<ul>
<li><a href="#org08f6a51">1.1. Add header for linting</a></li>
<li><a href="#org6c4ac6c">1.2. Message the init time and number of garbage collections</a></li>
<li><a href="#orgdbeb84c">1.3. Test "best possible" startup time</a></li>
<li><a href="#org264e948">1.4. Make startup faster by reducing the frequency of garbage collection</a></li>
<li><a href="#org25e954b">1.5. Require use-package which is used to manage all other packages</a></li>
<li><a href="#org8811d56">1.6. Start the Emacs server</a></li>
<li><a href="#org1884c29">1.7. Unbind the jdb (Java debugger) function that interferes with my namespacing</a></li>
<li><a href="#orgb2c315c">1.8. Increase usable space and inhibit startup screen</a></li>
<li><a href="#org8876e63">1.9. Add footer for linting</a></li>
</ul>
</li>
<li><a href="#org537453f">2. Init</a>
<ul>
<li><a href="#orga695c8d">2.1. Add header for linting</a></li>
<li><a href="#org136f8a0">2.2. Set up custom variables group</a></li>
<li><a href="#org4e5c6d2">2.3. Set separate custom file</a></li>
<li><a href="#orgb111226">2.4. Move save files and avoid interlock files</a></li>
<li><a href="#org3dbe934">2.5. Clipboards and killing</a>
<ul>
<li><a href="#org6f645f8">2.5.1. Save existing clipboard text into kill ring before replacing it</a></li>
<li><a href="#orga298c5b">2.5.2. Clear the kill ring</a></li>
</ul>
</li>
<li><a href="#orgf129237">2.6. Configure appearance</a></li>
<li><a href="#orga7adf25">2.7. Set indentation defaults</a>
<ul>
<li><a href="#org49664f1">2.7.1. Set custom variable for single sourcing indentation width</a></li>
<li><a href="#org0a9a4dd">2.7.2. Default to spaces</a></li>
<li><a href="#org2bad783">2.7.3. Infer whether a file is using spaces or tabs</a></li>
<li><a href="#orgc1a264d">2.7.4. Set default tab display width and tab stop sequence</a></li>
<li><a href="#orgbf67954">2.7.5. Configure default width for SMIE indentation</a></li>
<li><a href="#orga4148bb">2.7.6. Set <code>sh-mode</code> basic offset</a></li>
<li><a href="#orgfc744b4">2.7.7. Set <code>js-json-mode</code> and <code>js-mode</code> basic offsets</a></li>
<li><a href="#orgf8deb3b">2.7.8. Stop electric-indent-mode interfering with the previous line</a></li>
</ul>
</li>
<li><a href="#orgeaefe86">2.8. Use envrc environment variables</a></li>
<li><a href="#org1dab625">2.9. Use Ivy, Swiper, and Counsel for more effective minibuffers</a></li>
<li><a href="#org8e2379a">2.10. Use company for better completions</a></li>
<li><a href="#org8179c66">2.11. Intercept shell-mode comint commands</a></li>
<li><a href="#org95ac1b2">2.12. xterm-color support</a></li>
<li><a href="#org4fa1a2a">2.13. Ligatures</a></li>
<li><a href="#org7b5dcb8">2.14. Highlight erroneous whitespace</a></li>
<li><a href="#org59e2e4f">2.15. Add extra information to dired listing</a></li>
<li><a href="#org8929d62">2.16. Enable multiple cursors</a></li>
<li><a href="#orgcc5b723">2.17. Expand region at point</a></li>
<li><a href="#org12d5b66">2.18. Development environments</a>
<ul>
<li><a href="#org6597cf3">2.18.1. Flycheck</a></li>
<li><a href="#orga18a5f6">2.18.2. LSP</a></li>
<li><a href="#org5baec5d">2.18.3. Agda</a></li>
<li><a href="#org5bfdc8d">2.18.4. Bash</a></li>
<li><a href="#orgc69b4ef">2.18.5. Emacs Lisp</a></li>
<li><a href="#orgf9c5e41">2.18.6. Go</a></li>
<li><a href="#org9d3e149">2.18.7. Haskell</a></li>
<li><a href="#orgcbf3761">2.18.8. JavaScript</a></li>
<li><a href="#org5d8d8d3">2.18.9. Jsonnet</a></li>
<li><a href="#org98bc33e">2.18.10. Markdown</a></li>
<li><a href="#orgd44c3fa">2.18.11. Nix</a></li>
<li><a href="#orgd082c4b">2.18.12. River</a></li>
<li><a href="#org5d9a313">2.18.13. Terraform</a></li>
</ul>
</li>
<li><a href="#orgc9b770e">2.19. Forges</a>
<ul>
<li><a href="#orgca0c293">2.19.1. GitHub</a></li>
</ul>
</li>
<li><a href="#orgff3f916">2.20. Automatically revert buffers if the file changes</a></li>
<li><a href="#org1a70b76">2.21. Use magit for git</a>
<ul>
<li><a href="#org33130b6">2.21.1. Use difftastic for diffing</a></li>
<li><a href="#org9f497f0">2.21.2. Add personal transients</a></li>
</ul>
</li>
<li><a href="#org8d2ddd6">2.22. Org export</a>
<ul>
<li><a href="#org42ae5a3">2.22.1. Enable syntax highlighting</a></li>
<li><a href="#org0f007e4">2.22.2. Enable Markdown export</a></li>
</ul>
</li>
<li><a href="#org736ade0">2.23. Task management</a>
<ul>
<li><a href="#org0b3685a">2.23.1. Utilities</a></li>
<li><a href="#org46f2871">2.23.2. Interact with Slack</a></li>
<li><a href="#org76e1852">2.23.3. Tests</a></li>
<li><a href="#org92a76f6">2.23.4. Interact with Google Calendar</a></li>
</ul>
</li>
<li><a href="#org80a2ff7">2.24. Use Projectile for working with multiple code projects</a></li>
<li><a href="#org000cb43">2.25. HTML</a></li>
<li><a href="#org2ec434b">2.26. Edit browser text fields within Emacs</a></li>
<li><a href="#orga4b8da1">2.27. Passwords</a>
<ul>
<li><a href="#org864c914">2.27.1. Start Pinentry service to have gpg commands interact with Emacs</a></li>
<li><a href="#org8f2e9dd">2.27.2. Configure the Unix password manager pass as an auth source</a></li>
</ul>
</li>
<li><a href="#orgec0e1eb">2.28. Email</a></li>
<li><a href="#orgb76d29e">2.29. Jump to a word</a></li>
<li><a href="#org752d36d">2.30. Capture a screenshot</a></li>
<li><a href="#org1d75893">2.31. Regular expressions for URLs</a></li>
<li><a href="#org3d14f7b">2.32. Conveniently browse to URLs</a></li>
<li><a href="#org8ecf40e">2.33. Manage brightness</a></li>
<li><a href="#org1664b15">2.34. Manage sound</a></li>
<li><a href="#orgeb9682d">2.35. Goto for compilation-mode errors</a></li>
<li><a href="#orgc2bf85f">2.36. Snippets with yasnippet</a></li>
<li><a href="#org699f092">2.37. Use rx in re-builder</a></li>
<li><a href="#org3fc105f">2.38. Format everything</a></li>
<li><a href="#org4471160">2.39. NixOS</a></li>
<li><a href="#org7699cb3">2.40. Git</a></li>
<li><a href="#orgb65133d">2.41. Speed up garbage collection</a></li>
<li><a href="#orgeb5108e">2.42. Miscellany</a>
<ul>
<li><a href="#org698d976">2.42.1. Convert a string to Slack alphabet emojis.</a></li>
<li><a href="#org5d9c4dc">2.42.2. Apply an RCS formatted patch to a buffer</a></li>
<li><a href="#orgb1886c1">2.42.3. Implement watch buffer</a></li>
<li><a href="#org00e1b0a">2.42.4. Caps lock minor mode</a></li>
<li><a href="#org970a51f">2.42.5. Zap up to char</a></li>
<li><a href="#org3a07080">2.42.6. Transpose lines</a></li>
</ul>
</li>
<li><a href="#org92b2205">2.43. Legacy EXWM code</a></li>
<li><a href="#org1f64042">2.44. Add footer for linting</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Useful reminders for working in this file:
</p>
<ul class="org-ul">
<li>Add footnotes with <code>C-c C-x f</code><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></li>
<li>Export the file with <code>C-c C-e</code></li>
<li>Add a structure with <code>C-c C-,</code></li>
<li>Tangle org file with <code>C-c C-v t</code></li>
<li>Format buffer with <code>C-x h C-M-\ C-u C-SPC C-u C-SPC</code></li>
<li>Add a source code block tangled into <code>~/.emacs.d/init.el</code> with yasnippet key <code>init.el</code></li>
<li>Add a note with yasnippet key <code>note</code></li>
</ul>

<div id="outline-container-org0a7d0a9" class="outline-2">
<h2 id="org0a7d0a9"><span class="section-number-2">1.</span> Early init</h2>
<div class="outline-text-2" id="text-1">
<p>
Executed before the startup of the GUI.
</p>
</div>

<div id="outline-container-org08f6a51" class="outline-3">
<h3 id="org08f6a51"><span class="section-number-3">1.1.</span> Add header for linting</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #989898;">;;; </span><span style="color: #989898;">early-init.el --- Early init file</span>

<span style="color: #989898;">;;; </span><span style="color: #989898;">Commentary:</span>
<span style="color: #989898;">;;; </span><span style="color: #989898;">This file is managed in a literate org file ~/ext/.config/nixos/modules/emacs/config.org</span>
<span style="color: #989898;">;;; </span><span style="color: #989898;">Code:</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c4ac6c" class="outline-3">
<h3 id="org6c4ac6c"><span class="section-number-3">1.2.</span> Message the init time and number of garbage collections</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'emacs-startup-hook
          (<span style="color: #b6a0ff;">lambda</span> ()
            (message <span style="color: #79a8ff;">"Emacs ready in %s with %d garbage collections."</span>
                     (format <span style="color: #79a8ff;">"%.2f seconds"</span>
                             (float-time (time-subtract after-init-time before-init-time)))
                     gcs-done)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdbeb84c" class="outline-3">
<h3 id="orgdbeb84c"><span class="section-number-3">1.3.</span> Test "best possible" startup time<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup></h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-shell">emacs -q --eval=<span style="color: #79a8ff;">'(message "%s" (emacs-init-time))'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org264e948" class="outline-3">
<h3 id="org264e948"><span class="section-number-3">1.4.</span> Make startup faster by reducing the frequency of garbage collection</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The default is 800 kilobytes.
Measured in bytes.
</p>

<p>
In the init, this is tuned back down to speed up garbage collections during runtime.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> gc-cons-threshold (* 50 1000 1000))
</pre>
</div>
</div>
</div>

<div id="outline-container-org25e954b" class="outline-3">
<h3 id="org25e954b"><span class="section-number-3">1.5.</span> Require use-package which is used to manage all other packages</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">eval-when-compile</span>
  (<span style="color: #b6a0ff;">require</span> '<span style="color: #00bcff;">package</span>)
  (add-to-list 'package-archives
               '(<span style="color: #79a8ff;">"MELPA"</span> . <span style="color: #79a8ff;">"http://melpa.org/packages/"</span>))
  (<span style="color: #b6a0ff;">require</span> '<span style="color: #00bcff;">use-package</span>)
  (<span style="color: #b6a0ff;">setq</span> use-package-expand-minimally byte-compile-current-file))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8811d56" class="outline-3">
<h3 id="org8811d56"><span class="section-number-3">1.6.</span> Start the Emacs server</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(server-start)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1884c29" class="outline-3">
<h3 id="org1884c29"><span class="section-number-3">1.7.</span> Unbind the jdb (Java debugger) function that interferes with my namespacing</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(fmakunbound 'jdb)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2c315c" class="outline-3">
<h3 id="orgb2c315c"><span class="section-number-3">1.8.</span> Increase usable space and inhibit startup screen</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> inhibit-startup-screen t)

<span style="color: #989898;">;; </span><span style="color: #989898;">Disable menu, tool, and scroll bars.</span>
(menu-bar-mode 0)
(tool-bar-mode 0)
(scroll-bar-mode 0)
</pre>
</div>
</div>
</div>
