.config/nixos/modules/emacs/config.org
** Add footer for linting

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;;; early-init.el ends here
#+end_src

* Init
** Add header for linting

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  ;;; init.el --- Init file

  ;;; Commentary:
  ;;; This file is managed in a literate org file ~/ext/.config/nixos/modules/emacs/config.org
  ;;; Code:
#+end_src

** Set up custom variables group

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defgroup jdb nil "Personal group."
    :group 'emacs
    :version "27"
    :prefix "jdb/")

  (defcustom jdb/slack-status--collection nil
    "Collection of emoji strings useful in Slack statuses."
    :group 'jdb
    :type '(repeat string))

  (defcustom jdb/co-authored-by--collection nil
    "Collection of author strings."
    :group 'jdb
    :type '(repeat string))
#+end_src

** Set separate custom file

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq custom-file "~/.emacs.d/custom.el")
  (load custom-file)
#+end_src

** Move save files and avoid interlock files

As a single user, interlocks aren't very useful.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq backup-directory-alist '(("." . "~/.emacs_saves")))
  (setq auto-save-file-name-transforms '((".*" "~/.emacs_saves/" t)))
  (setq create-lockfiles nil)
#+end_src

** Clipboards and killing

*** Save existing clipboard text into kill ring before replacing it

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq save-interprogram-paste-before-kill t)
#+end_src

*** Clear the kill ring

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defun jdb/clear-kill-ring ()
    "Clear the 'kill-ring'."
    (interactive)
    (setq kill-ring nil))
#+end_src

** Configure appearance

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (load-theme 'modus-vivendi t)

  ;; Increase font size.
  (set-face-attribute 'default nil :height 140)
  (set-face-attribute 'mode-line nil :height 100)

  ;; Enable globally set relative line numbers.
  (global-display-line-numbers-mode)
  (setq display-line-numbers-type 'relative)

  ;; Display keypresses.
  (use-package keycast
    :ensure t
    :init
    (keycast-mode)
    :config
    (setq keycast-mode-line-remove-tail-elements nil)
    :defer t)

  ;; Highlight the current line globally.
  (global-hl-line-mode)
#+end_src

** Set indentation defaults
*** Set custom variable for single sourcing indentation width

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defcustom jdb/indent-width 2
    "Set default indent width."
    :group 'jdb
    :type 'string)
#+end_src

*** Default to spaces

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq-default indent-tabs-mode nil)
#+end_src
*** Infer whether a file is using spaces or tabs

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defun infer-indentation-style ()
    "Infer whether a file is indented with spaces or tabs."
    (let ((spaces (how-many "^  " (point-min) (point-max)))
          (tabs (how-many "^\t" (point-min) (point-max))))
      (if (> spaces tabs) (setq indent-tabs-mode nil))
      (if (> tabs spaces) (setq indent-tabs-mode t))))
  (add-hook 'prog-mode-hook 'infer-indentation-style)
#+end_src

*** Set default tab display width and tab stop sequence

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq-default tab-width jdb/indent-width)
#+end_src

*** Configure default width for SMIE indentation

Most modes that indent using SMIE rules will have their own ~<MODE>-basic-offset~ custom varaible.

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq-default smie-indent-basic jdb/indent-width)
#+end_src

*** Set ~sh-mode~ basic offset

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq-default sh-basic-offset jdb/indent-width)
#+end_src

*** Set ~js-json-mode~ and ~js-mode~ basic offsets

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq-default js-indent-level jdb/indent-width)
#+end_src

*** Stop electric-indent-mode interfering with the previous line

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq-default electric-indent-mode t)
#+end_src

** Use envrc environment variables

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package direnv :ensure t :init (direnv-mode))
#+end_src

