.config/nixos/modules/emacs/config.html

<div id="outline-container-org8876e63" class="outline-3">
<h3 id="org8876e63"><span class="section-number-3">1.9.</span> Add footer for linting</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #989898;">;;; </span><span style="color: #989898;">early-init.el ends here</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org537453f" class="outline-2">
<h2 id="org537453f"><span class="section-number-2">2.</span> Init</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga695c8d" class="outline-3">
<h3 id="orga695c8d"><span class="section-number-3">2.1.</span> Add header for linting</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #989898;">;;; </span><span style="color: #989898;">init.el --- Init file</span>

<span style="color: #989898;">;;; </span><span style="color: #989898;">Commentary:</span>
<span style="color: #989898;">;;; </span><span style="color: #989898;">This file is managed in a literate org file ~/ext/.config/nixos/modules/emacs/config.org</span>
<span style="color: #989898;">;;; </span><span style="color: #989898;">Code:</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org136f8a0" class="outline-3">
<h3 id="org136f8a0"><span class="section-number-3">2.2.</span> Set up custom variables group</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defgroup</span> <span style="color: #6ae4b9;">jdb</span> nil <span style="color: #9ac8e0;">"Personal group."</span>
  <span style="color: #f78fe7;">:group</span> 'emacs
  <span style="color: #f78fe7;">:version</span> <span style="color: #79a8ff;">"27"</span>
  <span style="color: #f78fe7;">:prefix</span> <span style="color: #79a8ff;">"jdb/"</span>)

(<span style="color: #b6a0ff;">defcustom</span> <span style="color: #00d3d0;">jdb/slack-status--collection</span> nil
  <span style="color: #9ac8e0;">"Collection of emoji strings useful in Slack statuses."</span>
  <span style="color: #f78fe7;">:group</span> 'jdb
  <span style="color: #f78fe7;">:type</span> '(repeat string))

(<span style="color: #b6a0ff;">defcustom</span> <span style="color: #00d3d0;">jdb/co-authored-by--collection</span> nil
  <span style="color: #9ac8e0;">"Collection of author strings."</span>
  <span style="color: #f78fe7;">:group</span> 'jdb
  <span style="color: #f78fe7;">:type</span> '(repeat string))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4e5c6d2" class="outline-3">
<h3 id="org4e5c6d2"><span class="section-number-3">2.3.</span> Set separate custom file</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> custom-file <span style="color: #79a8ff;">"~/.emacs.d/custom.el"</span>)
(load custom-file)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb111226" class="outline-3">
<h3 id="orgb111226"><span class="section-number-3">2.4.</span> Move save files and avoid interlock files</h3>
<div class="outline-text-3" id="text-2-4">
<p>
As a single user, interlocks aren't very useful.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> backup-directory-alist '((<span style="color: #79a8ff;">"."</span> . <span style="color: #79a8ff;">"~/.emacs_saves"</span>)))
(<span style="color: #b6a0ff;">setq</span> auto-save-file-name-transforms '((<span style="color: #79a8ff;">".*"</span> <span style="color: #79a8ff;">"~/.emacs_saves/"</span> t)))
(<span style="color: #b6a0ff;">setq</span> create-lockfiles nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3dbe934" class="outline-3">
<h3 id="org3dbe934"><span class="section-number-3">2.5.</span> Clipboards and killing</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org6f645f8" class="outline-4">
<h4 id="org6f645f8"><span class="section-number-4">2.5.1.</span> Save existing clipboard text into kill ring before replacing it</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> save-interprogram-paste-before-kill t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga298c5b" class="outline-4">
<h4 id="orga298c5b"><span class="section-number-4">2.5.2.</span> Clear the kill ring</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/clear-kill-ring</span> ()
  <span style="color: #9ac8e0;">"Clear the '</span><span style="color: #00bcff;">kill-ring</span><span style="color: #9ac8e0;">'."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">setq</span> kill-ring nil))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf129237" class="outline-3">
<h3 id="orgf129237"><span class="section-number-3">2.6.</span> Configure appearance</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(load-theme 'modus-vivendi t)

<span style="color: #989898;">;; </span><span style="color: #989898;">Increase font size.</span>
(set-face-attribute 'default nil <span style="color: #f78fe7;">:height</span> 140)
(set-face-attribute 'mode-line nil <span style="color: #f78fe7;">:height</span> 100)

<span style="color: #989898;">;; </span><span style="color: #989898;">Enable globally set relative line numbers.</span>
(global-display-line-numbers-mode)
(<span style="color: #b6a0ff;">setq</span> display-line-numbers-type 'relative)

<span style="color: #989898;">;; </span><span style="color: #989898;">Display keypresses.</span>
(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">keycast</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:init</span>
  (keycast-mode)
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> keycast-mode-line-remove-tail-elements nil)
  <span style="color: #f78fe7;">:defer</span> t)

<span style="color: #989898;">;; </span><span style="color: #989898;">Highlight the current line globally.</span>
(global-hl-line-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga7adf25" class="outline-3">
<h3 id="orga7adf25"><span class="section-number-3">2.7.</span> Set indentation defaults</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org49664f1" class="outline-4">
<h4 id="org49664f1"><span class="section-number-4">2.7.1.</span> Set custom variable for single sourcing indentation width</h4>
<div class="outline-text-4" id="text-2-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defcustom</span> <span style="color: #00d3d0;">jdb/indent-width</span> 2
  <span style="color: #9ac8e0;">"Set default indent width."</span>
  <span style="color: #f78fe7;">:group</span> 'jdb
  <span style="color: #f78fe7;">:type</span> 'string)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a9a4dd" class="outline-4">
<h4 id="org0a9a4dd"><span class="section-number-4">2.7.2.</span> Default to spaces</h4>
<div class="outline-text-4" id="text-2-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq-default</span> indent-tabs-mode nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org2bad783" class="outline-4">
<h4 id="org2bad783"><span class="section-number-4">2.7.3.</span> Infer whether a file is using spaces or tabs</h4>
<div class="outline-text-4" id="text-2-7-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">infer-indentation-style</span> ()
  <span style="color: #9ac8e0;">"Infer whether a file is indented with spaces or tabs."</span>
  (<span style="color: #b6a0ff;">let</span> ((spaces (how-many <span style="color: #79a8ff;">"^  "</span> (point-min) (point-max)))
        (tabs (how-many <span style="color: #79a8ff;">"^\t"</span> (point-min) (point-max))))
    (<span style="color: #b6a0ff;">if</span> (&gt; spaces tabs) (<span style="color: #b6a0ff;">setq</span> indent-tabs-mode nil))
    (<span style="color: #b6a0ff;">if</span> (&gt; tabs spaces) (<span style="color: #b6a0ff;">setq</span> indent-tabs-mode t))))
(add-hook 'prog-mode-hook 'infer-indentation-style)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1a264d" class="outline-4">
<h4 id="orgc1a264d"><span class="section-number-4">2.7.4.</span> Set default tab display width and tab stop sequence</h4>
<div class="outline-text-4" id="text-2-7-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq-default</span> tab-width jdb/indent-width)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf67954" class="outline-4">
<h4 id="orgbf67954"><span class="section-number-4">2.7.5.</span> Configure default width for SMIE indentation</h4>
<div class="outline-text-4" id="text-2-7-5">
<p>
Most modes that indent using SMIE rules will have their own <code>&lt;MODE&gt;-basic-offset</code> custom varaible.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq-default</span> smie-indent-basic jdb/indent-width)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4148bb" class="outline-4">
<h4 id="orga4148bb"><span class="section-number-4">2.7.6.</span> Set <code>sh-mode</code> basic offset</h4>
<div class="outline-text-4" id="text-2-7-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq-default</span> sh-basic-offset jdb/indent-width)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc744b4" class="outline-4">
<h4 id="orgfc744b4"><span class="section-number-4">2.7.7.</span> Set <code>js-json-mode</code> and <code>js-mode</code> basic offsets</h4>
<div class="outline-text-4" id="text-2-7-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq-default</span> js-indent-level jdb/indent-width)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8deb3b" class="outline-4">
<h4 id="orgf8deb3b"><span class="section-number-4">2.7.8.</span> Stop electric-indent-mode interfering with the previous line</h4>
<div class="outline-text-4" id="text-2-7-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq-default</span> electric-indent-mode t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgeaefe86" class="outline-3">
<h3 id="orgeaefe86"><span class="section-number-3">2.8.</span> Use envrc environment variables</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">direnv</span> <span style="color: #f78fe7;">:ensure</span> t <span style="color: #f78fe7;">:init</span> (direnv-mode))
</pre>
</div>
</div>
</div>
