.config/nixos/modules/emacs/config.org
** Use Ivy, Swiper, and Counsel for more effective minibuffers

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package ivy
    :ensure t
    :init (ivy-mode)
    :commands (ivy-mode)
    :config
    (setq ivy-display-style 'fancy)
    (setq ivy-use-virtual-buffers t)
    (setq ivy-use-selectable-prompt t)
    (setq enable-recursive-minibuffers t)
    (setq search-default-mode #'char-fold-to-regexp))

  (use-package swiper
    :ensure t
    :after ivy
    :bind (("C-s" . swiper)))

  (use-package counsel :init (counsel-mode))
#+end_src

** Use company for better completions

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package company :ensure t :init (global-company-mode))
#+end_src

** Intercept shell-mode comint commands

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defun shell-comint-send-input ()
    "Interfere with 'comint-send-input' to facilitate redirect to a buffer."
    (interactive)
    (let ((line (buffer-substring (line-beginning-position) (line-end-position))))
      (cond ((string-match (rx "(compile " (group (* (not ")"))) ")") line)
             (let ((compilation-buffer-name-function (lambda (_) line)))
               (direnv-update-environment)
               (comint-add-to-input-history line)
               (compile (match-string 1 line))))
            ((string-match (rx (* " ") (group (*? any)) (? " ") ">>>" (? " ") "#<" (group (* (not ">"))) ">") line)
             (let ((compilation-buffer-name-function (lambda (_) (match-string 2 line))))
               (direnv-update-environment)
               (comint-add-to-input-history line)
               (compile (match-string 1 line))))
            (t (comint-send-input)))))

  (add-hook 'shell-mode-hook (lambda () (local-set-key (kbd "RET")  'shell-comint-send-input)))
#+end_src

** xterm-color support

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package xterm-color
    :ensure t
    :config
    ;; xterm-color for shell mode.
    (add-hook 'shell-mode-hook
              (lambda ()
                ;; Disable font-locking in this buffer to improve performance
                (font-lock-mode -1)
                ;; Prevent font-locking from being re-enabled in this buffer
                (make-local-variable 'font-lock-function)
                (setq font-lock-function (lambda (_) nil))
                (add-hook 'comint-preoutput-filter-functions 'xterm-color-filter nil t)))

    ;; xterm-color for compilation-shell-minor-mode (used by comint).
    ;; TODO: Find alternative solution as this is not recommended by xterm-color due to font-lock
    ;; performance degradation.
    (add-hook 'compilation-shell-minor-mode-hook
              (lambda () (add-hook 'comint-preoutput-filter-functions 'xterm-color-filter nil t)))

    ;; xterm-color for compilation-mode.
    (setq compilation-environment '("TERM=xterm-256color"))
    (defun jdb/advice-compilation-filter (f proc string)
      (funcall f proc (xterm-color-filter string)))
    (advice-add 'compilation-filter :around #'jdb/advice-compilation-filter)

    ;; xterm-color for ripgrep.
    ;; From https://github.com/dajva/rg.el/issues/65.
    (define-advice rg-run (:around (orig-fn &rest args) "no-xterm-color")
      (let ((compilation-start-hook
             (remove 'my-compilation-start-hook compilation-start-hook))
            compilation-environment)
        (apply orig-fn args)))

    (setq comint-output-filter-functions
          (remove 'ansi-color-process-output comint-output-filter-functions)))
#+end_src

** Publish blog

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defun jdb/org-html-postamble (plist)
    (format "Last update : %s" (format-time-string "%d %b %Y")))
  (setq org-html-postamble 'jdb/org-html-postamble)
  (setq org-publish-project-alist
        '(("blog"
           :auto-sitemap t
           :sitemap-filename "index.org"
           :sitemap-title "Blog"

           :base-directory "~/blog/"
           :publishing-function org-html-publish-to-html
           :publishing-directory "~/blog"
           :section-numbers nil
           :with-toc t)))
#+end_src

