.config/nixos/modules/emacs/config.html

<div id="outline-container-org1dab625" class="outline-3">
<h3 id="org1dab625"><span class="section-number-3">2.9.</span> Use Ivy, Swiper, and Counsel for more effective minibuffers</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">ivy</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:init</span> (ivy-mode)
  <span style="color: #f78fe7;">:commands</span> (ivy-mode)
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> ivy-display-style 'fancy)
  (<span style="color: #b6a0ff;">setq</span> ivy-use-virtual-buffers t)
  (<span style="color: #b6a0ff;">setq</span> ivy-use-selectable-prompt t)
  (<span style="color: #b6a0ff;">setq</span> enable-recursive-minibuffers t)
  (<span style="color: #b6a0ff;">setq</span> search-default-mode #'char-fold-to-regexp))

(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">swiper</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:after</span> ivy
  <span style="color: #f78fe7;">:bind</span> ((<span style="color: #79a8ff;">"C-s"</span> . swiper)))

(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">counsel</span> <span style="color: #f78fe7;">:init</span> (counsel-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e2379a" class="outline-3">
<h3 id="org8e2379a"><span class="section-number-3">2.10.</span> Use company for better completions</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">company</span> <span style="color: #f78fe7;">:ensure</span> t <span style="color: #f78fe7;">:init</span> (global-company-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8179c66" class="outline-3">
<h3 id="org8179c66"><span class="section-number-3">2.11.</span> Intercept shell-mode comint commands</h3>
<div class="outline-text-3" id="text-2-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">shell-comint-send-input</span> ()
  <span style="color: #9ac8e0;">"Interfere with '</span><span style="color: #00bcff;">comint-send-input</span><span style="color: #9ac8e0;">' to facilitate redirect to a buffer."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> ((line (buffer-substring (line-beginning-position) (line-end-position))))
    (<span style="color: #b6a0ff;">cond</span> ((string-match (<span style="color: #b6a0ff;">rx</span> <span style="color: #79a8ff;">"(compile "</span> (group (* (not <span style="color: #79a8ff;">")"</span>))) <span style="color: #79a8ff;">")"</span>) line)
           (<span style="color: #b6a0ff;">let</span> ((compilation-buffer-name-function (<span style="color: #b6a0ff;">lambda</span> (_) line)))
             (direnv-update-environment)
             (comint-add-to-input-history line)
             (compile (match-string 1 line))))
          ((string-match (<span style="color: #b6a0ff;">rx</span> (* <span style="color: #79a8ff;">" "</span>) (group (*? any)) (? <span style="color: #79a8ff;">" "</span>) <span style="color: #79a8ff;">"&gt;&gt;&gt;"</span> (? <span style="color: #79a8ff;">" "</span>) <span style="color: #79a8ff;">"#&lt;"</span> (group (* (not <span style="color: #79a8ff;">"&gt;"</span>))) <span style="color: #79a8ff;">"&gt;"</span>) line)
           (<span style="color: #b6a0ff;">let</span> ((compilation-buffer-name-function (<span style="color: #b6a0ff;">lambda</span> (_) (match-string 2 line))))
             (direnv-update-environment)
             (comint-add-to-input-history line)
             (compile (match-string 1 line))))
          (t (comint-send-input)))))

(add-hook 'shell-mode-hook (<span style="color: #b6a0ff;">lambda</span> () (local-set-key (kbd <span style="color: #79a8ff;">"RET"</span>)  'shell-comint-send-input)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org95ac1b2" class="outline-3">
<h3 id="org95ac1b2"><span class="section-number-3">2.12.</span> xterm-color support</h3>
<div class="outline-text-3" id="text-2-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">xterm-color</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:config</span>
  <span style="color: #989898;">;; </span><span style="color: #989898;">xterm-color for shell mode.</span>
  (add-hook 'shell-mode-hook
            (<span style="color: #b6a0ff;">lambda</span> ()
              <span style="color: #989898;">;; </span><span style="color: #989898;">Disable font-locking in this buffer to improve performance</span>
              (font-lock-mode -1)
              <span style="color: #989898;">;; </span><span style="color: #989898;">Prevent font-locking from being re-enabled in this buffer</span>
              (make-local-variable 'font-lock-function)
              (<span style="color: #b6a0ff;">setq</span> font-lock-function (<span style="color: #b6a0ff;">lambda</span> (_) nil))
              (add-hook 'comint-preoutput-filter-functions 'xterm-color-filter nil t)))

  <span style="color: #989898;">;; </span><span style="color: #989898;">xterm-color for compilation-shell-minor-mode (used by comint).</span>
  <span style="color: #989898;">;; </span><span style="color: #989898;">TODO: Find alternative solution as this is not recommended by xterm-color due to font-lock</span>
  <span style="color: #989898;">;; </span><span style="color: #989898;">performance degradation.</span>
  (add-hook 'compilation-shell-minor-mode-hook
            (<span style="color: #b6a0ff;">lambda</span> () (add-hook 'comint-preoutput-filter-functions 'xterm-color-filter nil t)))

  <span style="color: #989898;">;; </span><span style="color: #989898;">xterm-color for compilation-mode.</span>
  (<span style="color: #b6a0ff;">setq</span> compilation-environment '(<span style="color: #79a8ff;">"TERM=xterm-256color"</span>))
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/advice-compilation-filter</span> (f proc string)
    (funcall f proc (xterm-color-filter string)))
  (advice-add 'compilation-filter <span style="color: #f78fe7;">:around</span> #'jdb/advice-compilation-filter)

  <span style="color: #989898;">;; </span><span style="color: #989898;">xterm-color for ripgrep.</span>
  <span style="color: #989898;">;; </span><span style="color: #989898;">From https://github.com/dajva/rg.el/issues/65.</span>
  (<span style="color: #b6a0ff;">define-advice</span> <span style="color: #feacd0;">rg-run</span> (<span style="color: #f78fe7;">:around</span> (orig-fn <span style="color: #6ae4b9;">&amp;rest</span> args) <span style="color: #79a8ff;">"no-xterm-color"</span>)
    (<span style="color: #b6a0ff;">let</span> ((compilation-start-hook
           (remove 'my-compilation-start-hook compilation-start-hook))
          compilation-environment)
      (apply orig-fn args)))

  (<span style="color: #b6a0ff;">setq</span> comint-output-filter-functions
        (remove 'ansi-color-process-output comint-output-filter-functions)))
</pre>
</div>
</div>
</div>
