.config/nixos/modules/emacs/config.html

<div id="outline-container-org4fa1a2a" class="outline-3">
<h3 id="org4fa1a2a"><span class="section-number-3">2.13.</span> Ligatures</h3>
<div class="outline-text-3" id="text-2-13">
<p>
From <a href="https://github.com/mickeynp/ligature.el/wiki#cascadia--fira-code">https://github.com/mickeynp/ligature.el/wiki#cascadia--fira-code</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">ligature</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:config</span>
  <span style="color: #989898;">;; </span><span style="color: #989898;">Enable all Cascadia and Fira Code ligatures in programming modes.</span>
  (ligature-set-ligatures
   'prog-mode
   '(<span style="color: #989898;">;; </span><span style="color: #989898;">== === ==== =&gt; =| =&gt;&gt;=&gt;=|=&gt;==&gt;&gt; ==&lt; =/=//=// =~</span>
     <span style="color: #989898;">;; </span><span style="color: #989898;">=:= =!=</span>
     (<span style="color: #79a8ff;">"="</span> (<span style="color: #b6a0ff;">rx</span> (+ (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"&gt;"</span> <span style="color: #79a8ff;">"&lt;"</span> <span style="color: #79a8ff;">"|"</span> <span style="color: #79a8ff;">"/"</span> <span style="color: #79a8ff;">"~"</span> <span style="color: #79a8ff;">":"</span> <span style="color: #79a8ff;">"!"</span> <span style="color: #79a8ff;">"="</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">;; ;;;</span>
     (<span style="color: #79a8ff;">";"</span> (<span style="color: #b6a0ff;">rx</span> (+ <span style="color: #79a8ff;">";"</span>)))
     <span style="color: #989898;">;; </span><span style="color: #989898;">&amp;&amp; &amp;&amp;&amp;</span>
     (<span style="color: #79a8ff;">"&amp;"</span> (<span style="color: #b6a0ff;">rx</span> (+ <span style="color: #79a8ff;">"&amp;"</span>)))
     <span style="color: #989898;">;; </span><span style="color: #989898;">!! !!! !. !: !!. != !== !~</span>
     (<span style="color: #79a8ff;">"!"</span> (<span style="color: #b6a0ff;">rx</span> (+ (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"="</span> <span style="color: #79a8ff;">"!"</span> <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">."</span> <span style="color: #79a8ff;">":"</span> <span style="color: #79a8ff;">"~"</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">?? ??? ?:  ?=  ?.</span>
     (<span style="color: #79a8ff;">"?"</span> (<span style="color: #b6a0ff;">rx</span> (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">":"</span> <span style="color: #79a8ff;">"="</span> <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">."</span> (+ <span style="color: #79a8ff;">"?"</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">%% %%%</span>
     (<span style="color: #79a8ff;">"%"</span> (<span style="color: #b6a0ff;">rx</span> (+ <span style="color: #79a8ff;">"%"</span>)))
     <span style="color: #989898;">;; </span><span style="color: #989898;">|&gt; ||&gt; |||&gt; ||||&gt; |] |} || ||| |-&gt; ||-||</span>
     <span style="color: #989898;">;; </span><span style="color: #989898;">|-&gt;&gt;-||-&lt;&lt;-| |- |== ||=||</span>
     <span style="color: #989898;">;; </span><span style="color: #989898;">|==&gt;&gt;==&lt;&lt;==&lt;=&gt;==//==/=!==:===&gt;</span>
     (<span style="color: #79a8ff;">"|"</span> (<span style="color: #b6a0ff;">rx</span> (+ (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"&gt;"</span> <span style="color: #79a8ff;">"&lt;"</span> <span style="color: #79a8ff;">"|"</span> <span style="color: #79a8ff;">"/"</span> <span style="color: #79a8ff;">":"</span> <span style="color: #79a8ff;">"!"</span> <span style="color: #79a8ff;">"}"</span> <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">]"</span>
                     <span style="color: #79a8ff;">"-"</span> <span style="color: #79a8ff;">"="</span> ))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">\\ \\\ \/</span>
     (<span style="color: #79a8ff;">"\\"</span> (<span style="color: #b6a0ff;">rx</span> (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"/"</span> (+ <span style="color: #79a8ff;">"\\"</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">++ +++ ++++ +&gt;</span>
     (<span style="color: #79a8ff;">"+"</span> (<span style="color: #b6a0ff;">rx</span> (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"&gt;"</span> (+ <span style="color: #79a8ff;">"+"</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">:: ::: :::: :&gt; :&lt; := :// ::=</span>
     (<span style="color: #79a8ff;">":"</span> (<span style="color: #b6a0ff;">rx</span> (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"&gt;"</span> <span style="color: #79a8ff;">"&lt;"</span> <span style="color: #79a8ff;">"="</span> <span style="color: #79a8ff;">"//"</span> <span style="color: #79a8ff;">":="</span> (+ <span style="color: #79a8ff;">":"</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">// /// //// /\ /* /&gt; /===:===!=//===&gt;&gt;==&gt;==/</span>
     (<span style="color: #79a8ff;">"/"</span> (<span style="color: #b6a0ff;">rx</span> (+ (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"&gt;"</span>  <span style="color: #79a8ff;">"&lt;"</span> <span style="color: #79a8ff;">"|"</span> <span style="color: #79a8ff;">"/"</span> <span style="color: #79a8ff;">"\\"</span> <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">*"</span> <span style="color: #79a8ff;">":"</span> <span style="color: #79a8ff;">"!"</span>
                     <span style="color: #79a8ff;">"="</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">.. ... .... .= .- .? ..= ..&lt;</span>
     (<span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">."</span> (<span style="color: #b6a0ff;">rx</span> (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"="</span> <span style="color: #79a8ff;">"-"</span> <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">?"</span> <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">.="</span> <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">.&lt;"</span> (+ <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">."</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">-- --- ---- -~ -&gt; -&gt;&gt; -| -|-&gt;--&gt;&gt;-&gt;--&lt;&lt;-|</span>
     (<span style="color: #79a8ff;">"-"</span> (<span style="color: #b6a0ff;">rx</span> (+ (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"&gt;"</span> <span style="color: #79a8ff;">"&lt;"</span> <span style="color: #79a8ff;">"|"</span> <span style="color: #79a8ff;">"~"</span> <span style="color: #79a8ff;">"-"</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">*&gt; */ *)  ** *** ****</span>
     (<span style="color: #79a8ff;">"*"</span> (<span style="color: #b6a0ff;">rx</span> (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"&gt;"</span> <span style="color: #79a8ff;">"/"</span> <span style="color: #79a8ff;">")"</span> (+ <span style="color: #79a8ff;">"*"</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">www wwww</span>
     (<span style="color: #79a8ff;">"w"</span> (<span style="color: #b6a0ff;">rx</span> (+ <span style="color: #79a8ff;">"w"</span>)))
     <span style="color: #989898;">;; </span><span style="color: #989898;">&lt;&gt; &lt;!-- &lt;|&gt; &lt;: &lt;~ &lt;~&gt; &lt;~~ &lt;+ &lt;* &lt;$ &lt;/  &lt;+&gt; &lt;*&gt;</span>
     <span style="color: #989898;">;; </span><span style="color: #989898;">&lt;$&gt; &lt;/&gt; &lt;|  &lt;||  &lt;||| &lt;|||| &lt;- &lt;-| &lt;-&lt;&lt;-|-&gt; &lt;-&gt;&gt;</span>
     <span style="color: #989898;">;; </span><span style="color: #989898;">&lt;&lt;-&gt; &lt;= &lt;=&gt; &lt;&lt;==&lt;&lt;==&gt;=|=&gt;==/==//=!==:=&gt;</span>
     <span style="color: #989898;">;; </span><span style="color: #989898;">&lt;&lt; &lt;&lt;&lt; &lt;&lt;&lt;&lt;</span>
     (<span style="color: #79a8ff;">"&lt;"</span> (<span style="color: #b6a0ff;">rx</span> (+ (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">+"</span> <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">*"</span> <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">$"</span> <span style="color: #79a8ff;">"&lt;"</span> <span style="color: #79a8ff;">"&gt;"</span> <span style="color: #79a8ff;">":"</span> <span style="color: #79a8ff;">"~"</span>  <span style="color: #79a8ff;">"!"</span>
                     <span style="color: #79a8ff;">"-"</span>  <span style="color: #79a8ff;">"/"</span> <span style="color: #79a8ff;">"|"</span> <span style="color: #79a8ff;">"="</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">&gt;: &gt;- &gt;&gt;- &gt;--|-&gt; &gt;&gt;-|-&gt; &gt;= &gt;== &gt;&gt;== &gt;=|=:=&gt;&gt;</span>
     <span style="color: #989898;">;; </span><span style="color: #989898;">&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt;&gt;</span>
     (<span style="color: #79a8ff;">"&gt;"</span> (<span style="color: #b6a0ff;">rx</span> (+ (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"&gt;"</span> <span style="color: #79a8ff;">"&lt;"</span> <span style="color: #79a8ff;">"|"</span> <span style="color: #79a8ff;">"/"</span> <span style="color: #79a8ff;">":"</span> <span style="color: #79a8ff;">"="</span> <span style="color: #79a8ff;">"-"</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">#: #= #! #( #? #[ #{ #_ #_( ## ### #####</span>
     (<span style="color: #79a8ff;">"#"</span> (<span style="color: #b6a0ff;">rx</span> (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">":"</span> <span style="color: #79a8ff;">"="</span> <span style="color: #79a8ff;">"!"</span> <span style="color: #79a8ff;">"("</span> <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">?"</span> <span style="color: #79a8ff;">"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">["</span> <span style="color: #79a8ff;">"{"</span> <span style="color: #79a8ff;">"_("</span> <span style="color: #79a8ff;">"_"</span>
                  (+ <span style="color: #79a8ff;">"#"</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">~~ ~~~ ~=  ~-  ~@ ~&gt; ~~&gt;</span>
     (<span style="color: #79a8ff;">"~"</span> (<span style="color: #b6a0ff;">rx</span> (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"&gt;"</span> <span style="color: #79a8ff;">"="</span> <span style="color: #79a8ff;">"-"</span> <span style="color: #79a8ff;">"@"</span> <span style="color: #79a8ff;">"~&gt;"</span> (+ <span style="color: #79a8ff;">"~"</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">__ ___ ____ _|_ __|____|_</span>
     (<span style="color: #79a8ff;">"_"</span> (<span style="color: #b6a0ff;">rx</span> (+ (<span style="color: #b6a0ff;">or</span> <span style="color: #79a8ff;">"_"</span> <span style="color: #79a8ff;">"|"</span>))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">Fira code: 0xFF 0x12</span>
     (<span style="color: #79a8ff;">"0"</span> (<span style="color: #b6a0ff;">rx</span> (<span style="color: #b6a0ff;">and</span> <span style="color: #79a8ff;">"x"</span> (+ (in <span style="color: #79a8ff;">"A-F"</span> <span style="color: #79a8ff;">"a-f"</span> <span style="color: #79a8ff;">"0-9"</span>)))))
     <span style="color: #989898;">;; </span><span style="color: #989898;">Fira code:</span>
     <span style="color: #79a8ff;">"Fl"</span>  <span style="color: #79a8ff;">"Tl"</span>  <span style="color: #79a8ff;">"fi"</span>  <span style="color: #79a8ff;">"fj"</span>  <span style="color: #79a8ff;">"fl"</span>  <span style="color: #79a8ff;">"ft"</span>
     <span style="color: #989898;">;; </span><span style="color: #989898;">The few not covered by the regexps.</span>
     <span style="color: #79a8ff;">"{|"</span>  <span style="color: #79a8ff;">"[|"</span>  <span style="color: #79a8ff;">"]#"</span>  <span style="color: #79a8ff;">"(*"</span>  <span style="color: #79a8ff;">"}#"</span>  <span style="color: #79a8ff;">"$&gt;"</span>  <span style="color: #79a8ff;">"^="</span>)))
</pre>
</div>
</div>
</div>
