.config/nixos/modules/emacs/config.org
** Highlight erroneous whitespace

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package whitespace
    :ensure t
    :init
    (global-whitespace-mode 1)
    :config
    (setq-default whitespace-line-column 160)
    (setq-default whitespace-style '(face trailing tabs lines lines-tail newline indentation space-after-tab empty space-before-tab tab-mark newline-mark))
    ;; From: https://emacs.stackexchange.com/questions/38771/magit-status-does-not-open-when-using-global-whitespace-mode-1/38779.
    (add-function :before-while whitespace-enable-predicate
                  (lambda ()
                    (not (derived-mode-p #'magit-mode #'shell-mode)))))
#+end_src

** Add extra information to dired listing

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package dired :config   (setq dired-listing-switches "-alh"))
#+end_src

** Enable multiple cursors

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package multiple-cursors
    :ensure t
    :bind
    (("C->" . mc/mark-next-like-this)
     ("C-<" . mc/mark-previous-like-this)
     ("C-c C-<" . mc/mark-all-like-this)))
#+end_src

** Expand region at point

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package expand-region
    :ensure t
    :bind
    (("C-." . er/expand-region)
     ("C-," . er/contract-region)))
#+end_src

** Development environments
*** Flycheck

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package flycheck
    :config
    (global-flycheck-mode 1)
    ;; Set flycheck to inherit the Emacs load path configured by Nix.
    (setq flycheck-emacs-lisp-load-path 'inherit))

  (use-package flycheck-golangci-lint
    :hook (go-mode . flycheck-golangci-lint-setup)
    :config
    (defvar-local flycheck-local-checkers nil)
    (setq flycheck-golangci-lint-enable-all t)
    (setq flycheck-golangci-lint-disable-linters '("lll")))
#+end_src

*** LSP

Useful configuration for Go is documented in https://github.com/golang/tools/blob/master/gopls/doc/emacs.md.

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package eglot
    :after company project yasnippet
    :config
    (use-package project)

    (defun project-find-go-module (dir)
      (when-let ((root (locate-dominating-file dir "go.mod")))
        (cons 'go-module root)))

    (cl-defmethod project-root ((project (head go-module)))
      (cdr project))

    (add-hook 'project-find-functions #'project-find-go-module)

    (setq-default eglot-workspace-configuration
                  '((:gopls . ((gofumpt . t)))))
    ;; The depth of -10 places this before eglot's willSave notification,
    ;; so that that notification reports the actual contents that will be saved.
    (defun eglot-format-buffer-on-save ()
      (add-hook 'before-save-hook #'eglot-format-buffer -10 t))
    (add-hook 'go-mode-hook #'eglot-format-buffer-on-save)
    :hook
    (nix-mode . eglot-ensure)
    (go-mode . eglot-ensure))
#+end_src

*** Agda

#+html: <aside>
#+begin_note
**NOTE:** This is not currently in use.
#+end_note
#+html: </aside>

#+begin_src emacs-lisp
  (use-package agda2-mode)
#+end_src

*** Bash

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package flymake :hook (sh-mode flymake-shellcheck-load))
#+end_src

*** Emacs Lisp

Display debugger stack frames as a list.

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq debugger-stack-frame-as-list t)
#+end_src

*** Go

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package go-mode
    :ensure t
    :mode "\\.go\\'")
#+end_src

*** Haskell

#+html: <aside>
#+begin_note
**NOTE:** This is not currently in use.
#+end_note
#+html: </aside>

#+begin_src emacs-lisp
  (use-package haskell-mode)
#+end_src

*** JavaScript

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package js2-mode
    :ensure t
    :mode
    (("\\.js\\'" . js2-mode)))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package typescript-mode
    :ensure t
    :mode "\\.ts\\'"
    :config
    (setq typescript-indent-level 2))
#+end_src

