.config/nixos/modules/emacs/config.html

<div id="outline-container-org7b5dcb8" class="outline-3">
<h3 id="org7b5dcb8"><span class="section-number-3">2.14.</span> Highlight erroneous whitespace</h3>
<div class="outline-text-3" id="text-2-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">whitespace</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:init</span>
  (global-whitespace-mode 1)
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq-default</span> whitespace-line-column 160)
  (<span style="color: #b6a0ff;">setq-default</span> whitespace-style '(face trailing tabs lines lines-tail newline indentation space-after-tab empty space-before-tab tab-mark newline-mark))
  <span style="color: #989898;">;; </span><span style="color: #989898;">From: https://emacs.stackexchange.com/questions/38771/magit-status-does-not-open-when-using-global-whitespace-mode-1/38779.</span>
  (<span style="color: #b6a0ff;">add-function</span> <span style="color: #f78fe7;">:before-while</span> whitespace-enable-predicate
                (<span style="color: #b6a0ff;">lambda</span> ()
                  (not (derived-mode-p #'magit-mode #'shell-mode)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org59e2e4f" class="outline-3">
<h3 id="org59e2e4f"><span class="section-number-3">2.15.</span> Add extra information to dired listing</h3>
<div class="outline-text-3" id="text-2-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">dired</span> <span style="color: #f78fe7;">:config</span>   (<span style="color: #b6a0ff;">setq</span> dired-listing-switches <span style="color: #79a8ff;">"-alh"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8929d62" class="outline-3">
<h3 id="org8929d62"><span class="section-number-3">2.16.</span> Enable multiple cursors</h3>
<div class="outline-text-3" id="text-2-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">multiple-cursors</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:bind</span>
  ((<span style="color: #79a8ff;">"C-&gt;"</span> . mc/mark-next-like-this)
   (<span style="color: #79a8ff;">"C-&lt;"</span> . mc/mark-previous-like-this)
   (<span style="color: #79a8ff;">"C-c C-&lt;"</span> . mc/mark-all-like-this)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc5b723" class="outline-3">
<h3 id="orgcc5b723"><span class="section-number-3">2.17.</span> Expand region at point</h3>
<div class="outline-text-3" id="text-2-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">expand-region</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:bind</span>
  ((<span style="color: #79a8ff;">"C-."</span> . er/expand-region)
   (<span style="color: #79a8ff;">"C-,"</span> . er/contract-region)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org12d5b66" class="outline-3">
<h3 id="org12d5b66"><span class="section-number-3">2.18.</span> Development environments</h3>
<div class="outline-text-3" id="text-2-18">
</div>
<div id="outline-container-org6597cf3" class="outline-4">
<h4 id="org6597cf3"><span class="section-number-4">2.18.1.</span> Flycheck</h4>
<div class="outline-text-4" id="text-2-18-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">flycheck</span>
  <span style="color: #f78fe7;">:config</span>
  (global-flycheck-mode 1)
  <span style="color: #989898;">;; </span><span style="color: #989898;">Set flycheck to inherit the Emacs load path configured by Nix.</span>
  (<span style="color: #b6a0ff;">setq</span> flycheck-emacs-lisp-load-path 'inherit))

(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">flycheck-golangci-lint</span>
  <span style="color: #f78fe7;">:hook</span> (go-mode . flycheck-golangci-lint-setup)
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">defvar-local</span> <span style="color: #00d3d0;">flycheck-local-checkers</span> nil)
  (<span style="color: #b6a0ff;">setq</span> flycheck-golangci-lint-enable-all t)
  (<span style="color: #b6a0ff;">setq</span> flycheck-golangci-lint-disable-linters '(<span style="color: #79a8ff;">"lll"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga18a5f6" class="outline-4">
<h4 id="orga18a5f6"><span class="section-number-4">2.18.2.</span> LSP</h4>
<div class="outline-text-4" id="text-2-18-2">
<p>
Useful configuration for Go is documented in <a href="https://github.com/golang/tools/blob/master/gopls/doc/emacs.md">https://github.com/golang/tools/blob/master/gopls/doc/emacs.md</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">eglot</span>
  <span style="color: #f78fe7;">:after</span> company project yasnippet
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">project</span>)

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">project-find-go-module</span> (dir)
    (<span style="color: #b6a0ff;">when-let</span> ((root (locate-dominating-file dir <span style="color: #79a8ff;">"go.mod"</span>)))
      (cons 'go-module root)))

  (<span style="color: #b6a0ff;">cl-defmethod</span> <span style="color: #feacd0;">project-root</span> ((project (head go-module)))
    (cdr project))

  (add-hook 'project-find-functions #'project-find-go-module)

  (<span style="color: #b6a0ff;">setq-default</span> eglot-workspace-configuration
                '((<span style="color: #f78fe7;">:gopls</span> . ((gofumpt . t)))))
  <span style="color: #989898;">;; </span><span style="color: #989898;">The depth of -10 places this before eglot's willSave notification,</span>
  <span style="color: #989898;">;; </span><span style="color: #989898;">so that that notification reports the actual contents that will be saved.</span>
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">eglot-format-buffer-on-save</span> ()
    (add-hook 'before-save-hook #'eglot-format-buffer -10 t))
  (add-hook 'go-mode-hook #'eglot-format-buffer-on-save)
  <span style="color: #f78fe7;">:hook</span>
  (nix-mode . eglot-ensure)
  (go-mode . eglot-ensure))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5baec5d" class="outline-4">
<h4 id="org5baec5d"><span class="section-number-4">2.18.3.</span> Agda</h4>
<div class="outline-text-4" id="text-2-18-3">
<aside>
<div class="note" id="org8e44beb">
<p>
<b><b>NOTE:</b></b> This is not currently in use.
</p>

</div>
</aside>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">agda2-mode</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5bfdc8d" class="outline-4">
<h4 id="org5bfdc8d"><span class="section-number-4">2.18.4.</span> Bash</h4>
<div class="outline-text-4" id="text-2-18-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">flymake</span> <span style="color: #f78fe7;">:hook</span> (sh-mode flymake-shellcheck-load))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc69b4ef" class="outline-4">
<h4 id="orgc69b4ef"><span class="section-number-4">2.18.5.</span> Emacs Lisp</h4>
<div class="outline-text-4" id="text-2-18-5">
<p>
Display debugger stack frames as a list.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> debugger-stack-frame-as-list t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9c5e41" class="outline-4">
<h4 id="orgf9c5e41"><span class="section-number-4">2.18.6.</span> Go</h4>
<div class="outline-text-4" id="text-2-18-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">go-mode</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:mode</span> <span style="color: #79a8ff;">"\\.go\\'"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d3e149" class="outline-4">
<h4 id="org9d3e149"><span class="section-number-4">2.18.7.</span> Haskell</h4>
<div class="outline-text-4" id="text-2-18-7">
<aside>
<div class="note" id="org8a3f2c3">
<p>
<b><b>NOTE:</b></b> This is not currently in use.
</p>

</div>
</aside>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">haskell-mode</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcbf3761" class="outline-4">
<h4 id="orgcbf3761"><span class="section-number-4">2.18.8.</span> JavaScript</h4>
<div class="outline-text-4" id="text-2-18-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">js2-mode</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:mode</span>
  ((<span style="color: #79a8ff;">"\\.js\\'"</span> . js2-mode)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">typescript-mode</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:mode</span> <span style="color: #79a8ff;">"\\.ts\\'"</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> typescript-indent-level 2))
</pre>
</div>
</div>
</div>
