.config/nixos/modules/emacs/config.org
*** Jsonnet

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package jsonnet-mode
    :ensure t
    :hook (jsonnet-mode . prettify-jsonnet)
    :config
    (defun prettify-jsonnet()
      "Display some jsonnet keywords as pretty Unicode symbols."
      (setq prettify-symbols-alist
            '(("function" . ?λ)
              ("std." . ?​) ;; Note this is a zero width space.
              (": { " . ?.))))
    (defun jdb/docs-jsonnet-stdlib ()
      "Open the Jsonnet stdlib documentation."
      (interactive)
      (browse-url "https://jsonnet.org/ref/stdlib.html")))
#+end_src

*** Markdown

**** Follow relref targets

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package markdown-mode
    :ensure t
    :config
    (defun markdown-relref-translate (filename)
      "Translate FILENAME into a link that can be followed.
  Specifically, translating Hugo relrefs into filenames."
      (replace-regexp-in-string "\\(?:{{< relref \"\\)" "" filename))
    (setq markdown-translate-filename-function 'markdown-relref-translate)
    (defun jdb/markdown-heading-id (heading)
      "Tranform HEADING into the GitHub identifier that an be used as an anchor."
      (interactive "sHeading: \n")
      (message (mapconcat (lambda (char)
                            (cond
                             ((or (char-equal char ?-) (char-equal char ? ))                          "-")
                             ((memq (get-char-code-property char 'general-category) '(Ll Lu Lo Lt Lm Mn Mc Me Nl))
                              (char-to-string (downcase char)))
                             (t "")))
                          heading))))
#+end_src

**** Define Vale linters

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package flycheck
    :ensure t
    :config
    (flycheck-define-checker vale-error
      "A checker for prose errors."
      :command ("~/bin/vale" "--minAlertLevel" "error" source)
      :standard-input nil
      :error-patterns
      ((error line-start (file-name) ":" line ":" column ":" (id (one-or-more (not (any ":")))) ":" (message) line-end))
      :modes (markdown-mode org-mode text-mode))
    (flycheck-define-checker vale-warning
      "A checker for prose warnings."
      :command ("~/bin/vale" "--minAlertLevel" "warning" source)
      :standard-input nil
      :error-patterns
      ((warning line-start (file-name) ":" line ":" column ":" (id (one-or-more (not (any ":")))) ":" (message) line-end))
      :modes (markdown-mode org-mode text-mode))
    (add-to-list 'flycheck-checkers 'vale-error 'append)
    (add-to-list 'flycheck-checkers 'vale-warning 'append))
#+end_src

**** Define ~doc-validator~ linter

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package flycheck
    :ensure t
    :config
    (flycheck-define-checker doc-validator
      "A checker Hugo Markdown source."
      :command ("~/bin/doc-validator" source source-original)
      :standard-input nil
      :error-patterns
      ((error line-start "ERROR: " (file-name) ":" line ":" column " " (message) line-end))
      :modes (markdown-mode org-mode text-mode))
    (add-to-list 'flycheck-checkers 'doc-validator 'append))
#+end_src

**** Code aware spell checking

#+html: <aside>
#+begin_note
**NOTE:** This is purposefully defined after the Vale and doc-validator linters so that flycheck's automatic selection picks those first.
#+end_note
#+html: </aside>

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package flycheck-aspell
    :ensure t
    :config
    (add-to-list 'flycheck-checkers 'tex-aspell-dynamic 'append)
    (add-to-list 'flycheck-checkers 'markdown-aspell-dynamic 'append)
    (add-to-list 'flycheck-checkers 'html-aspell-dynamic 'append)
    (add-to-list 'flycheck-checkers 'xml-aspell-dynamic 'append)
    (add-to-list 'flycheck-checkers 'mail-aspell-dynamic 'append))
#+end_src

**** Define flycheck linter chain

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (flycheck-add-next-checker 'doc-validator 'vale-error)
  (flycheck-add-next-checker 'vale-error '(error . vale-warning))
  (flycheck-add-next-checker 'vale-warning 'markdown-aspell-dynamic)
#+end_src

*** Nix

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package nix-mode
    :ensure t
    :init (nix-prettify-global-mode t)
    :mode "\\.nix\\'")
#+end_src

*** River

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (add-to-list 'load-path "~/ext/jdbaldry/river-mode/")
  (use-package river-mode :hook (before-save . river-format-before-save))
#+end_src

*** Terraform

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package terraform-mode
    :ensure t
    :hook (terraform-mode-hook . terraform-format-on-save-mode))
#+end_src

** Forges

*** GitHub

