.config/nixos/modules/emacs/config.html

<div id="outline-container-org5d8d8d3" class="outline-4">
<h4 id="org5d8d8d3"><span class="section-number-4">2.18.9.</span> Jsonnet</h4>
<div class="outline-text-4" id="text-2-18-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">jsonnet-mode</span>
  <span style="color: #f78fe7;">:hook</span> (jsonnet-mode . prettify-jsonnet)
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">prettify-jsonnet</span>()
    <span style="color: #9ac8e0;">"Display some jsonnet keywords as pretty Unicode symbols."</span>
    (<span style="color: #b6a0ff;">setq</span> prettify-symbols-alist
          '((<span style="color: #79a8ff;">"function"</span> . ?&#955;)
            (<span style="color: #79a8ff;">"std."</span> . ?&#8203;) <span style="color: #989898;">;; </span><span style="color: #989898;">Note this is a zero width space.</span>
            (<span style="color: #79a8ff;">": { "</span> . ?.))))
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/docs-jsonnet-stdlib</span> ()
    <span style="color: #9ac8e0;">"Open the Jsonnet stdlib documentation."</span>
    (<span style="color: #b6a0ff;">interactive</span>)
    (browse-url <span style="color: #79a8ff;">"https://jsonnet.org/ref/stdlib.html"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org98bc33e" class="outline-4">
<h4 id="org98bc33e"><span class="section-number-4">2.18.10.</span> Markdown</h4>
<div class="outline-text-4" id="text-2-18-10">
</div>
<ol class="org-ol">
<li><a id="orgee26b17"></a>Follow relref targets<br />
<div class="outline-text-5" id="text-2-18-10-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">markdown-mode</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">markdown-relref-translate</span> (filename)
    <span style="color: #9ac8e0;">"Translate FILENAME into a link that can be followed.</span>
<span style="color: #9ac8e0;">Specifically, translating Hugo relrefs into filenames."</span>
    (replace-regexp-in-string <span style="color: #79a8ff;">"</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(?:</span><span style="color: #79a8ff;">{{&lt; relref \"</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">"</span> <span style="color: #79a8ff;">""</span> filename))
  (<span style="color: #b6a0ff;">setq</span> markdown-translate-filename-function 'markdown-relref-translate)
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/markdown-heading-id</span> (heading)
    <span style="color: #9ac8e0;">"Tranform HEADING into the GitHub identifier that an be used as an anchor."</span>
    (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sHeading: \n"</span>)
    (message (mapconcat (<span style="color: #b6a0ff;">lambda</span> (char)
                          (<span style="color: #b6a0ff;">cond</span>
                           ((<span style="color: #b6a0ff;">or</span> (char-equal char ?-) (char-equal char ? ))                          <span style="color: #79a8ff;">"-"</span>)
                           ((memq (get-char-code-property char 'general-category) '(Ll Lu Lo Lt Lm Mn Mc Me Nl))
                            (char-to-string (downcase char)))
                           (t <span style="color: #79a8ff;">""</span>)))
                        heading))))
</pre>
</div>
</div>
</li>

<li><a id="org89c8c88"></a>Define Vale linters<br />
<div class="outline-text-5" id="text-2-18-10-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">flycheck-define-checker</span> vale-error
  <span style="color: #9ac8e0;">"A checker for prose errors."</span>
  <span style="color: #f78fe7;">:command</span> (<span style="color: #79a8ff;">"~/bin/vale"</span> <span style="color: #79a8ff;">"--minAlertLevel"</span> <span style="color: #79a8ff;">"error"</span> source)
  <span style="color: #f78fe7;">:standard-input</span> nil
  <span style="color: #f78fe7;">:error-patterns</span>
  ((<span style="color: #fec43f;">error</span> line-start (file-name) <span style="color: #79a8ff;">":"</span> line <span style="color: #79a8ff;">":"</span> column <span style="color: #79a8ff;">":"</span> (id (one-or-more (not (any <span style="color: #79a8ff;">":"</span>)))) <span style="color: #79a8ff;">":"</span> (message) line-end))
  <span style="color: #f78fe7;">:modes</span> (markdown-mode org-mode text-mode))
(<span style="color: #b6a0ff;">flycheck-define-checker</span> vale-warning
  <span style="color: #9ac8e0;">"A checker for prose warnings."</span>
  <span style="color: #f78fe7;">:command</span> (<span style="color: #79a8ff;">"~/bin/vale"</span> <span style="color: #79a8ff;">"--minAlertLevel"</span> <span style="color: #79a8ff;">"warning"</span> source)
  <span style="color: #f78fe7;">:standard-input</span> nil
  <span style="color: #f78fe7;">:error-patterns</span>
  ((warning line-start (file-name) <span style="color: #79a8ff;">":"</span> line <span style="color: #79a8ff;">":"</span> column <span style="color: #79a8ff;">":"</span> (id (one-or-more (not (any <span style="color: #79a8ff;">":"</span>)))) <span style="color: #79a8ff;">":"</span> (message) line-end))
  <span style="color: #f78fe7;">:modes</span> (markdown-mode org-mode text-mode))
(add-to-list 'flycheck-checkers 'vale-error 'append)
(add-to-list 'flycheck-checkers 'vale-warning 'append)
</pre>
</div>
</div>
</li>

<li><a id="org0c322b2"></a>Define <code>doc-validator</code> linter<br />
<div class="outline-text-5" id="text-2-18-10-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">flycheck-define-checker</span> doc-validator
    <span style="color: #9ac8e0;">"A checker Hugo Markdown source."</span>
    <span style="color: #f78fe7;">:command</span> (<span style="color: #79a8ff;">"~/bin/doc-validator"</span> source source-original)
    <span style="color: #f78fe7;">:standard-input</span> nil
    <span style="color: #f78fe7;">:error-patterns</span>
    ((<span style="color: #fec43f;">error</span> line-start <span style="color: #79a8ff;">"ERROR: "</span> (file-name) <span style="color: #79a8ff;">":"</span> line <span style="color: #79a8ff;">":"</span> column <span style="color: #79a8ff;">" "</span> (message) line-end))
    <span style="color: #f78fe7;">:modes</span> (markdown-mode org-mode text-mode))
  (add-to-list 'flycheck-checkers 'doc-validator 'append)
</pre>
</div>
</div>
</li>

<li><a id="orgd506401"></a>Code aware spell checking<br />
<div class="outline-text-5" id="text-2-18-10-4">
<aside>
<div class="note" id="org5a64afc">
<p>
<b><b>NOTE:</b></b> This is purposefully defined after the Vale and doc-validator linters so that flycheck's automatic selection picks those first.
</p>

</div>
</aside>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">flycheck-aspell</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:config</span>
  (add-to-list 'flycheck-checkers 'tex-aspell-dynamic 'append)
  (add-to-list 'flycheck-checkers 'markdown-aspell-dynamic 'append)
  (add-to-list 'flycheck-checkers 'html-aspell-dynamic 'append)
  (add-to-list 'flycheck-checkers 'xml-aspell-dynamic 'append)
  (add-to-list 'flycheck-checkers 'mail-aspell-dynamic 'append))
</pre>
</div>
</div>
</li>

<li><a id="org709ff73"></a>Define flycheck linter chain<br />
<div class="outline-text-5" id="text-2-18-10-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(flycheck-add-next-checker 'doc-validator 'vale-error)
(flycheck-add-next-checker 'vale-error '(<span style="color: #fec43f;">error</span> . vale-warning))
(flycheck-add-next-checker 'vale-warning 'markdown-aspell-dynamic)
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgd44c3fa" class="outline-4">
<h4 id="orgd44c3fa"><span class="section-number-4">2.18.11.</span> Nix</h4>
<div class="outline-text-4" id="text-2-18-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">nix-mode</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:init</span> (nix-prettify-global-mode t)
  <span style="color: #f78fe7;">:mode</span> <span style="color: #79a8ff;">"\\.nix\\'"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd082c4b" class="outline-4">
<h4 id="orgd082c4b"><span class="section-number-4">2.18.12.</span> River</h4>
<div class="outline-text-4" id="text-2-18-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #79a8ff;">"~/ext/jdbaldry/river-mode/"</span>)
(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">river-mode</span> <span style="color: #f78fe7;">:hook</span> (before-save . river-format-before-save))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d9a313" class="outline-4">
<h4 id="org5d9a313"><span class="section-number-4">2.18.13.</span> Terraform</h4>
<div class="outline-text-4" id="text-2-18-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">terraform-mode</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:hook</span> (terraform-mode-hook . terraform-format-on-save-mode))
</pre>
</div>
</div>
</div>
</div>
