.config/nixos/modules/emacs/config.html

<div id="outline-container-orgc9b770e" class="outline-3">
<h3 id="orgc9b770e"><span class="section-number-3">2.19.</span> Forges</h3>
<div class="outline-text-3" id="text-2-19">
</div>
<div id="outline-container-orgca0c293" class="outline-4">
<h4 id="orgca0c293"><span class="section-number-4">2.19.1.</span> GitHub</h4>
<div class="outline-text-4" id="text-2-19-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">ghub</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:commands</span> ghub-post
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/gh-create-repo</span>(repo)
    <span style="color: #9ac8e0;">"Create a new GitHub repository REPO."</span>
    (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sRepository: \n"</span>)
    (ghub-post <span style="color: #79a8ff;">"/user/repos"</span> nil <span style="color: #f78fe7;">:payload</span> `((name . ,repo)))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgff3f916" class="outline-3">
<h3 id="orgff3f916"><span class="section-number-3">2.20.</span> Automatically revert buffers if the file changes</h3>
<div class="outline-text-3" id="text-2-20">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-auto-revert-mode 1)
(add-hook 'dired-mode-hook 'auto-revert-mode)
</pre>
</div>
</div>
</div>
