.config/nixos/modules/emacs/config.org
** Use magit for git

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  ;; TODO: What is looking for a *usually* void variables `n' and `x'?
  (setq-default n nil)
  (setq-default x nil)
  (use-package magit
    :ensure t
    :commands (magit-status magit-display-buffer-same-window-except-diff-v1)
    :config
    (setq magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    :defer nil
    :init (global-set-key (kbd "C-x g") #'magit-status))

  (use-package transient :config (setq transient-default-level 7))
#+end_src

