.config/nixos/modules/emacs/config.html

<div id="outline-container-org1a70b76" class="outline-3">
<h3 id="org1a70b76"><span class="section-number-3">2.21.</span> Use magit for git</h3>
<div class="outline-text-3" id="text-2-21">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #989898;">;; </span><span style="color: #989898;">TODO: What is looking for a *usually* void variables `</span><span style="color: #00bcff;">n</span><span style="color: #989898;">' and `</span><span style="color: #00bcff;">x</span><span style="color: #989898;">'?</span>
(<span style="color: #b6a0ff;">setq-default</span> n nil)
(<span style="color: #b6a0ff;">setq-default</span> x nil)
(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">magit</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:commands</span> (magit-status magit-display-buffer-same-window-except-diff-v1)
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  <span style="color: #f78fe7;">:defer</span> nil
  <span style="color: #f78fe7;">:init</span> (global-set-key (kbd <span style="color: #79a8ff;">"C-x g"</span>) #'magit-status))

(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">transient</span> <span style="color: #f78fe7;">:config</span> (<span style="color: #b6a0ff;">setq</span> transient-default-level 7))
</pre>
</div>
</div>
