.config/nixos/modules/emacs/config.html

<div id="outline-container-org33130b6" class="outline-4">
<h4 id="org33130b6"><span class="section-number-4">2.21.1.</span> Use difftastic for diffing</h4>
<div class="outline-text-4" id="text-2-21-1">
<p>
From <a href="https://tsdh.org/posts/2022-08-01-difftastic-diffing-with-magit.html">https://tsdh.org/posts/2022-08-01-difftastic-diffing-with-magit.html</a>.
</p>

<aside>
<div class="note" id="org87e78a8">
<p>
<b><b>NOTE:</b></b> This is not currently in use.
</p>

</div>
</aside>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">transient</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">xterm-color</span>)

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">th/magit--with-difftastic</span> (buffer command)
    <span style="color: #9ac8e0;">"Run COMMAND with GIT_EXTERNAL_DIFF=difft then show result in BUFFER."</span>
    (<span style="color: #b6a0ff;">let</span> ((process-environment
           (cons (concat <span style="color: #79a8ff;">"GIT_EXTERNAL_DIFF=difft --width="</span>
                         (number-to-string (frame-width)))
                 process-environment)))
      <span style="color: #989898;">;; </span><span style="color: #989898;">Clear the result buffer (we might regenerate a diff, e.g., for</span>
      <span style="color: #989898;">;; </span><span style="color: #989898;">the current changes in our working directory).</span>
      (<span style="color: #b6a0ff;">with-current-buffer</span> buffer
        (<span style="color: #b6a0ff;">setq</span> buffer-read-only nil)
        (erase-buffer))
      <span style="color: #989898;">;; </span><span style="color: #989898;">Now spawn a process calling the git COMMAND.</span>
      (make-process
       <span style="color: #f78fe7;">:name</span> (buffer-name buffer)
       <span style="color: #f78fe7;">:buffer</span> buffer
       <span style="color: #f78fe7;">:command</span> command
       <span style="color: #989898;">;; </span><span style="color: #989898;">Don't query for running processes when emacs is quit.</span>
       <span style="color: #f78fe7;">:noquery</span> t
       <span style="color: #989898;">;; </span><span style="color: #989898;">Show the result buffer once the process has finished.</span>
       <span style="color: #f78fe7;">:sentinel</span> (<span style="color: #b6a0ff;">lambda</span> (proc event)
                   (<span style="color: #b6a0ff;">when</span> (eq (process-status proc) 'exit)
                     (<span style="color: #b6a0ff;">with-current-buffer</span> (process-buffer proc)
                       (goto-char (point-min))
                       (xterm-color-colorize-buffer)
                       (<span style="color: #b6a0ff;">setq</span> buffer-read-only t)
                       (view-mode)
                       (end-of-line)
                       <span style="color: #989898;">;; </span><span style="color: #989898;">difftastic diffs are usually 2-column side-by-side,</span>
                       <span style="color: #989898;">;; </span><span style="color: #989898;">so ensure our window is wide enough.</span>
                       (<span style="color: #b6a0ff;">let</span> ((width (current-column)))
                         (<span style="color: #b6a0ff;">while</span> (zerop (forward-line 1))
                           (end-of-line)
                           (<span style="color: #b6a0ff;">setq</span> width (max (current-column) width)))
                         <span style="color: #989898;">;; </span><span style="color: #989898;">Add column size of fringes</span>
                         (<span style="color: #b6a0ff;">setq</span> width (+ width
                                        (fringe-columns 'left)
                                        (fringe-columns 'right)))
                         (goto-char (point-min))
                         (pop-to-buffer
                          (current-buffer)
                          `(<span style="color: #989898;">;; </span><span style="color: #989898;">If the buffer is that wide that splitting the frame in</span>
                            <span style="color: #989898;">;; </span><span style="color: #989898;">two side-by-side windows would result in less than</span>
                            <span style="color: #989898;">;; </span><span style="color: #989898;">80 columns left, ensure it's shown at the bottom.</span>
                            ,(<span style="color: #b6a0ff;">when</span> (&gt; 80 (- (frame-width) width))
                               #'display-buffer-at-bottom)
                            (window-width
                             . ,(min width (frame-width))))))))))))
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">th/magit-show-with-difftastic</span> (rev)
    <span style="color: #9ac8e0;">"Show the result of \"git show REV\" with GIT_EXTERNAL_DIFF=difft."</span>
    (<span style="color: #b6a0ff;">interactive</span>
     (list (<span style="color: #b6a0ff;">or</span>
            <span style="color: #989898;">;; </span><span style="color: #989898;">If REV is given, just use it.</span>
            (<span style="color: #b6a0ff;">when</span> (boundp 'rev) rev)
            <span style="color: #989898;">;; </span><span style="color: #989898;">If not invoked with prefix arg, try to guess the REV from</span>
            <span style="color: #989898;">;; </span><span style="color: #989898;">point's position.</span>
            (<span style="color: #b6a0ff;">and</span> (not current-prefix-arg)
                 (<span style="color: #b6a0ff;">or</span> (thing-at-point 'git-revision t)
                     (magit-branch-or-commit-at-point)))
            <span style="color: #989898;">;; </span><span style="color: #989898;">Otherwise, query the user.</span>
            (magit-read-branch-or-commit <span style="color: #79a8ff;">"Revision"</span>))))
    (<span style="color: #b6a0ff;">if</span> (not rev)
        (<span style="color: #fec43f;">error</span> <span style="color: #79a8ff;">"No revision specified"</span>)
      (th/magit--with-difftastic
       (get-buffer-create (concat <span style="color: #79a8ff;">"*git show difftastic "</span> rev <span style="color: #79a8ff;">"*"</span>))
       (list <span style="color: #79a8ff;">"git"</span> <span style="color: #79a8ff;">"--no-pager"</span> <span style="color: #79a8ff;">"show"</span> <span style="color: #79a8ff;">"--ext-diff"</span> rev))))
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">th/magit-diff-with-difftastic</span> (arg)
    <span style="color: #9ac8e0;">"Show the result of \"git diff ARG\" with GIT_EXTERNAL_DIFF=difft."</span>
    (<span style="color: #b6a0ff;">interactive</span>
     (list (<span style="color: #b6a0ff;">or</span>
            <span style="color: #989898;">;; </span><span style="color: #989898;">If RANGE is given, just use it.</span>
            (<span style="color: #b6a0ff;">when</span> (boundp 'range) range)
            <span style="color: #989898;">;; </span><span style="color: #989898;">If prefix arg is given, query the user.</span>
            (<span style="color: #b6a0ff;">and</span> current-prefix-arg
                 (magit-diff-read-range-or-commit <span style="color: #79a8ff;">"Range"</span>))
            <span style="color: #989898;">;; </span><span style="color: #989898;">Otherwise, auto-guess based on position of point, e.g., based on</span>
            <span style="color: #989898;">;; </span><span style="color: #989898;">if we are in the Staged or Unstaged section.</span>
            (<span style="color: #b6a0ff;">pcase</span> (magit-diff--dwim)
              ('unmerged (<span style="color: #fec43f;">error</span> <span style="color: #79a8ff;">"unmerged is not yet implemented"</span>))
              ('unstaged nil)
              ('staged <span style="color: #79a8ff;">"--cached"</span>)
              (`(stash . ,value) (<span style="color: #fec43f;">error</span> <span style="color: #79a8ff;">"stash is not yet implemented"</span>))
              (`(commit . ,value) (format <span style="color: #79a8ff;">"%s^..%s"</span> value value))
              ((<span style="color: #b6a0ff;">and</span> range (pred stringp)) range)
              (_ (magit-diff-read-range-or-commit <span style="color: #79a8ff;">"Range/Commit"</span>))))))
    (<span style="color: #b6a0ff;">let</span> ((name (concat <span style="color: #79a8ff;">"*git diff difftastic"</span>
                        (<span style="color: #b6a0ff;">if</span> arg (concat <span style="color: #79a8ff;">" "</span> arg) <span style="color: #79a8ff;">""</span>)
                        <span style="color: #79a8ff;">"*"</span>)))
      (th/magit--with-difftastic
       (get-buffer-create name)
       `(<span style="color: #79a8ff;">"git"</span> <span style="color: #79a8ff;">"--no-pager"</span> <span style="color: #79a8ff;">"diff"</span> <span style="color: #79a8ff;">"--ext-diff"</span> ,@(<span style="color: #b6a0ff;">when</span> arg (list arg))))))
  (<span style="color: #b6a0ff;">transient-define-prefix</span> <span style="color: #feacd0;">jdb/magit-difftastic</span> ()
    <span style="color: #9ac8e0;">"Personal magit commands."</span>
    [<span style="color: #79a8ff;">"Difftastic"</span>
     (<span style="color: #79a8ff;">"d"</span> <span style="color: #79a8ff;">"Difftastic Diff (dwim)"</span> th/magit-diff-with-difftastic)
     (<span style="color: #79a8ff;">"s"</span> <span style="color: #79a8ff;">"Difftastic Show"</span> th/magit-show-with-difftastic)])
  (define-key magit-status-mode-map (kbd <span style="color: #79a8ff;">"~"</span>) #'jdb/magit-difftastic)
  (transient-insert-suffix 'magit-dispatch (kbd <span style="color: #79a8ff;">"h"</span>) '(<span style="color: #79a8ff;">"~"</span> <span style="color: #79a8ff;">"Difftastic"</span> jdb/magit-difftastic)))
</pre>
</div>
</div>
</div>
