.config/nixos/modules/emacs/config.org
*** Add personal transients

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package transient
    :after magit
    :config
    (defun jdb/list-files (_ _ _)
      (let ((prune '(games .yarn .runelite ext .npm .Garmin Maildir .emacs_saves node_modules Slack BraveSoftware .zoom retroarch Code emojis elpa CacheStorage .git chromium go .cache .mozilla .kube .local nix vendor)))
        (split-string (shell-command-to-string (concat "find " (projectile-project-root) " " (string-join (mapcar (lambda (base) (format "-name '%s' -prune -o" base)) prune) " ") " -print")) "\n")))
    (transient-define-prefix jdb/add ()
      (interactive)
      (ivy-read "Add file: "
                #'jdb/list-files
                :action #'(lambda (file) (magit-run-git "add" "--" file))
                :caller 'jdb/add))
    (transient-define-prefix jdb/rm ()
      (interactive)
      (ivy-read "Remove file: "
                #'jdb/list-files
                :action #'(lambda (file) (magit-run-git "rm" "--" file))
                :caller 'jdb/rm))
    (transient-define-prefix jdb/magit-aux ()
      "Personal magit commands."
      ["Auxiliary commands"
       ("a" "Add" jdb/add)
       ("r" "Remove" jdb/rm)])
    (define-key magit-status-mode-map (kbd "#") #'jdb/magit-aux)
    (transient-insert-suffix 'magit-dispatch (kbd "h") '("#" "Aux" jdb/magit-aux)))
#+end_src

** Org
*** Code execution

**** Disable prompt for executing code blocks

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package org :config (setq org-confirm-babel-evaluate nil))
#+end_src

**** Configure evaluation for Jsonnet

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defun org-babel-execute:jsonnet (body params)
    "Execute a block of Jsonnet code with org-babel."
    (let ((input-file (org-babel-temp-file "n" ".jsonnet"))
          (jsonnet-path (or (cdr (assq :jsonnet-path params)) 0)))
      (with-temp-file input-file
        (insert body))
      (org-babel-eval
       (message "JSONNET_PATH=%s jsonnet %s" jsonnet-path (org-babel-process-file-name input-file))
       "")))
#+end_src

*** Export

**** Enable syntax highlighting

#+html: <aside>
#+begin_note
**NOTE:** The theme relies on a black background and white text ({background-color: #111111; color: #ffffff}).
#+end_note
#+html: </aside>

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package htmlize :ensure t :after org)
#+end_src

**** Enable Markdown export

#+html: <aside>
#+begin_note
**NOTE:** This still needs plenty of work to let org be my single source for producing content when so many places rely on prettier Markdown GitHub Flavored Markdown output.
#+end_note
#+html: </aside>

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package ox-gfm
    :after org
    :config (add-to-list 'org-export-backends 'gfm))
#+end_src

** Task management
