.config/nixos/modules/emacs/config.html

<div id="outline-container-org9f497f0" class="outline-4">
<h4 id="org9f497f0"><span class="section-number-4">2.21.2.</span> Add personal transients</h4>
<div class="outline-text-4" id="text-2-21-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">transient</span>
  <span style="color: #f78fe7;">:after</span> magit
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/list-files</span> (_ _ _)
    (<span style="color: #b6a0ff;">let</span> ((prune '(games .yarn .runelite ext .npm .Garmin Maildir .emacs_saves node_modules Slack BraveSoftware .zoom retroarch Code emojis elpa CacheStorage .git chromium go .cache .mozilla .kube .local nix vendor)))
      (split-string (shell-command-to-string (concat <span style="color: #79a8ff;">"find "</span> (projectile-project-root) <span style="color: #79a8ff;">" "</span> (string-join (mapcar (<span style="color: #b6a0ff;">lambda</span> (base) (format <span style="color: #79a8ff;">"-name '</span><span style="color: #00bcff;">%s</span><span style="color: #79a8ff;">' -prune -o"</span> base)) prune) <span style="color: #79a8ff;">" "</span>) <span style="color: #79a8ff;">" -print"</span>)) <span style="color: #79a8ff;">"\n"</span>)))
  (<span style="color: #b6a0ff;">transient-define-prefix</span> <span style="color: #feacd0;">jdb/add</span> ()
    (<span style="color: #b6a0ff;">interactive</span>)
    (ivy-read <span style="color: #79a8ff;">"Add file: "</span>
              #'jdb/list-files
              <span style="color: #f78fe7;">:action</span> #'(<span style="color: #b6a0ff;">lambda</span> (file) (magit-run-git <span style="color: #79a8ff;">"add"</span> <span style="color: #79a8ff;">"--"</span> file))
              <span style="color: #f78fe7;">:caller</span> 'jdb/add))
  (<span style="color: #b6a0ff;">transient-define-prefix</span> <span style="color: #feacd0;">jdb/rm</span> ()
    (<span style="color: #b6a0ff;">interactive</span>)
    (ivy-read <span style="color: #79a8ff;">"Remove file: "</span>
              #'jdb/list-files
              <span style="color: #f78fe7;">:action</span> #'(<span style="color: #b6a0ff;">lambda</span> (file) (magit-run-git <span style="color: #79a8ff;">"rm"</span> <span style="color: #79a8ff;">"--"</span> file))
              <span style="color: #f78fe7;">:caller</span> 'jdb/rm))
  (<span style="color: #b6a0ff;">transient-define-prefix</span> <span style="color: #feacd0;">jdb/magit-aux</span> ()
    <span style="color: #9ac8e0;">"Personal magit commands."</span>
    [<span style="color: #79a8ff;">"Auxiliary commands"</span>
     (<span style="color: #79a8ff;">"a"</span> <span style="color: #79a8ff;">"Add"</span> jdb/add)
     (<span style="color: #79a8ff;">"r"</span> <span style="color: #79a8ff;">"Remove"</span> jdb/rm)])
  (define-key magit-status-mode-map (kbd <span style="color: #79a8ff;">"#"</span>) #'jdb/magit-aux)
  (transient-insert-suffix 'magit-dispatch (kbd <span style="color: #79a8ff;">"h"</span>) '(<span style="color: #79a8ff;">"#"</span> <span style="color: #79a8ff;">"Aux"</span> jdb/magit-aux)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8d2ddd6" class="outline-3">
<h3 id="org8d2ddd6"><span class="section-number-3">2.22.</span> Org export</h3>
<div class="outline-text-3" id="text-2-22">
</div>
<div id="outline-container-org42ae5a3" class="outline-4">
<h4 id="org42ae5a3"><span class="section-number-4">2.22.1.</span> Enable syntax highlighting</h4>
<div class="outline-text-4" id="text-2-22-1">
<aside>
<div class="note" id="orgb87c121">
<p>
<b><b>NOTE:</b></b> The theme relies on a black background and white text ({background-color: #111111; color: #ffffff}).
</p>

</div>
</aside>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">htmlize</span> <span style="color: #f78fe7;">:ensure</span> t <span style="color: #f78fe7;">:after</span> org)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0f007e4" class="outline-4">
<h4 id="org0f007e4"><span class="section-number-4">2.22.2.</span> Enable Markdown export</h4>
<div class="outline-text-4" id="text-2-22-2">
<aside>
<div class="note" id="orga5706e7">
<p>
<b><b>NOTE:</b></b> This still needs plenty of work to let org be my single source for producing content when so many places rely on prettier Markdown GitHub Flavored Markdown output.
</p>

</div>
</aside>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">ox-gfm</span>
  <span style="color: #f78fe7;">:after</span> org
  <span style="color: #f78fe7;">:config</span> (add-to-list 'org-export-backends 'gfm))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org736ade0" class="outline-3">
<h3 id="org736ade0"><span class="section-number-3">2.23.</span> Task management</h3>
<div class="outline-text-3" id="text-2-23">
</div>
