.config/nixos/modules/emacs/config.org
*** Utilities

Define a regexp for capturing both parts of org-style links.

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defconst org-link-regexp
    (rx "[[" (group (one-or-more anything)) "][" (group (one-or-more anything)) "]]")
    "Regexp to match `org-mode' links in the form [[link][text]].
  There are capture groups for the link and text components.")
#+end_src

Use the Pomodoro technique

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package org-pomodoro
    :ensure t
    :hook (org-pomodoro-finished . (lambda () (message "Pomodoro complete!"))))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package org
    :bind
    (("C-c l" . org-store-link)
     ("C-c a" . org-agenda)
     ("C-c c" . org-capture))
    ("C-c C-l u" . jdb/urgent)
    ("C-c C-l i" . jdb/important)
    :hook
    (org-clock-in . jdb/org-slack-status)
    (org-clock-in . (lambda () (org-todo "PRGR")))
    (org-clock-out . (lambda () (jdb/slack-status "" "")))
    :config
    (setq org-startup-folded t)
    (setq org-adapt-indentation nil)
    (setq org-todo-keywords
          '((sequence "TODO" "PRGR" "DONE") (type "NOTD")))
    (setq org-todo-keyword-faces '(("PRGR" . "orange") ("NOTD" . "blue")))
    (setq org-log-done 'time)

    (defun jdb/org-30m () "Update effort to 30 minutes." (interactive) (org-set-effort nil "0:30"))
    (org-defkey org-mode-map (kbd "C-c C-x 3") #'jdb/org-30m)

    (defun jdb/org-1h () "Update effort to one hour." (interactive) (org-set-effort nil "1:00"))
    (org-defkey org-mode-map (kbd "C-c C-x 1") #'jdb/org-1h)

    (defun jdb/org-insert-link-with-title (url)
      "Insert URL with a description from the title."
      (interactive "sURL: \n")
      (org-insert-link nil url (jdb/tag-for-url url 'title))))

  (use-package org-clock)

  (defun jdb/format-YYYY-mm-dd (&optional time)
    "Format TIME to YYYY-mm-dd.
  If TIME is not provided, it defaults to the current time."
    (format-time-string "%Y-%m-%d" time))

  (defun jdb/next-working-day ()
    "Return the time of the next working day."
    (let ((today (string-to-number (format-time-string "%u"))))
      (if (>= today 5) (+ (time-convert nil 'integer) (* (- 8 today) 86400))
        (+ (time-convert nil 'integer) 86400))))

  (defun jdb/org-file (&optional time)
    "Return the org file for the day that TIME falls within.
  If TIME is not provided it defaults to the current time."
    (format "~/org/%s.org" (jdb/format-YYYY-mm-dd time)))

  (defun jdb/org-today ()
    "Create or open the org file for today."
    (interactive)
    (find-file (jdb/org-file)))

  (defun jdb/org-tomorrow ()
    "Create or open the org file for tomorrow."
    (interactive)
    (find-file (jdb/org-file (+ (time-convert nil 'integer) 86400))))

  (defun jdb/org-next ()
    "Create or open the next org file, only considering work days."
    (interactive)
    (find-file (jdb/org-file (jdb/next-working-day))))

  (defun jdb/org-file-prev ()
    "Return the org file for the previous working day.
  This relies on the sorted file names as `yesterday' isn't necessary the
  last file when files are only created on weekdays."
    (let ((yesterday (jdb/org-file (- (time-convert nil 'integer) 86400))))
      (cond ((file-exists-p yesterday) yesterday)
            ((file-exists-p (jdb/org-file))
             (car (last (butlast (directory-files "~/org" t "[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}.org$")))))
            (t (car (last (directory-files "~/org" t "[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}.org$")))))))

  (defun jdb/org-prev ()
    "Open the org file for the previous working day."
    (interactive)
    (find-file (jdb/org-file-prev)))

  (defun jdb/org-skip ()
    "Skip subtrees with a :personal: tag."
    (let ((subtree-end (save-excursion (org-end-of-subtree t))))
      (if (member "personal" (org-get-tags (point) t))
          subtree-end
        nil)))

  (defun jdb/add-tag (tag)
    "Add TAG to current headline."
    (org-set-tags (sort (cons tag (org-get-tags (point) t)) 'string-lessp)))

  (defun jdb/org-urgent () "Add urgent tag to headline." (interactive) (jdb/add-tag "urgent"))
  (defun jdb/org-important () "Add important tag to headline." (interactive) (jdb/add-tag "important"))

  (defun jdb/org-standup--remaining-effort ()
    "Return the remaining effort in minutes for the org-entry at point."
    (max
     (-
      (org-duration-to-minutes (or (org-entry-get (point) "EFFORT") "0:00"))
      (org-duration-to-minutes (org-clock-sum-current-item)))
     0.0))

  (defun jdb/org-standup--org-to-standup ()
    "Translate the `org-todo' entry at point into a standup entry."
    (format "- %s (EST %s) %s%s"
            (org-entry-get (point) "TODO")
            (format-seconds "%02h:%02m" (* 60 (jdb/org-standup--remaining-effort)))
            (replace-regexp-in-string org-link-regexp
                                      "[\\2](\\1)"
                                      (org-entry-get (point) "ITEM"))
            (let* ((tags (split-string (or (car (last (org-heading-components))) "") ":"))
                   (tag-string (concat
                                (if (member "urgent" tags) "U")
                                (if (member "important" tags) "I"))))
              (if (string-empty-p tag-string) "" (format " [%s]" tag-string)))))

  (defun jdb/org-standup ()
    "Translate `org-todo' entries into Slack standup message in kill ring."
    (interactive)
    (let ((total 0))
      (org-map-entries (lambda () (set 'total (+ total (* 60 (jdb/org-standup--remaining-effort)))))
                       t
                       `(,(jdb/org-file))
                       #'jdb/org-skip)
      (kill-new (string-join
                 `("*Today*"
                   ,@(org-map-entries 'jdb/org-standup--org-to-standup
                                      t
                                      `(,(jdb/org-file))
                                      #'jdb/org-skip)
                   ,(format "TOTAL %s" (format-seconds "%02h:%02m" total)))
                 "\n"))))

  (defun jdb/org-standup-last ()
    "Translate `org-todo' entries into a Slack standup for time spent yesterday."
    (interactive)
    (let ((total 0)
          (yesterday-start (-
                            (string-to-number
                             (shell-command-to-string "date -d '' +%s"))
                            86400)))
      (kill-new (string-join
                 `("*Last*"
                   ,@(org-map-entries
                      '(format "- %s (ACT %s ACC %3d٪) %s"
                               (org-entry-get (point) "TODO")
                               (progn
                                 (set 'total (+ total (* 60 (or (org-clock-sum-current-item yesterday-start) 0))))
                                 (format-seconds "%02h:%02m" (* 60 (or (org-clock-sum-current-item yesterday-start) 0))))
                               (let* ((split (split-string (or (org-entry-get (point) "EFFORT") "00:00") ":"))
                                      (hours (string-to-number (car split)))
                                      (mins (string-to-number (cadr split)))
                                      (effort-in-seconds (+ (* 3600 hours) (* 60 mins))))
                                 (* 100
                                    (+ 1
                                       (/
                                        (- (* 60.0 (or (org-clock-sum-current-item yesterday-start) 0)) effort-in-seconds)
                                        effort-in-seconds))))
                               (replace-regexp-in-string org-link-regexp
                                                         "[\\2](\\1)"
                                                         (org-entry-get (point) "ITEM")))
                      t
                      `(,(jdb/org-file-prev))
                      #'jdb/org-skip)
                   ,(format "TOTAL %s" (format-seconds "%02h:%02m" total)))
                 "\n"))))

  (defun jdb/org-carryover ()
    "Carry over unfinished tasks from the previous day."
    (interactive)
    (let ((curr (jdb/org-file))
          (prev (jdb/org-file-prev)))
      (org-map-entries
       (lambda ()
         (let ((entry (buffer-substring-no-properties (org-entry-beginning-position) (org-entry-end-position))))
           (with-current-buffer (find-file curr)
             (goto-char (point-max))
             (insert entry)
             (save-buffer))))
       nil
       (list prev)
       (lambda ()
         (let ((subtree-end (save-excursion (org-end-of-subtree t)))
               (todo (org-entry-get (point) "TODO")))
           (if (or (string= todo "DONE") (string= todo "NOTD"))
               subtree-end
             nil))))))
  (defun jdb/org-timetable ()
    "Append a time table to the current buffer."
    (interactive)
    (with-current-buffer (current-buffer)
      (goto-char (point-max))
      (insert (string-join '("* Total"
                             "  #+COLUMNS: %ITEM %TODO %4EFFORT(EST){:} %CLOCKSUM(ACT)"
                             "  #+BEGIN: columnview :hlines 1 :id global"
                             "  | ITEM | TODO |  EST | ACT |"
                             "  #+TBLFM:@>$3=vsum(@2..@-1);T::@>$4=vsum(@2..@-1);T"
                             "  #+END:") "\n"))))

  (defun jdb/org-pomodoro-kill () "Cancel a Pomodoro countdown." (interactive) (org-pomodoro-kill))
#+end_src

