.config/nixos/modules/emacs/config.html
<div id="outline-container-org0b3685a" class="outline-4">
<h4 id="org0b3685a"><span class="section-number-4">2.23.1.</span> Utilities</h4>
<div class="outline-text-4" id="text-2-23-1">
<p>
Define a regexp for capturing both parts of org-style links.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defconst</span> <span style="color: #00d3d0;">org-link-regexp</span>
  (<span style="color: #b6a0ff;">rx</span> <span style="color: #79a8ff;">"[["</span> (group (one-or-more anything)) <span style="color: #79a8ff;">"]["</span> (group (one-or-more anything)) <span style="color: #79a8ff;">"]]"</span>)
  <span style="color: #9ac8e0;">"Regexp to match `</span><span style="color: #00bcff;">org-mode</span><span style="color: #9ac8e0;">' links in the form [[link][text]].</span>
<span style="color: #9ac8e0;">There are capture groups for the link and text components."</span>)
</pre>
</div>

<p>
Use the Pomodoro technique
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">org-pomodoro</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:hook</span> (org-pomodoro-finished . (<span style="color: #b6a0ff;">lambda</span> () (message <span style="color: #79a8ff;">"Pomodoro complete!"</span>))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">org</span>
  <span style="color: #f78fe7;">:bind</span>
  ((<span style="color: #79a8ff;">"C-c l"</span> . org-store-link)
   (<span style="color: #79a8ff;">"C-c a"</span> . org-agenda)
   (<span style="color: #79a8ff;">"C-c c"</span> . org-capture))
  (<span style="color: #79a8ff;">"C-c C-l u"</span> . jdb/urgent)
  (<span style="color: #79a8ff;">"C-c C-l i"</span> . jdb/important)
  <span style="color: #f78fe7;">:hook</span>
  (org-clock-in . jdb/org-slack-status)
  (org-clock-in . (<span style="color: #b6a0ff;">lambda</span> () (org-todo <span style="color: #79a8ff;">"PRGR"</span>)))
  (org-clock-out . (<span style="color: #b6a0ff;">lambda</span> () (jdb/slack-status <span style="color: #79a8ff;">""</span> <span style="color: #79a8ff;">""</span>)))
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> org-startup-folded t)
  (<span style="color: #b6a0ff;">setq</span> org-adapt-indentation nil)
  (<span style="color: #b6a0ff;">setq</span> org-todo-keywords
        '((sequence <span style="color: #79a8ff;">"TODO"</span> <span style="color: #79a8ff;">"PRGR"</span> <span style="color: #79a8ff;">"DONE"</span>) (type <span style="color: #79a8ff;">"NOTD"</span>)))
  (<span style="color: #b6a0ff;">setq</span> org-todo-keyword-faces '((<span style="color: #79a8ff;">"PRGR"</span> . <span style="color: #79a8ff;">"orange"</span>) (<span style="color: #79a8ff;">"NOTD"</span> . <span style="color: #79a8ff;">"blue"</span>)))
  (<span style="color: #b6a0ff;">setq</span> org-log-done 'time)

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-30m</span> () <span style="color: #9ac8e0;">"Update effort to 30 minutes."</span> (<span style="color: #b6a0ff;">interactive</span>) (org-set-effort nil <span style="color: #79a8ff;">"0:30"</span>))
  (org-defkey org-mode-map (kbd <span style="color: #79a8ff;">"C-c C-x 3"</span>) #'jdb/org-30m)

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-1h</span> () <span style="color: #9ac8e0;">"Update effort to one hour."</span> (<span style="color: #b6a0ff;">interactive</span>) (org-set-effort nil <span style="color: #79a8ff;">"1:00"</span>))
  (org-defkey org-mode-map (kbd <span style="color: #79a8ff;">"C-c C-x 1"</span>) #'jdb/org-1h)

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-insert-link-with-title</span> (url)
    <span style="color: #9ac8e0;">"Insert URL with a description from the title."</span>
    (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sURL: \n"</span>)
    (org-insert-link nil url (jdb/tag-for-url url 'title))))

(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">org-clock</span>)

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/format-YYYY-mm-dd</span> (<span style="color: #6ae4b9;">&amp;optional</span> time)
  <span style="color: #9ac8e0;">"Format TIME to YYYY-mm-dd.</span>
<span style="color: #9ac8e0;">If TIME is not provided, it defaults to the current time."</span>
  (format-time-string <span style="color: #79a8ff;">"%Y-%m-%d"</span> time))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/next-working-day</span> ()
  <span style="color: #9ac8e0;">"Return the time of the next working day."</span>
  (<span style="color: #b6a0ff;">let</span> ((today (string-to-number (format-time-string <span style="color: #79a8ff;">"%u"</span>))))
    (<span style="color: #b6a0ff;">if</span> (&gt;= today 5) (+ (time-convert nil 'integer) (* (- 8 today) 86400))
      (+ (time-convert nil 'integer) 86400))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-file</span> (<span style="color: #6ae4b9;">&amp;optional</span> time)
  <span style="color: #9ac8e0;">"Return the org file for the day that TIME falls within.</span>
<span style="color: #9ac8e0;">If TIME is not provided it defaults to the current time."</span>
  (format <span style="color: #79a8ff;">"~/org/%s.org"</span> (jdb/format-YYYY-mm-dd time)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-today</span> ()
  <span style="color: #9ac8e0;">"Create or open the org file for today."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (find-file (jdb/org-file)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-tomorrow</span> ()
  <span style="color: #9ac8e0;">"Create or open the org file for tomorrow."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (find-file (jdb/org-file (+ (time-convert nil 'integer) 86400))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-next</span> ()
  <span style="color: #9ac8e0;">"Create or open the next org file, only considering work days."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (find-file (jdb/org-file (jdb/next-working-day))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-file-prev</span> ()
  <span style="color: #9ac8e0;">"Return the org file for the previous working day.</span>
<span style="color: #9ac8e0;">This relies on the sorted file names as `</span><span style="color: #00bcff;">yesterday</span><span style="color: #9ac8e0;">' isn't necessary the</span>
<span style="color: #9ac8e0;">last file when files are only created on weekdays."</span>
  (<span style="color: #b6a0ff;">let</span> ((yesterday (jdb/org-file (- (time-convert nil 'integer) 86400))))
    (<span style="color: #b6a0ff;">cond</span> ((file-exists-p yesterday) yesterday)
          ((file-exists-p (jdb/org-file))
           (car (last (butlast (directory-files <span style="color: #79a8ff;">"~/org"</span> t <span style="color: #79a8ff;">"[0-9]\\{</span><span style="color: #00d3d0;">4\\</span><span style="color: #79a8ff;">}-[0-9]\\{</span><span style="color: #00d3d0;">2\\</span><span style="color: #79a8ff;">}-[0-9]\\{</span><span style="color: #00d3d0;">2\\</span><span style="color: #79a8ff;">}.org$"</span>)))))
          (t (car (last (directory-files <span style="color: #79a8ff;">"~/org"</span> t <span style="color: #79a8ff;">"[0-9]\\{</span><span style="color: #00d3d0;">4\\</span><span style="color: #79a8ff;">}-[0-9]\\{</span><span style="color: #00d3d0;">2\\</span><span style="color: #79a8ff;">}-[0-9]\\{</span><span style="color: #00d3d0;">2\\</span><span style="color: #79a8ff;">}.org$"</span>)))))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-prev</span> ()
  <span style="color: #9ac8e0;">"Open the org file for the previous working day."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (find-file (jdb/org-file-prev)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-skip</span> ()
  <span style="color: #9ac8e0;">"Skip subtrees with a :personal: tag."</span>
  (<span style="color: #b6a0ff;">let</span> ((subtree-end (<span style="color: #b6a0ff;">save-excursion</span> (org-end-of-subtree t))))
    (<span style="color: #b6a0ff;">if</span> (member <span style="color: #79a8ff;">"personal"</span> (org-get-tags (point) t))
        subtree-end
      nil)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/add-tag</span> (tag)
  <span style="color: #9ac8e0;">"Add TAG to current headline."</span>
  (org-set-tags (sort (cons tag (org-get-tags (point) t)) 'string-lessp)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-urgent</span> () <span style="color: #9ac8e0;">"Add urgent tag to headline."</span> (<span style="color: #b6a0ff;">interactive</span>) (jdb/add-tag <span style="color: #79a8ff;">"urgent"</span>))
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-important</span> () <span style="color: #9ac8e0;">"Add important tag to headline."</span> (<span style="color: #b6a0ff;">interactive</span>) (jdb/add-tag <span style="color: #79a8ff;">"important"</span>))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-standup--remaining-effort</span> ()
  <span style="color: #9ac8e0;">"Return the remaining effort in minutes for the org-entry at point."</span>
  (max
   (-
    (org-duration-to-minutes (<span style="color: #b6a0ff;">or</span> (org-entry-get (point) <span style="color: #79a8ff;">"EFFORT"</span>) <span style="color: #79a8ff;">"0:00"</span>))
    (org-duration-to-minutes (org-clock-sum-current-item)))
   0.0))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-standup--org-to-standup</span> ()
  <span style="color: #9ac8e0;">"Translate the `</span><span style="color: #00bcff;">org-todo</span><span style="color: #9ac8e0;">' entry at point into a standup entry."</span>
  (format <span style="color: #79a8ff;">"- %s (EST %s) %s%s"</span>
          (org-entry-get (point) <span style="color: #79a8ff;">"TODO"</span>)
          (format-seconds <span style="color: #79a8ff;">"%02h:%02m"</span> (* 60 (jdb/org-standup--remaining-effort)))
          (replace-regexp-in-string org-link-regexp
                                    <span style="color: #79a8ff;">"[\\2](\\1)"</span>
                                    (org-entry-get (point) <span style="color: #79a8ff;">"ITEM"</span>))
          (<span style="color: #b6a0ff;">let*</span> ((tags (split-string (<span style="color: #b6a0ff;">or</span> (car (last (org-heading-components))) <span style="color: #79a8ff;">""</span>) <span style="color: #79a8ff;">":"</span>))
                 (tag-string (concat
                              (<span style="color: #b6a0ff;">if</span> (member <span style="color: #79a8ff;">"urgent"</span> tags) <span style="color: #79a8ff;">"U"</span>)
                              (<span style="color: #b6a0ff;">if</span> (member <span style="color: #79a8ff;">"important"</span> tags) <span style="color: #79a8ff;">"I"</span>))))
            (<span style="color: #b6a0ff;">if</span> (string-empty-p tag-string) <span style="color: #79a8ff;">""</span> (format <span style="color: #79a8ff;">" [%s]"</span> tag-string)))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-standup</span> ()
  <span style="color: #9ac8e0;">"Translate `</span><span style="color: #00bcff;">org-todo</span><span style="color: #9ac8e0;">' entries into Slack standup message in kill ring."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> ((total 0))
    (org-map-entries (<span style="color: #b6a0ff;">lambda</span> () (set 'total (+ total (* 60 (jdb/org-standup--remaining-effort)))))
                     t
                     `(,(jdb/org-file))
                     #'jdb/org-skip)
    (kill-new (string-join
               `(<span style="color: #79a8ff;">"*Today*"</span>
                 ,@(org-map-entries 'jdb/org-standup--org-to-standup
                                    t
                                    `(,(jdb/org-file))
                                    #'jdb/org-skip)
                 ,(format <span style="color: #79a8ff;">"TOTAL %s"</span> (format-seconds <span style="color: #79a8ff;">"%02h:%02m"</span> total)))
               <span style="color: #79a8ff;">"\n"</span>))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-standup-last</span> ()
  <span style="color: #9ac8e0;">"Translate `</span><span style="color: #00bcff;">org-todo</span><span style="color: #9ac8e0;">' entries into a Slack standup for time spent yesterday."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> ((total 0)
        (yesterday-start (-
                          (string-to-number
                           (shell-command-to-string <span style="color: #79a8ff;">"date -d '' +%s"</span>))
                          86400)))
    (kill-new (string-join
               `(<span style="color: #79a8ff;">"*Last*"</span>
                 ,@(org-map-entries
                    '(format <span style="color: #79a8ff;">"- %s (ACT %s ACC %3d&#1642;) %s"</span>
                             (org-entry-get (point) <span style="color: #79a8ff;">"TODO"</span>)
                             (<span style="color: #b6a0ff;">progn</span>
                               (set 'total (+ total (* 60 (<span style="color: #b6a0ff;">or</span> (org-clock-sum-current-item yesterday-start) 0))))
                               (format-seconds <span style="color: #79a8ff;">"%02h:%02m"</span> (* 60 (<span style="color: #b6a0ff;">or</span> (org-clock-sum-current-item yesterday-start) 0))))
                             (<span style="color: #b6a0ff;">let*</span> ((split (split-string (<span style="color: #b6a0ff;">or</span> (org-entry-get (point) <span style="color: #79a8ff;">"EFFORT"</span>) <span style="color: #79a8ff;">"00:00"</span>) <span style="color: #79a8ff;">":"</span>))
                                    (hours (string-to-number (car split)))
                                    (mins (string-to-number (cadr split)))
                                    (effort-in-seconds (+ (* 3600 hours) (* 60 mins))))
                               (* 100
                                  (+ 1
                                     (/
                                      (- (* 60.0 (<span style="color: #b6a0ff;">or</span> (org-clock-sum-current-item yesterday-start) 0)) effort-in-seconds)
                                      effort-in-seconds))))
                             (replace-regexp-in-string org-link-regexp
                                                       <span style="color: #79a8ff;">"[\\2](\\1)"</span>
                                                       (org-entry-get (point) <span style="color: #79a8ff;">"ITEM"</span>)))
                    t
                    `(,(jdb/org-file-prev))
                    #'jdb/org-skip)
                 ,(format <span style="color: #79a8ff;">"TOTAL %s"</span> (format-seconds <span style="color: #79a8ff;">"%02h:%02m"</span> total)))
               <span style="color: #79a8ff;">"\n"</span>))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-carryover</span> ()
  <span style="color: #9ac8e0;">"Carry over unfinished tasks from the previous day."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> ((curr (jdb/org-file))
        (prev (jdb/org-file-prev)))
    (org-map-entries
     (<span style="color: #b6a0ff;">lambda</span> ()
       (<span style="color: #b6a0ff;">let</span> ((entry (buffer-substring-no-properties (org-entry-beginning-position) (org-entry-end-position))))
         (<span style="color: #b6a0ff;">with-current-buffer</span> (find-file curr)
           (goto-char (point-max))
           (insert entry)
           (save-buffer))))
     nil
     (list prev)
     (<span style="color: #b6a0ff;">lambda</span> ()
       (<span style="color: #b6a0ff;">let</span> ((subtree-end (<span style="color: #b6a0ff;">save-excursion</span> (org-end-of-subtree t)))
             (todo (org-entry-get (point) <span style="color: #79a8ff;">"TODO"</span>)))
         (<span style="color: #b6a0ff;">if</span> (<span style="color: #b6a0ff;">or</span> (string= todo <span style="color: #79a8ff;">"DONE"</span>) (string= todo <span style="color: #79a8ff;">"NOTD"</span>))
             subtree-end
           nil))))))
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-timetable</span> ()
  <span style="color: #9ac8e0;">"Append a time table to the current buffer."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">with-current-buffer</span> (current-buffer)
    (goto-char (point-max))
    (insert (string-join '(<span style="color: #79a8ff;">"* Total"</span>
                           <span style="color: #79a8ff;">"  #+COLUMNS: %ITEM %TODO %4EFFORT(EST){:} %CLOCKSUM(ACT)"</span>
                           <span style="color: #79a8ff;">"  #+BEGIN: columnview :hlines 1 :id global"</span>
                           <span style="color: #79a8ff;">"  | ITEM | TODO |  EST | ACT |"</span>
                           <span style="color: #79a8ff;">"  #+TBLFM:@&gt;$3=vsum(@2..@-1);T::@&gt;$4=vsum(@2..@-1);T"</span>
                           <span style="color: #79a8ff;">"  #+END:"</span>) <span style="color: #fec43f;">"\n"</span><span style="color: #fec43f;">))))</span>

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-pomodoro-kill</span> () <span style="color: #9ac8e0;">"Cancel a Pomodoro countdown."</span> (<span style="color: #b6a0ff;">interactive</span>) (org-pomodoro-kill))
</pre>
</div>
</div>
</div>
