.config/nixos/modules/emacs/config.org
*** Interact with Slack
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package request)
  (defvar jdb/slack-api-url "https://slack.com/api")
  (defun jdb/slack-url-post (endpoint data &optional callback)
    "Make a POST request to Slack.
  ENDPOINT is a Slack RPC endpoint such as users.profile.set.
  DATA is the request body.
  CALLBACK is called on completion."
    (request (format "%s/%s" jdb/slack-api-url endpoint)
      :type "POST"
      :headers `(("Content-Type" . "application/json; charset=utf-8")
                 ("Authorization" . ,(concat "Bearer " (auth-source-pass-get 'secret "grafana/raintank-corp.slack.com"))))
      :data data
      :parser 'json-read
      :complete (or callback (cl-function
                              (lambda (&key response &allow-other-keys)
                                (message "%s: %s"
                                         (request-response-status-code response)
                                         (request-response-data response)))))))

  (defun jdb/slack-standup (text)
    "Post a standup message TEXT to the standup channel."
    (interactive "sText: \n")
    (jdb/slack-url-post "chat.postMessage"
                        (json-encode
                         `((channel . "C039JG5NDLP")
                           (text . ,text)))))

  (defun jdb/slack-react (channel timestamp name)
    "React to the TIMESTAMP in CHANNEL with emoji identified by NAME."
    (jdb/slack-url-post "react.add"
                        (json-encode
                         `((channel . ,channel)
                           (timestamp . ,timestamp)
                           (name . ,name)))))

  (defun jdb/slack-react-callback (channel timestamp text)
    "Return a `cl-function' that can be used as a request callback.
  The callback reacts to the TIMESTAMP message in CHANNEL with the
  alphabet emoji of the first character in TEXT."
    (lambda (&key response &allow-other-keys)
      (if (> (length text) 1)
          (funcall (jdb/slack-react-callback channel timestamp (substring text 1)) :response response :other-keys)
        (jdb/slack-react channel timestamp (string-to-char text)))))

  (defun jdb/slack-post-with-react (text channel &optional message)
    "Post TEXT to CHANNEL and react with TEXT alphabet emoji.
  If MESSAGE is non-nil, post that instead of TEXT."
    (interactive "sText: \nsChannel: \n")
    (jdb/slack-url-post
     "chat.postMessage"
     (json-encode
      `((channel . ,channel)
        (text . ,text)))
     (cl-function (lambda (&key response &allow-other-keys)
                    (let ((channel (alist-get 'channel (request-response-data response)))
                          (timestamp (alist-get 'ts (request-response-data response)))
                          (text (alist-get 'text (alist-get 'message (request-response-data response)))))
                      (funcall (jdb/slack-react-callback channel timestamp text) :response response :other-keys))))))

  (defvar jdb/slack-status-last-emoji nil "Last emoji used in a Slack status API request.")
  (defun jdb/slack-status (text &optional emoji)
    "Update Slack status.  TEXT is the status message.  EMOJI is the status emoji."
    (interactive "sText: \n")
    (let ((emoji (or emoji
                     (ivy-read "Emoji: "
                               (lambda (&rest _) jdb/slack-status--collection)
                               :action (lambda (emoji) (setq jdb/slack-status-last-emoji emoji))
                               :caller 'jdb/slack-status))))
      (jdb/slack-url-post
       "users.profile.set"
       (json-encode
        `(("profile" . (("status_text" . ,text) ("status_emoji" . ,emoji)))))
       (cl-function
        (lambda (&key response &allow-other-keys)
          (if (and
               (equal (request-response-status-code response) 200)
               (equal (alist-get 'ok (request-response-data response)) :json-false)
               jdb/slack-status-last-emoji)
              (customize-set-variable
               'jdb/slack-status--collection
               (add-to-list 'jdb/slack-status--collection jdb/slack-status-last-emoji))
            (customize-save-customized)))))
      (jdb/slack-url-post
       "users.setPresence"
       (json-encode `(("presence" . ,(if (string-empty-p text) "auto" "away")))))))

  (defun jdb/slack-clear ()
    "Clear Slack status."
    (interactive)
    (jdb/slack-status "" ""))

  (defun jdb/slack-status-with-time (text)
    "Update Slack status with TEXT formatted with the current time.
  '%s' should be used for the text substition."
    (interactive "sText: \n")
    (funcall-interactively 'jdb/slack-status (format text (format-time-string "%H:%M %Z"))))

  (defun jdb/slack-tea ()
    "Update Slack status to reflect the fact I am making a cup of tea."
    (interactive)
    (jdb/slack-status (format "started making tea at %s, back in five minutes" (format-time-string "%H:%M %Z")) ":tea:"))

  (defun jdb/slack-long-pomodoro ()
    "Update Slack status to reflect that I am on a long Pomodoro break."
    (interactive)
    (jdb/slack-status (format "started a long Pomodoro break at %s, back in fifteen minutes" (format-time-string "%H:%M %Z")) ":tomato:"))

  (defun jdb/slack-lunch ()
    "Update Slack status to reflect the fact I am having lunch."
    (interactive)
    (let ((today (string-to-number (format-time-string "%u"))))
      (jdb/slack-status (format "started lunch at %s, back in one hour" (format-time-string "%H:%M %Z"))
                        (if (>= today 5) ":beer:" ":shallow_pan_of_food:"))))

  (defun jdb/slack-long-lunch ()
    "Update Slack status to reflect the fact I am having a long lunch."
    (interactive)
    (let ((today (string-to-number (format-time-string "%u"))))
      (jdb/slack-status (format "started a long lunch at %s, back in two hours" (format-time-string "%H:%M %Z"))
                        (if (>= today 5) ":beer:" ":shallow_pan_of_food:"))))

  (defun jdb/slack-done ()
    "Update Slack status to reflect the fact I am no longer working."
    (interactive)
    (jdb/slack-status "not working" ":checkered_flag:"))

  (defun jdb/conjugate-verb (verb)
    "Conjugate VERB into present tense.  attend -> attending."
    (cond ((string-suffix-p "e" verb) (replace-regexp-in-string "e$" "ing" verb))
          (t (concat verb "ing"))))

  (defun jdb/org-slack-status ()
    "Update Slack status with the current org item.  EMOJI is the status emoji."
    (let* ((todo (replace-regexp-in-string org-link-regexp
                                           "\\2"
                                           (org-entry-get (point) "ITEM")))
           (words (split-string todo))
           (verb (car words))
           (conjugated (jdb/conjugate-verb verb))
           (text (string-join (cons conjugated (cdr words)) " ")))
      (funcall-interactively 'jdb/slack-status text)))
#+end_src

