.config/nixos/modules/emacs/config.html

<div id="outline-container-org46f2871" class="outline-4">
<h4 id="org46f2871"><span class="section-number-4">2.23.2.</span> Interact with Slack</h4>
<div class="outline-text-4" id="text-2-23-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">request</span>)
(<span style="color: #b6a0ff;">defvar</span> <span style="color: #00d3d0;">jdb/slack-api-url</span> <span style="color: #79a8ff;">"https://slack.com/api"</span>)
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-url-post</span> (endpoint data <span style="color: #6ae4b9;">&amp;optional</span> callback)
  <span style="color: #9ac8e0;">"Make a POST request to Slack.</span>
<span style="color: #9ac8e0;">ENDPOINT is a Slack RPC endpoint such as users.profile.set.</span>
<span style="color: #9ac8e0;">DATA is the request body.</span>
<span style="color: #9ac8e0;">CALLBACK is called on completion."</span>
  (request (format <span style="color: #79a8ff;">"%s/%s"</span> jdb/slack-api-url endpoint)
    <span style="color: #f78fe7;">:type</span> <span style="color: #79a8ff;">"POST"</span>
    <span style="color: #f78fe7;">:headers</span> `((<span style="color: #79a8ff;">"Content-Type"</span> . <span style="color: #79a8ff;">"application/json; charset=utf-8"</span>)
               (<span style="color: #79a8ff;">"Authorization"</span> . ,(concat <span style="color: #79a8ff;">"Bearer "</span> (auth-source-pass-get 'secret <span style="color: #79a8ff;">"grafana/raintank-corp.slack.com"</span>))))
    <span style="color: #f78fe7;">:data</span> data
    <span style="color: #f78fe7;">:parser</span> 'json-read
    <span style="color: #f78fe7;">:complete</span> (<span style="color: #b6a0ff;">or</span> callback (<span style="color: #b6a0ff;">cl-function</span>
                            (<span style="color: #b6a0ff;">lambda</span> (<span style="color: #6ae4b9;">&amp;key</span> response <span style="color: #6ae4b9;">&amp;allow-other-keys</span>)
                              (message <span style="color: #79a8ff;">"%s: %s"</span>
                                       (request-response-status-code response)
                                       (request-response-data response)))))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-standup</span> (text)
  <span style="color: #9ac8e0;">"Post a standup message TEXT to the standup channel."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sText: \n"</span>)
  (jdb/slack-url-post <span style="color: #79a8ff;">"chat.postMessage"</span>
                      (json-encode
                       `((channel . <span style="color: #79a8ff;">"C039JG5NDLP"</span>)
                         (text . ,text)))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-react</span> (channel timestamp name)
  <span style="color: #9ac8e0;">"React to the TIMESTAMP in CHANNEL with emoji identified by NAME."</span>
  (jdb/slack-url-post <span style="color: #79a8ff;">"react.add"</span>
                      (json-encode
                       `((channel . ,channel)
                         (timestamp . ,timestamp)
                         (name . ,name)))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-react-callback</span> (channel timestamp text)
  <span style="color: #9ac8e0;">"Return a `</span><span style="color: #00bcff;">cl-function</span><span style="color: #9ac8e0;">' that can be used as a request callback.</span>
<span style="color: #9ac8e0;">The callback reacts to the TIMESTAMP message in CHANNEL with the</span>
<span style="color: #9ac8e0;">alphabet emoji of the first character in TEXT."</span>
  (<span style="color: #b6a0ff;">lambda</span> (<span style="color: #6ae4b9;">&amp;key</span> response <span style="color: #6ae4b9;">&amp;allow-other-keys</span>)
    (<span style="color: #b6a0ff;">if</span> (&gt; (length text) 1)
        (funcall (jdb/slack-react-callback channel timestamp (substring text 1)) <span style="color: #f78fe7;">:response</span> response <span style="color: #f78fe7;">:other-keys</span>)
      (jdb/slack-react channel timestamp (string-to-char text)))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-post-with-react</span> (text channel <span style="color: #6ae4b9;">&amp;optional</span> message)
  <span style="color: #9ac8e0;">"Post TEXT to CHANNEL and react with TEXT alphabet emoji.</span>
<span style="color: #9ac8e0;">If MESSAGE is non-nil, post that instead of TEXT."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sText: \nsChannel: \n"</span>)
  (jdb/slack-url-post
   <span style="color: #79a8ff;">"chat.postMessage"</span>
   (json-encode
    `((channel . ,channel)
      (text . ,text)))
   (<span style="color: #b6a0ff;">cl-function</span> (<span style="color: #b6a0ff;">lambda</span> (<span style="color: #6ae4b9;">&amp;key</span> response <span style="color: #6ae4b9;">&amp;allow-other-keys</span>)
                  (<span style="color: #b6a0ff;">let</span> ((channel (alist-get 'channel (request-response-data response)))
                        (timestamp (alist-get 'ts (request-response-data response)))
                        (text (alist-get 'text (alist-get 'message (request-response-data response)))))
                    (funcall (jdb/slack-react-callback channel timestamp text) <span style="color: #f78fe7;">:response</span> response <span style="color: #f78fe7;">:other-keys</span>))))))

(<span style="color: #b6a0ff;">defvar</span> <span style="color: #00d3d0;">jdb/slack-status-last-emoji</span> nil <span style="color: #9ac8e0;">"Last emoji used in a Slack status API request."</span>)
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-status</span> (text <span style="color: #6ae4b9;">&amp;optional</span> emoji)
  <span style="color: #9ac8e0;">"Update Slack status.  TEXT is the status message.  EMOJI is the status emoji."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sText: \n"</span>)
  (<span style="color: #b6a0ff;">let</span> ((emoji (<span style="color: #b6a0ff;">or</span> emoji
                   (ivy-read <span style="color: #79a8ff;">"Emoji: "</span>
                             (<span style="color: #b6a0ff;">lambda</span> (<span style="color: #6ae4b9;">&amp;rest</span> _) jdb/slack-status--collection)
                             <span style="color: #f78fe7;">:action</span> (<span style="color: #b6a0ff;">lambda</span> (emoji) (<span style="color: #b6a0ff;">setq</span> jdb/slack-status-last-emoji emoji))
                             <span style="color: #f78fe7;">:caller</span> 'jdb/slack-status))))
    (jdb/slack-url-post
     <span style="color: #79a8ff;">"users.profile.set"</span>
     (json-encode
      `((<span style="color: #79a8ff;">"profile"</span> . ((<span style="color: #79a8ff;">"status_text"</span> . ,text) (<span style="color: #79a8ff;">"status_emoji"</span> . ,emoji)))))
     (<span style="color: #b6a0ff;">cl-function</span>
      (<span style="color: #b6a0ff;">lambda</span> (<span style="color: #6ae4b9;">&amp;key</span> response <span style="color: #6ae4b9;">&amp;allow-other-keys</span>)
        (<span style="color: #b6a0ff;">if</span> (<span style="color: #b6a0ff;">and</span>
             (equal (request-response-status-code response) 200)
             (equal (alist-get 'ok (request-response-data response)) <span style="color: #f78fe7;">:json-false</span>)
             jdb/slack-status-last-emoji)
            (customize-set-variable
             'jdb/slack-status--collection
             (add-to-list 'jdb/slack-status--collection jdb/slack-status-last-emoji))
          (customize-save-customized)))))
    (jdb/slack-url-post
     <span style="color: #79a8ff;">"users.setPresence"</span>
     (json-encode `((<span style="color: #79a8ff;">"presence"</span> . ,(<span style="color: #b6a0ff;">if</span> (string-empty-p text) <span style="color: #79a8ff;">"auto"</span> <span style="color: #79a8ff;">"away"</span>)))))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-clear</span> ()
  <span style="color: #9ac8e0;">"Clear Slack status."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (jdb/slack-status <span style="color: #79a8ff;">""</span> <span style="color: #79a8ff;">""</span>))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-status-with-time</span> (text)
  <span style="color: #9ac8e0;">"Update Slack status with TEXT formatted with the current time.</span>
<span style="color: #9ac8e0;">'</span><span style="color: #00bcff;">%s</span><span style="color: #9ac8e0;">' should be used for the text substition."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sText: \n"</span>)
  (funcall-interactively 'jdb/slack-status (format text (format-time-string <span style="color: #79a8ff;">"%H:%M %Z"</span>))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-tea</span> ()
  <span style="color: #9ac8e0;">"Update Slack status to reflect the fact I am making a cup of tea."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (jdb/slack-status (format <span style="color: #79a8ff;">"started making tea at %s, back in five minutes"</span> (format-time-string <span style="color: #79a8ff;">"%H:%M %Z"</span>)) <span style="color: #79a8ff;">":tea:"</span>))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-long-pomodoro</span> ()
  <span style="color: #9ac8e0;">"Update Slack status to reflect that I am on a long Pomodoro break."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (jdb/slack-status (format <span style="color: #79a8ff;">"started a long Pomodoro break at %s, back in fifteen minutes"</span> (format-time-string <span style="color: #79a8ff;">"%H:%M %Z"</span>)) <span style="color: #79a8ff;">":tomato:"</span>))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-lunch</span> ()
  <span style="color: #9ac8e0;">"Update Slack status to reflect the fact I am having lunch."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> ((today (string-to-number (format-time-string <span style="color: #79a8ff;">"%u"</span>))))
    (jdb/slack-status (format <span style="color: #79a8ff;">"started lunch at %s, back in one hour"</span> (format-time-string <span style="color: #79a8ff;">"%H:%M %Z"</span>))
                      (<span style="color: #b6a0ff;">if</span> (&gt;= today 5) <span style="color: #79a8ff;">":beer:"</span> <span style="color: #79a8ff;">":shallow_pan_of_food:"</span>))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-long-lunch</span> ()
  <span style="color: #9ac8e0;">"Update Slack status to reflect the fact I am having a long lunch."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> ((today (string-to-number (format-time-string <span style="color: #79a8ff;">"%u"</span>))))
    (jdb/slack-status (format <span style="color: #79a8ff;">"started a long lunch at %s, back in two hours"</span> (format-time-string <span style="color: #79a8ff;">"%H:%M %Z"</span>))
                      (<span style="color: #b6a0ff;">if</span> (&gt;= today 5) <span style="color: #79a8ff;">":beer:"</span> <span style="color: #79a8ff;">":shallow_pan_of_food:"</span>))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/slack-done</span> ()
  <span style="color: #9ac8e0;">"Update Slack status to reflect the fact I am no longer working."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (jdb/slack-status <span style="color: #79a8ff;">"not working"</span> <span style="color: #79a8ff;">":checkered_flag:"</span>))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/conjugate-verb</span> (verb)
  <span style="color: #9ac8e0;">"Conjugate VERB into present tense.  attend -&gt; attending."</span>
  (<span style="color: #b6a0ff;">cond</span> ((string-suffix-p <span style="color: #79a8ff;">"e"</span> verb) (replace-regexp-in-string <span style="color: #79a8ff;">"e$"</span> <span style="color: #79a8ff;">"ing"</span> verb))
        (t (concat verb <span style="color: #79a8ff;">"ing"</span>))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/org-slack-status</span> ()
  <span style="color: #9ac8e0;">"Update Slack status with the current org item.  EMOJI is the status emoji."</span>
  (<span style="color: #b6a0ff;">let*</span> ((todo (replace-regexp-in-string org-link-regexp
                                         <span style="color: #79a8ff;">"\\2"</span>
                                         (org-entry-get (point) <span style="color: #79a8ff;">"ITEM"</span>)))
         (words (split-string todo))
         (verb (car words))
         (conjugated (jdb/conjugate-verb verb))
         (text (string-join (cons conjugated (cdr words)) <span style="color: #79a8ff;">" "</span>)))
    (funcall-interactively 'jdb/slack-status text)))
</pre>
</div>
</div>
</div>
