.config/nixos/modules/emacs/config.org
*** Tests

#+begin_src emacs-lisp
  (ert-deftest jdb/org-standup--org-to-standup/should-include-urgency-if-present ()
    "If a TODO entry has an `urgent' tag, it should be included in the standup entry."
    (let ((org-entry "* TODO must do                                   :urgent:important:")
          (want "- TODO (EST ) 00:00 must do [UI]"))
      (with-temp-buffer
        (insert org-entry)
        (goto-char (point-min))
        (let ((got (jdb/org-standup--org-to-standup)))
          (print got)
          (should (equal got want))))))

  (ert-deftest jdb/org-standup--remaining-effort/returns-effort-if-no-logbook ()
    "Remaining effort is effort if there is no clocked time."
    (let ((entry "* TODO todo entry
     :PROPERTIES:
     :Effort:   1:00
     :END:
   "))
      (with-temp-buffer
        (insert entry)
        (goto-char (point-min))
        (should (equal (jdb/org-standup--remaining-effort) 60.0)))))
  (ert-deftest jdb/org-standup--remaining-effort/returns-effort-sub-clock-if-logbook ()
    "Remaining effort should be the defined effort minus any clocked time."
    (let ((entry "* PRGR todo entry
     :PROPERTIES:
     :Effort:   1:00
     :END:
     :LOGBOOK:
     CLOCK: [1970-01-01 Thu 00:00]--[1970-01-01 Thu 01:00] =>  1:00
     :END:
   "))
      (with-temp-buffer
        (insert entry)
        (goto-char (point-min))
        (should (equal (jdb/org-standup--remaining-effort) 0.0)))))
  (ert-deftest jdb/org-standup--remaining-effort/returns-zero-for-negative-remaining-effort ()
    "Negative effort remaining is not useful for discussing estimated times."
    (let ((entry "* PRGR todo entry
     :PROPERTIES:
     :Effort:   1:00
     :END:
     :LOGBOOK:
     CLOCK: [1970-01-01 Thu 01:00]--[1970-01-01 Thu 02:00] =>  1:00
     CLOCK: [1970-01-01 Thu 00:00]--[1970-01-01 Thu 01:00] =>  1:00
     :END:
     "))
      (with-temp-buffer
        (insert entry)
        (goto-char (point-min))
        (should (equal (jdb/org-standup--remaining-effort) 0.0)))))
  (ert-deftest jdb/org-standup--remaining-effort/handles-other-entries-in-buffer ()
    "The original implementation would subtract the clock sum of all entries in the buffer."
    (let ((entry "* PRGR todo entry
     :PROPERTIES:
     :Effort:   1:00
     :END:
   GR other todo entry
     :PROPERTIES:
     :Effort:   1:00
     :END:
     :LOGBOOK:
     CLOCK: [1970-01-01 Thu 01:00]--[1970-01-01 Thu 02:00] =>  1:00
     CLOCK: [1970-01-01 Thu 00:00]--[1970-01-01 Thu 01:00] =>  1:00
     :END:
     "))
      (with-temp-buffer
        (insert entry)
        (goto-char (point-min))
        (should (equal (jdb/org-standup--remaining-effort) 60.0)))))
#+end_src
*** Interact with Google Calendar

#+html: <aside>
#+begin_note
**NOTE:** This is not currently in use.
#+end_note
#+html: </aside>

#+begin_src emacs-lisp
  (use-package org-gcal
    :hook
    (org-gcal-after-update-entry-functions . my-org-gcal-set-effort)
    :config
    (setq org-gcal-recurring-events-mode 'nested)
    (setq org-gcal-remove-api-cancelled-events t)
    (setq org-gcal-client-id (auth-source-pass-get "client_id" "grafana/org-gcal"))
    (setq org-gcal-client-secret (auth-source-pass-get "client_secret" "grafana/org-gcal"))
    (setq org-gcal-file-alist '(("jack.baldry@grafana.com" .  "~/org/jack.baldry@grafana.com.org")))
    (defun my-org-gcal-set-effort (_calendar-id event _update-mode)
      "Set Effort property based on EVENT if not already set."
      (when-let* ((stime (plist-get (plist-get event :start)
                                    :dateTime))
                  (etime (plist-get (plist-get event :end)
                                    :dateTime))
                  (diff (float-time
                         (time-subtract (org-gcal--parse-calendar-time-string etime)
                                        (org-gcal--parse-calendar-time-string stime))))
                  (minutes (floor (/ diff 60))))
        (let ((effort (org-entry-get (point) org-effort-property)))
          (unless effort
            (message "need to set effort - minutes %S" minutes)
            (org-entry-put (point)
                           org-effort-property
                           (apply #'format "%d:%02d" (cl-floor minutes 60))))))))
#+end_src

