.config/nixos/modules/emacs/config.html

<div id="outline-container-org76e1852" class="outline-4">
<h4 id="org76e1852"><span class="section-number-4">2.23.3.</span> Tests</h4>
<div class="outline-text-4" id="text-2-23-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">ert-deftest</span> <span style="color: #feacd0;">jdb/org-standup--org-to-standup/should-include-urgency-if-present</span> ()
  <span style="color: #9ac8e0;">"If a TODO entry has an `</span><span style="color: #00bcff;">urgent</span><span style="color: #9ac8e0;">' tag, it should be included in the standup entry."</span>
  (<span style="color: #b6a0ff;">let</span> ((org-entry <span style="color: #79a8ff;">"* TODO must do                                   :urgent:important:"</span>)
        (want <span style="color: #79a8ff;">"- TODO (EST ) 00:00 must do [UI]"</span>))
    (<span style="color: #b6a0ff;">with-temp-buffer</span>
      (insert org-entry)
      (goto-char (point-min))
      (<span style="color: #b6a0ff;">let</span> ((got (jdb/org-standup--org-to-standup)))
        (print got)
        (<span style="color: #b6a0ff;">should</span> (equal got want))))))

(<span style="color: #b6a0ff;">ert-deftest</span> <span style="color: #feacd0;">jdb/org-standup--remaining-effort/returns-effort-if-no-logbook</span> ()
  <span style="color: #9ac8e0;">"Remaining effort is effort if there is no clocked time."</span>
  (<span style="color: #b6a0ff;">let</span> ((entry <span style="color: #79a8ff;">"* TODO todo entry</span>
<span style="color: #79a8ff;">   :PROPERTIES:</span>
<span style="color: #79a8ff;">   :Effort:   1:00</span>
<span style="color: #79a8ff;">   :END:</span>
<span style="color: #79a8ff;"> "</span>))
    (<span style="color: #b6a0ff;">with-temp-buffer</span>
      (insert entry)
      (goto-char (point-min))
      (<span style="color: #b6a0ff;">should</span> (equal (jdb/org-standup--remaining-effort) 60.0)))))
(<span style="color: #b6a0ff;">ert-deftest</span> <span style="color: #feacd0;">jdb/org-standup--remaining-effort/returns-effort-sub-clock-if-logbook</span> ()
  <span style="color: #9ac8e0;">"Remaining effort should be the defined effort minus any clocked time."</span>
  (<span style="color: #b6a0ff;">let</span> ((entry <span style="color: #79a8ff;">"* PRGR todo entry</span>
<span style="color: #79a8ff;">   :PROPERTIES:</span>
<span style="color: #79a8ff;">   :Effort:   1:00</span>
<span style="color: #79a8ff;">   :END:</span>
<span style="color: #79a8ff;">   :LOGBOOK:</span>
<span style="color: #79a8ff;">   CLOCK: [1970-01-01 Thu 00:00]--[1970-01-01 Thu 01:00] =&gt;  1:00</span>
<span style="color: #79a8ff;">   :END:</span>
<span style="color: #79a8ff;"> "</span>))
    (<span style="color: #b6a0ff;">with-temp-buffer</span>
      (insert entry)
      (goto-char (point-min))
      (<span style="color: #b6a0ff;">should</span> (equal (jdb/org-standup--remaining-effort) 0.0)))))
(<span style="color: #b6a0ff;">ert-deftest</span> <span style="color: #feacd0;">jdb/org-standup--remaining-effort/returns-zero-for-negative-remaining-effort</span> ()
  <span style="color: #9ac8e0;">"Negative effort remaining is not useful for discussing estimated times."</span>
  (<span style="color: #b6a0ff;">let</span> ((entry <span style="color: #79a8ff;">"* PRGR todo entry</span>
<span style="color: #79a8ff;">   :PROPERTIES:</span>
<span style="color: #79a8ff;">   :Effort:   1:00</span>
<span style="color: #79a8ff;">   :END:</span>
<span style="color: #79a8ff;">   :LOGBOOK:</span>
<span style="color: #79a8ff;">   CLOCK: [1970-01-01 Thu 01:00]--[1970-01-01 Thu 02:00] =&gt;  1:00</span>
<span style="color: #79a8ff;">   CLOCK: [1970-01-01 Thu 00:00]--[1970-01-01 Thu 01:00] =&gt;  1:00</span>
<span style="color: #79a8ff;">   :END:</span>
<span style="color: #79a8ff;">   "</span>))
    (<span style="color: #b6a0ff;">with-temp-buffer</span>
      (insert entry)
      (goto-char (point-min))
      (<span style="color: #b6a0ff;">should</span> (equal (jdb/org-standup--remaining-effort) 0.0)))))
(<span style="color: #b6a0ff;">ert-deftest</span> <span style="color: #feacd0;">jdb/org-standup--remaining-effort/handles-other-entries-in-buffer</span> ()
  <span style="color: #9ac8e0;">"The original implementation would subtract the clock sum of all entries in the buffer."</span>
  (<span style="color: #b6a0ff;">let</span> ((entry <span style="color: #79a8ff;">"* PRGR todo entry</span>
<span style="color: #79a8ff;">   :PROPERTIES:</span>
<span style="color: #79a8ff;">   :Effort:   1:00</span>
<span style="color: #79a8ff;">   :END:</span>
<span style="color: #79a8ff;"> GR other todo entry</span>
<span style="color: #79a8ff;">   :PROPERTIES:</span>
<span style="color: #79a8ff;">   :Effort:   1:00</span>
<span style="color: #79a8ff;">   :END:</span>
<span style="color: #79a8ff;">   :LOGBOOK:</span>
<span style="color: #79a8ff;">   CLOCK: [1970-01-01 Thu 01:00]--[1970-01-01 Thu 02:00] =&gt;  1:00</span>
<span style="color: #79a8ff;">   CLOCK: [1970-01-01 Thu 00:00]--[1970-01-01 Thu 01:00] =&gt;  1:00</span>
<span style="color: #79a8ff;">   :END:</span>
<span style="color: #79a8ff;">   "</span>))
    (<span style="color: #b6a0ff;">with-temp-buffer</span>
      (insert entry)
      (goto-char (point-min))
      (<span style="color: #b6a0ff;">should</span> (equal (jdb/org-standup--remaining-effort) 60.0)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org92a76f6" class="outline-4">
<h4 id="org92a76f6"><span class="section-number-4">2.23.4.</span> Interact with Google Calendar</h4>
<div class="outline-text-4" id="text-2-23-4">
<aside>
<div class="note" id="org5bff7ae">
<p>
<b><b>NOTE:</b></b> This is not currently in use.
</p>

</div>
</aside>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">org-gcal</span>
<span style="color: #f78fe7;">:hook</span>
(org-gcal-after-update-entry-functions . my-org-gcal-set-effort)
<span style="color: #f78fe7;">:config</span>
(<span style="color: #b6a0ff;">setq</span> org-gcal-recurring-events-mode 'nested)
(<span style="color: #b6a0ff;">setq</span> org-gcal-remove-api-cancelled-events t)
(<span style="color: #b6a0ff;">setq</span> org-gcal-client-id (auth-source-pass-get <span style="color: #79a8ff;">"client_id"</span> <span style="color: #79a8ff;">"grafana/org-gcal"</span>))
(<span style="color: #b6a0ff;">setq</span> org-gcal-client-secret (auth-source-pass-get <span style="color: #79a8ff;">"client_secret"</span> <span style="color: #79a8ff;">"grafana/org-gcal"</span>))
(<span style="color: #b6a0ff;">setq</span> org-gcal-file-alist '((<span style="color: #79a8ff;">"jack.baldry@grafana.com"</span> .  <span style="color: #79a8ff;">"~/org/jack.baldry@grafana.com.org"</span>)))
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">my-org-gcal-set-effort</span> (_calendar-id event _update-mode)
  <span style="color: #9ac8e0;">"Set Effort property based on EVENT if not already set."</span>
  (<span style="color: #b6a0ff;">when-let*</span> ((stime (plist-get (plist-get event <span style="color: #f78fe7;">:start</span>)
                                <span style="color: #f78fe7;">:dateTime</span>))
              (etime (plist-get (plist-get event <span style="color: #f78fe7;">:end</span>)
                                <span style="color: #f78fe7;">:dateTime</span>))
              (diff (float-time
                     (time-subtract (org-gcal--parse-calendar-time-string etime)
                                    (org-gcal--parse-calendar-time-string stime))))
              (minutes (floor (/ diff 60))))
    (<span style="color: #b6a0ff;">let</span> ((effort (org-entry-get (point) org-effort-property)))
      (<span style="color: #b6a0ff;">unless</span> effort
        (message <span style="color: #79a8ff;">"need to set effort - minutes %S"</span> minutes)
        (org-entry-put (point)
                       org-effort-property
                       (apply #'format <span style="color: #79a8ff;">"%d:%02d"</span> (cl-floor minutes 60))))))))
</pre>
</div>
</div>
</div>
</div>
