.config/nixos/modules/emacs/config.org
** Use Projectile for working with multiple code projects

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el :results output silent
  (use-package projectile
    :after transient
    :config
    (setq projectile-switch-project-action #'(lambda() (magit-status (projectile-acquire-root))))
    (setq projectile-completion-system 'ivy)

    (defun jdb/projectile-project-buffers ()
      (projectile-project-buffers (projectile-acquire-root)))

    (defun projectile-help ()
      (interactive)
      ;; From: https://stackoverflow.com/questions/3480173/show-keys-in-emacs-keymap-value
      (with-output-to-temp-buffer "*keymap: projectile-command-map*"
        (princ "projectile-command-map\n\n")
        (princ (substitute-command-keys "\\{projectile-command-map}"))))

    (transient-define-prefix projectile-search-transient ()
      "Transient for searching a projectile project"
      ["Search with?"
       ("r" "Ripgrep" projectile-ripgrep)])

    (transient-define-prefix projectile-transient ()
      "Transient for projectile-mode-map"
      ["Projectile actions"
       ("c" "Compile" projectile-compile-project)
       ("e" "Exit" projectile-kill-buffers)
       ("f" "Find" projectile-find-file)
       ("p" "Switch project" projectile-switch-project)
       ("q" "Switch open project" projectile-switch-open-project)
       ("r" "Replace" projectile-replace)
       ("s" "Search" projectile-search-transient)
       ("S" "Save" projectile-save-project-buffers)
       ("x" "Shell" projectile-run-shell)
       ("?" "Help" projectile-help)])
    :bind
    ((:map projectile-mode-map ("C-c p" . projectile-transient)))
    :init
    (projectile-mode))
#+end_src

** HTML

Functions for fetching and manipulating HTML.

#+html: <aside>
#+begin_note
**NOTE:** Requires curl and kooky tools.
#+end_note
#+html: </aside>

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package dom)

  (defun jdb/tag-for-url (url tag)
    "Fetch the HTML TAG for a URL.
  TODO: strip off #edit from at least GDocs URLs as it breaks the request."
    (interactive "sURL: \nSTag: \n")
    (let ((buffer (generate-new-buffer "title-for-url-as-kill")))
      (with-temp-file "/tmp/gdoc"
        (let ((effective-url
               (shell-command-to-string (format "curl -A 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.36' -Lsb <(kooky -d %s -o /dev/stdout %s) -w %%{url_effective} -o /dev/null %s"  (url-host (url-generic-parse-url url)) url url))))
          (shell-command (format "curl -Lb <(kooky -d %s -o /dev/stdout) %s" (url-host (url-generic-parse-url effective-url)) effective-url) (current-buffer))
          (dom-text (dom-by-tag (libxml-parse-html-region (point-min) (point-max)) tag))))))

  (defun jdb/title-for-url-as-kill (url)
    "Fetch the HTML title for a URL."
    (interactive "sURL: \n")
    (kill-new (jdb/tag-for-url url 'title)))

  (defun jdb/title-for-url-as-kill-md (url)
    "Fetch the HTML title for a URL."
    (interactive "sURL: \n")
    (kill-new (format "[%s](%s)" (jdb/tag-for-url url 'title) url)))

  (defun jdb/h1-for-url-as-kill (url)
    "Fetch the first HTML H1 for a URL."
    (interactive "sURL: \n")
    (kill-new (jdb/tag-for-url url 'h1)))

  (defun jdb/h1-for-url-as-kill-md (url)
    "Fetch the HTML h1 for a URL."
    (interactive "sURL: \n")
    (kill-new (format "[%s](%s)" (jdb/tag-for-url url 'h1) url)))
#+end_src

** Edit browser text fields within Emacs

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package atomic-chrome
    :ensure t
    :commands atomic-chrome-start-server
    :config
    (setq atomic-chrome-extension-type-list '(ghost-text))
    (atomic-chrome-start-server))
#+end_src

** Passwords

*** Start Pinentry service to have gpg commands interact with Emacs

#+html: <aside>
#+begin_note
**NOTE:** Requires ~allow-emacs-pinentry~ and/or ~allow-loopback-pinentry~ in ~/.gnupg/gpg-agent.conf
#+end_note
#+html: </aside>

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package pinentry
    :ensure t
    :init
    (setq epg-pinentry-mode 'loopback)
    (pinentry-start))
#+end_src

*** Configure the Unix password manager pass as an auth source

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package pass
    :after pinentry
    :ensure t
    :init
    (auth-source-pass-enable)
    :config
    (setq auth-sources '("~/.authinfo" password-store)))
#+end_src

