.config/nixos/modules/emacs/config.html

<div id="outline-container-org80a2ff7" class="outline-3">
<h3 id="org80a2ff7"><span class="section-number-3">2.24.</span> Use Projectile for working with multiple code projects</h3>
<div class="outline-text-3" id="text-2-24">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">projectile</span>
  <span style="color: #f78fe7;">:after</span> transient
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> projectile-switch-project-action #'(<span style="color: #b6a0ff;">lambda</span>() (magit-status (projectile-acquire-root))))
  (<span style="color: #b6a0ff;">setq</span> projectile-completion-system 'ivy)

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/projectile-project-buffers</span> ()
    (projectile-project-buffers (projectile-acquire-root)))

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">projectile-help</span> ()
    (<span style="color: #b6a0ff;">interactive</span>)
    <span style="color: #989898;">;; </span><span style="color: #989898;">From: https://stackoverflow.com/questions/3480173/show-keys-in-emacs-keymap-value</span>
    (<span style="color: #b6a0ff;">with-output-to-temp-buffer</span> <span style="color: #79a8ff;">"*keymap: projectile-command-map*"</span>
      (princ <span style="color: #79a8ff;">"projectile-command-map\n\n"</span>)
      (princ (substitute-command-keys <span style="color: #79a8ff;">"\\{</span><span style="color: #00d3d0;">projectile-command-map</span><span style="color: #79a8ff;">}"</span>))))
  (<span style="color: #b6a0ff;">transient-define-prefix</span> <span style="color: #feacd0;">projectile-search-transient</span> ()
    <span style="color: #9ac8e0;">"Transient for searching a projectile project"</span>
    [<span style="color: #79a8ff;">"Search with?"</span>
     (<span style="color: #79a8ff;">"r"</span> <span style="color: #79a8ff;">"Ripgrep"</span> projectile-ripgrep)])

  (<span style="color: #b6a0ff;">transient-define-prefix</span> <span style="color: #feacd0;">projectile-transient</span> ()
    <span style="color: #9ac8e0;">"Transient for projectile-mode-map"</span>
    [<span style="color: #79a8ff;">"Projectile actions"</span>
     (<span style="color: #79a8ff;">"c"</span> <span style="color: #79a8ff;">"Compile"</span> projectile-compile-project)
     (<span style="color: #79a8ff;">"e"</span> <span style="color: #79a8ff;">"Exit"</span> projectile-kill-buffers)
     (<span style="color: #79a8ff;">"f"</span> <span style="color: #79a8ff;">"Find"</span> projectile-find-file)
     (<span style="color: #79a8ff;">"p"</span> <span style="color: #79a8ff;">"Switch project"</span> projectile-switch-project)
     (<span style="color: #79a8ff;">"q"</span> <span style="color: #79a8ff;">"Switch open project"</span> projectile-switch-open-project)
     (<span style="color: #79a8ff;">"r"</span> <span style="color: #79a8ff;">"Replace"</span> projectile-replace)
     (<span style="color: #79a8ff;">"s"</span> <span style="color: #79a8ff;">"Search"</span> projectile-search-transient)
     (<span style="color: #79a8ff;">"S"</span> <span style="color: #79a8ff;">"Save"</span> projectile-save-project-buffers)
     (<span style="color: #79a8ff;">"x"</span> <span style="color: #79a8ff;">"Shell"</span> projectile-run-shell)
     (<span style="color: #79a8ff;">"?"</span> <span style="color: #79a8ff;">"Help"</span> projectile-help)])
  <span style="color: #f78fe7;">:bind</span>
  ((<span style="color: #f78fe7;">:map</span> projectile-mode-map (<span style="color: #79a8ff;">"C-c p"</span> . projectile-transient)))
  <span style="color: #f78fe7;">:init</span>
  (projectile-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org000cb43" class="outline-3">
<h3 id="org000cb43"><span class="section-number-3">2.25.</span> HTML</h3>
<div class="outline-text-3" id="text-2-25">
<p>
Functions for fetching and manipulating HTML.
</p>

<aside>
<div class="note" id="orgadfc405">
<p>
<b><b>NOTE:</b></b> Requires curl and kooky tools.
</p>

</div>
</aside>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">dom</span>)

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/tag-for-url</span> (url tag)
  <span style="color: #9ac8e0;">"Fetch the HTML TAG for a URL.</span>
<span style="color: #9ac8e0;">TODO: strip off #edit from at least GDocs URLs as it breaks the request."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sURL: \nSTag: \n"</span>)
  (<span style="color: #b6a0ff;">let</span> ((buffer (generate-new-buffer <span style="color: #79a8ff;">"title-for-url-as-kill"</span>)))
    (<span style="color: #b6a0ff;">with-temp-file</span> <span style="color: #79a8ff;">"/tmp/gdoc"</span>
      (<span style="color: #b6a0ff;">let</span> ((effective-url
             (shell-command-to-string (format <span style="color: #79a8ff;">"curl -A 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.36' -Lsb &lt;(kooky -d %s -o /dev/stdout %s) -w %%{url_effective} -o /dev/null %s"</span>  (url-host (url-generic-parse-url url)) url url))))
        (shell-command (format <span style="color: #79a8ff;">"curl -Lb &lt;(kooky -d %s -o /dev/stdout) %s"</span> (url-host (url-generic-parse-url effective-url)) effective-url) (current-buffer))
        (dom-text (dom-by-tag (libxml-parse-html-region (point-min) (point-max)) tag))))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/title-for-url-as-kill</span> (url)
  <span style="color: #9ac8e0;">"Fetch the HTML title for a URL."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sURL: \n"</span>)
  (kill-new (jdb/tag-for-url url 'title)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/title-for-url-as-kill-md</span> (url)
  <span style="color: #9ac8e0;">"Fetch the HTML title for a URL."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sURL: \n"</span>)
  (kill-new (format <span style="color: #79a8ff;">"[%s](%s)"</span> (jdb/tag-for-url url 'title) url)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/h1-for-url-as-kill</span> (url)
  <span style="color: #9ac8e0;">"Fetch the first HTML H1 for a URL."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sURL: \n"</span>)
  (kill-new (jdb/tag-for-url url 'h1)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/h1-for-url-as-kill-md</span> (url)
  <span style="color: #9ac8e0;">"Fetch the HTML h1 for a URL."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sURL: \n"</span>)
  (kill-new (format <span style="color: #79a8ff;">"[%s](%s)"</span> (jdb/tag-for-url url 'h1) url)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ec434b" class="outline-3">
<h3 id="org2ec434b"><span class="section-number-3">2.26.</span> Edit browser text fields within Emacs</h3>
<div class="outline-text-3" id="text-2-26">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">atomic-chrome</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:commands</span> atomic-chrome-start-server
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> atomic-chrome-extension-type-list '(ghost-text))
  (atomic-chrome-start-server))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4b8da1" class="outline-3">
<h3 id="orga4b8da1"><span class="section-number-3">2.27.</span> Passwords</h3>
<div class="outline-text-3" id="text-2-27">
</div>
<div id="outline-container-org864c914" class="outline-4">
<h4 id="org864c914"><span class="section-number-4">2.27.1.</span> Start Pinentry service to have gpg commands interact with Emacs</h4>
<div class="outline-text-4" id="text-2-27-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">pinentry</span>
  <span style="color: #f78fe7;">:init</span>
  (setenv <span style="color: #79a8ff;">"INSIDE_EMACS"</span> (format <span style="color: #79a8ff;">"%s,comint"</span> emacs-version))
  (pinentry-start))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f2e9dd" class="outline-4">
<h4 id="org8f2e9dd"><span class="section-number-4">2.27.2.</span> Configure the Unix password manager pass as an auth source</h4>
<div class="outline-text-4" id="text-2-27-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">pass</span>
  <span style="color: #f78fe7;">:after</span> pinentry
  <span style="color: #f78fe7;">:init</span>
  (auth-source-pass-enable)
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> auth-sources '(<span style="color: #79a8ff;">"~/.authinfo"</span> password-store)))
</pre>
</div>
</div>
</div>
</div>
