.config/nixos/modules/emacs/config.html

<div id="outline-container-orgec0e1eb" class="outline-3">
<h3 id="orgec0e1eb"><span class="section-number-3">2.28.</span> Email</h3>
<div class="outline-text-3" id="text-2-28">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #989898;">;;; </span><span style="color: #989898;">mue4e</span>
(<span style="color: #b6a0ff;">with-eval-after-load</span> 'f
  (<span style="color: #b6a0ff;">let</span> ((mu4epath
         (concat
          (f-dirname
           (file-truename
            (executable-find <span style="color: #79a8ff;">"mu"</span>)))
          <span style="color: #79a8ff;">"/../share/emacs/site-lisp/mu4e"</span>)))
    (<span style="color: #b6a0ff;">when</span> (<span style="color: #b6a0ff;">and</span>
           (string-prefix-p <span style="color: #79a8ff;">"/nix/store/"</span> mu4epath)
           (file-directory-p mu4epath))
      (add-to-list 'load-path mu4epath))))
(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">mu4e</span>
  <span style="color: #f78fe7;">:defer</span> t
  <span style="color: #f78fe7;">:commands</span> (mu4e mu4e-message mu4e-message-contact-field-matches)
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> mu4e-change-filenames-when-moving t)
  (<span style="color: #b6a0ff;">setq</span> mu4e-contexts
        `(,(make-mu4e-context
            <span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Grafana"</span>
            <span style="color: #f78fe7;">:enter-func</span> (<span style="color: #b6a0ff;">lambda</span> ()
                          (mu4e-message <span style="color: #79a8ff;">"Entering Grafana context"</span>)
                          (<span style="color: #b6a0ff;">when</span> (string-match-p (buffer-name (current-buffer)) <span style="color: #79a8ff;">"mu4e-main"</span>)
                            (revert-buffer)))
            <span style="color: #f78fe7;">:leave-func</span> (<span style="color: #b6a0ff;">lambda</span> ()
                          (mu4e-message <span style="color: #79a8ff;">"Leaving Grafana context"</span>)
                          (<span style="color: #b6a0ff;">when</span> (string-match-p (buffer-name (current-buffer)) <span style="color: #79a8ff;">"mu4e-main"</span>)
                            (revert-buffer)))
            <span style="color: #f78fe7;">:match-func</span> (<span style="color: #b6a0ff;">lambda</span> (msg)
                          (<span style="color: #b6a0ff;">when</span> msg
                            (<span style="color: #b6a0ff;">or</span> (mu4e-message-contact-field-matches msg <span style="color: #f78fe7;">:to</span> <span style="color: #79a8ff;">"jack.baldry@grafana.com"</span>)
                                (mu4e-message-contact-field-matches msg <span style="color: #f78fe7;">:from</span> <span style="color: #79a8ff;">"jack.baldry@grafana.com"</span>)
                                (mu4e-message-contact-field-matches msg <span style="color: #f78fe7;">:cc</span> <span style="color: #79a8ff;">"jack.baldry@grafana.com"</span>)
                                (mu4e-message-contact-field-matches msg <span style="color: #f78fe7;">:bcc</span> <span style="color: #79a8ff;">"jack.baldry@grafana.com"</span>))))
            <span style="color: #f78fe7;">:vars</span> '((user-full-name . <span style="color: #79a8ff;">"Jack Baldry"</span>)
                    (user-mail-address . <span style="color: #79a8ff;">"jack.baldry@grafana.com"</span>)
                    (mu4e-compose-signature . (format <span style="color: #79a8ff;">"Cheers,\n\njdb"</span>))
                    (mu4e-get-mail-command . <span style="color: #79a8ff;">"mbsync grafana"</span>)
                    (mu4e-maildir-shortcuts . ((<span style="color: #f78fe7;">:maildir</span> <span style="color: #79a8ff;">"/grafana/Archive"</span> <span style="color: #f78fe7;">:key</span> ?a)))
                    (mu4e-bookmarks .
                                    ((<span style="color: #f78fe7;">:name</span>  <span style="color: #79a8ff;">"Unread messages"</span>
                                             <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/grafana/Inbox AND flag:unread AND NOT flag:trashed"</span>
                                             <span style="color: #f78fe7;">:key</span> ?u)
                                     (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Archive"</span>
                                            <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/grafana/Archive"</span>
                                            <span style="color: #f78fe7;">:key</span> ?a)
                                     (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Last 2 days"</span>
                                            <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/grafana/Inbox AND date:2d..now AND NOT flag:trashed"</span>
                                            <span style="color: #f78fe7;">:key</span> ?t)
                                     (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Last 7 days"</span>
                                            <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/grafana/Inbox AND date:7d..now AND NOT flag:trashed"</span>
                                            <span style="color: #f78fe7;">:key</span> ?w)
                                     (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"This year"</span>
                                            <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/grafana/Inbox AND date:20220101..now AND NOT flag:trashed"</span>
                                            <span style="color: #f78fe7;">:key</span> ?y)
                                     (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Deleted"</span>
                                            <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"flag:trashed"</span>
                                            <span style="color: #f78fe7;">:key</span> ?d)))))
          ,(make-mu4e-context
            <span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"gmail"</span>
            <span style="color: #f78fe7;">:enter-func</span> (<span style="color: #b6a0ff;">lambda</span> ()
                          (mu4e-message <span style="color: #79a8ff;">"Entering gmail context"</span>)
                          (<span style="color: #b6a0ff;">when</span> (string-match-p (buffer-name (current-buffer)) <span style="color: #79a8ff;">"mu4e-main"</span>)
                            (revert-buffer)))
            <span style="color: #f78fe7;">:leave-func</span> (<span style="color: #b6a0ff;">lambda</span> ()
                          (mu4e-message <span style="color: #79a8ff;">"Leaving gmail context"</span>)
                          (<span style="color: #b6a0ff;">when</span> (string-match-p (buffer-name (current-buffer)) <span style="color: #79a8ff;">"mu4e-main"</span>)
                            (revert-buffer)))
            <span style="color: #f78fe7;">:match-func</span> (<span style="color: #b6a0ff;">lambda</span> (msg)
                          (<span style="color: #b6a0ff;">when</span> msg
                            (<span style="color: #b6a0ff;">or</span> (mu4e-message-contact-field-matches msg <span style="color: #f78fe7;">:to</span> <span style="color: #79a8ff;">"jdbaldry@gmail.com"</span>)
                                (mu4e-message-contact-field-matches msg <span style="color: #f78fe7;">:from</span> <span style="color: #79a8ff;">"jdbaldry@gmail.com"</span>)
                                (mu4e-message-contact-field-matches msg <span style="color: #f78fe7;">:cc</span> <span style="color: #79a8ff;">"jdbaldry@gmail.com"</span>)
                                (mu4e-message-contact-field-matches msg <span style="color: #f78fe7;">:bcc</span> <span style="color: #79a8ff;">"jdbaldry@gmail.com"</span>))))
            <span style="color: #f78fe7;">:vars</span> '((user-full-name . <span style="color: #79a8ff;">"Jack Baldry"</span>)
                    (user-mail-address . <span style="color: #79a8ff;">"jdbaldry@gmail.com"</span>)
                    (mu4e-compose-signature . (format <span style="color: #79a8ff;">"Cheers,\n\njdb"</span>))
                    (mu4e-get-mail-command . <span style="color: #79a8ff;">"mbsync gmail"</span>)
                    (mu4e-maildir-shortcuts . ((<span style="color: #f78fe7;">:maildir</span> <span style="color: #79a8ff;">"/gmail/Archive"</span> <span style="color: #f78fe7;">:key</span> ?a)))
                    (mu4e-bookmarks .
                                    ((<span style="color: #f78fe7;">:name</span>  <span style="color: #79a8ff;">"Unread messages"</span>
                                             <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/gmail/Inbox AND flag:unread AND NOT flag:trashed"</span>
                                             <span style="color: #f78fe7;">:key</span> ?u)
                                     (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Archive"</span>
                                            <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/gmail/Archive"</span>
                                            <span style="color: #f78fe7;">:key</span> ?a)
                                     (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Last 2 days"</span>
                                            <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/gmail/Inbox AND date:2d..now AND NOT flag:trashed"</span>
                                            <span style="color: #f78fe7;">:key</span> ?t)
                                     (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Last 7 days"</span>
                                            <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/gmail/Inbox AND date:7d..now AND NOT flag:trashed"</span>
                                            <span style="color: #f78fe7;">:key</span> ?w)
                                     (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Deleted"</span>
                                            <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"flag:trashed"</span>
                                            <span style="color: #f78fe7;">:key</span> ?d)))))
          ,(make-mu4e-context
            <span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"fastmail"</span>
            <span style="color: #f78fe7;">:enter-func</span> (<span style="color: #b6a0ff;">lambda</span> ()
                          (mu4e-message <span style="color: #79a8ff;">"Entering fastmail context"</span>)
                          (<span style="color: #b6a0ff;">when</span> (string-match-p (buffer-name (current-buffer)) <span style="color: #79a8ff;">"mu4e-main"</span>)
                            (revert-buffer)))
            <span style="color: #f78fe7;">:leave-func</span> (<span style="color: #b6a0ff;">lambda</span> ()
                          (mu4e-message <span style="color: #79a8ff;">"Leaving fastmail context"</span>)
                          (<span style="color: #b6a0ff;">when</span> (string-match-p (buffer-name (current-buffer)) <span style="color: #79a8ff;">"mu4e-main"</span>)
                            (revert-buffer)))
            <span style="color: #f78fe7;">:match-func</span> (<span style="color: #b6a0ff;">lambda</span> (msg)
                          (<span style="color: #b6a0ff;">when</span> msg
                            (<span style="color: #b6a0ff;">or</span> (mu4e-message-contact-field-matches msg <span style="color: #f78fe7;">:to</span> <span style="color: #79a8ff;">"jdbaldry@fastmail.com"</span>)
                                (mu4e-message-contact-field-matches msg <span style="color: #f78fe7;">:from</span> <span style="color: #79a8ff;">"jdbaldry@fastmail.com"</span>)
                                (mu4e-message-contact-field-matches msg <span style="color: #f78fe7;">:cc</span> <span style="color: #79a8ff;">"jdbaldry@fastmail.com"</span>)
                                (mu4e-message-contact-field-matches msg <span style="color: #f78fe7;">:bcc</span> <span style="color: #79a8ff;">"jdbaldry@fastmail.com"</span>))))
            <span style="color: #f78fe7;">:vars</span> '((user-full-name . <span style="color: #79a8ff;">"Jack Baldry"</span>)
                    (user-mail-address . <span style="color: #79a8ff;">"jdbaldry@fastmail.com"</span>)
                    (mu4e-compose-signature . (format <span style="color: #79a8ff;">"Cheers,\n\njdb"</span>))
                    (mu4e-get-mail-command . <span style="color: #79a8ff;">"mbsync fastmail"</span>)
                    (mu4e-maildir-shortcuts . ((<span style="color: #f78fe7;">:maildir</span> <span style="color: #79a8ff;">"/fastmail/Archive"</span> <span style="color: #f78fe7;">:key</span> ?a)))
                    (mu4e-bookmarks . ((<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Unread messages"</span>
                                              <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/fastmail/Inbox AND flag:unread AND NOT flag:trashed"</span>
                                              <span style="color: #f78fe7;">:key</span> ?u)
                                       (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Archive"</span>
                                              <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/fastmail/Archive"</span>
                                              <span style="color: #f78fe7;">:key</span> ?a)
                                       (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Last 2 days"</span>
                                              <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/fastmail/Inbox AND date:2d..now AND NOT flag:trashed"</span>
                                              <span style="color: #f78fe7;">:key</span> ?t)
                                       (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Last 7 days"</span>
                                              <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"maildir:/fastmail/Inbox AND date:7d..now AND NOT flag:trashed"</span>
                                              <span style="color: #f78fe7;">:key</span> ?w)
                                       (<span style="color: #f78fe7;">:name</span> <span style="color: #79a8ff;">"Deleted"</span>
                                              <span style="color: #f78fe7;">:query</span> <span style="color: #79a8ff;">"flag:trashed"</span>
                                              <span style="color: #f78fe7;">:key</span> ?d)))))))
  (<span style="color: #b6a0ff;">setq</span> send-mail-function 'sendmail-send-it)
  (<span style="color: #b6a0ff;">setq</span> sendmail-program (executable-find <span style="color: #79a8ff;">"msmtp"</span>))
  (<span style="color: #b6a0ff;">setq</span> mu4e-attachment-dir <span style="color: #79a8ff;">"~/Downloads"</span>)
  (<span style="color: #b6a0ff;">setq</span> mu4e-get-mail-command <span style="color: #79a8ff;">"mbsync -a"</span>)
  (<span style="color: #b6a0ff;">setq</span> mu4e-headers-date-format <span style="color: #79a8ff;">"%F"</span>)
  (<span style="color: #b6a0ff;">setq</span> mu4e-headers-time-format <span style="color: #79a8ff;">"%H:%M:%S"</span>)
  (<span style="color: #b6a0ff;">setq</span> mu4e-headers-include-related nil)
  (<span style="color: #b6a0ff;">setq</span> mu4e-html2text-command <span style="color: #79a8ff;">"iconv -c -t utf-8 | pandoc -f html -t plain"</span>)
  (add-to-list 'mu4e-view-actions '(<span style="color: #79a8ff;">"View in browser"</span> . mu4e-action-view-in-browser) t)
  (<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">ace-link</span>
    <span style="color: #f78fe7;">:defer</span> t
    <span style="color: #f78fe7;">:config</span>
    (add-to-list 'mu4e-view-actions `(<span style="color: #79a8ff;">"Open link"</span> . ,(<span style="color: #b6a0ff;">lambda</span> (_) (ace-link-mu4e))) t)))
</pre>
</div>
</div>
</div>
