.config/nixos/modules/emacs/config.org
** Jump to a word

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package avy
    :ensure t
    :bind (("M-s" . avy-goto-word-1)))
#+end_src

** Capture a screenshot

#+html: <aside>
#+begin_note
**NOTE:** Requires `grimshot` tool.
#+end_note
#+html: </aside>

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defun jdb/scrot ()
    "Capture a screenshot and store it in the ~/screenshots/ directory."
    (interactive)
    (start-process-shell-command "grimshot" nil "grimshot save window ${HOME}/screenshots/$(date '+%Y-%m-%dT%H:%M:%S').png"))
#+end_src

** Regular expressions for URLs

Regular expressions for HTTP URLs constructed to be match all the nonterminals defined in the BNF in [[https://datatracker.ietf.org/doc/html/rfc1738#section-5][RFC1738]].

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (rx-define alphadigit alphanumeric)
  (rx-define digits (+ digit))
  (rx-define domainlabel (| alphadigit (* alphadigit (? (| alphadigit "-")) alphadigit)))
  (rx-define toplabel (| alpha (* alpha (? (| alphadigit "-")) alphadigit)))
  (rx-define hostname (seq (* domainlabel ".") toplabel))
  (rx-define hostnumber (seq digits "." digits "." digits "." digits))
  (rx-define host (| hostname hostnumber))
  (rx-define port digits)
  (rx-define hostport (seq host (? ":" port)))
  (rx-define safe (any "$-_.+"))
  (rx-define extra (any "!*',()"))
  (rx-define unreserved (| alpha digit safe extra))
  (rx-define escape (seq "%" hex hex))
  (rx-define uchar (| unreserved escape))
  (rx-define hsegment (* (| uchar (any ";:@&="))))
  (rx-define hpath (seq hsegment (* "/" hsegment)))
  (rx-define search (* (| uchar (any ";:@&="))))
  (rx-define httpurl (seq "http://" hostport (? "/" hpath (? "?" search))))
  (rx-define httpsurl (seq "https://" hostport (? "/" hpath (? "?" search))))
  ;; urlish matches HTTPS or HTTP URLs that are just missing a scheme.
  (rx-define urlish (seq (? (seq "http" (? "s") "://")) hostport (? "/" hpath (? "?" search))))
#+end_src

