.config/nixos/modules/emacs/config.html

<div id="outline-container-orgb76d29e" class="outline-3">
<h3 id="orgb76d29e"><span class="section-number-3">2.29.</span> Jump to a word</h3>
<div class="outline-text-3" id="text-2-29">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">avy</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:bind</span> ((<span style="color: #79a8ff;">"M-s"</span> . avy-goto-word-1)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org752d36d" class="outline-3">
<h3 id="org752d36d"><span class="section-number-3">2.30.</span> Capture a screenshot</h3>
<div class="outline-text-3" id="text-2-30">
<aside>
<div class="note" id="org12f6f16">
<p>
<b><b>NOTE:</b></b> Requires `grimshot` tool.
</p>

</div>
</aside>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/scrot</span> ()
  <span style="color: #9ac8e0;">"Capture a screenshot and store it in the ~/screenshots/ directory."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (start-process-shell-command <span style="color: #79a8ff;">"grimshot"</span> nil <span style="color: #79a8ff;">"grimshot save window ${HOME}/screenshots/$(date '</span><span style="color: #00bcff;">+%Y-%m-%dT%H:%M:%S</span><span style="color: #79a8ff;">').png"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d75893" class="outline-3">
<h3 id="org1d75893"><span class="section-number-3">2.31.</span> Regular expressions for URLs</h3>
<div class="outline-text-3" id="text-2-31">
<p>
Regular expressions for HTTP URLs constructed to be match all the nonterminals defined in the BNF in <a href="https://datatracker.ietf.org/doc/html/rfc1738#section-5">RFC1738</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">rx-define</span> alphadigit alphanumeric)
(<span style="color: #b6a0ff;">rx-define</span> digits (+ digit))
(<span style="color: #b6a0ff;">rx-define</span> domainlabel (| alphadigit (* alphadigit (? (| alphadigit <span style="color: #79a8ff;">"-"</span>)) alphadigit)))
(<span style="color: #b6a0ff;">rx-define</span> toplabel (| alpha (* alpha (? (| alphadigit <span style="color: #79a8ff;">"-"</span>)) alphadigit)))
(<span style="color: #b6a0ff;">rx-define</span> hostname (seq (* domainlabel <span style="color: #79a8ff;">"."</span>) toplabel))
(<span style="color: #b6a0ff;">rx-define</span> hostnumber (seq digits <span style="color: #79a8ff;">"."</span> digits <span style="color: #79a8ff;">"."</span> digits <span style="color: #79a8ff;">"."</span> digits))
(<span style="color: #b6a0ff;">rx-define</span> host (| hostname hostnumber))
(<span style="color: #b6a0ff;">rx-define</span> port digits)
(<span style="color: #b6a0ff;">rx-define</span> hostport (seq host (? <span style="color: #79a8ff;">":"</span> port)))
(<span style="color: #b6a0ff;">rx-define</span> safe (any <span style="color: #79a8ff;">"$-_.+"</span>))
(<span style="color: #b6a0ff;">rx-define</span> extra (any <span style="color: #79a8ff;">"!*',()"</span>))
(<span style="color: #b6a0ff;">rx-define</span> unreserved (| alpha digit safe extra))
(<span style="color: #b6a0ff;">rx-define</span> escape (seq <span style="color: #79a8ff;">"%"</span> hex hex))
(<span style="color: #b6a0ff;">rx-define</span> uchar (| unreserved escape))
(<span style="color: #b6a0ff;">rx-define</span> hsegment (* (| uchar (any <span style="color: #79a8ff;">";:@&amp;="</span>))))
(<span style="color: #b6a0ff;">rx-define</span> hpath (seq hsegment (* <span style="color: #79a8ff;">"/"</span> hsegment)))
(<span style="color: #b6a0ff;">rx-define</span> search (* (| uchar (any <span style="color: #79a8ff;">";:@&amp;="</span>))))
(<span style="color: #b6a0ff;">rx-define</span> httpurl (seq <span style="color: #79a8ff;">"http://"</span> hostport (? <span style="color: #79a8ff;">"/"</span> hpath (? <span style="color: #79a8ff;">"?"</span> search))))
(<span style="color: #b6a0ff;">rx-define</span> httpsurl (seq <span style="color: #79a8ff;">"https://"</span> hostport (? <span style="color: #79a8ff;">"/"</span> hpath (? <span style="color: #79a8ff;">"?"</span> search))))
<span style="color: #989898;">;; </span><span style="color: #989898;">urlish matches HTTPS or HTTP URLs that are just missing a scheme.</span>
(<span style="color: #b6a0ff;">rx-define</span> urlish (seq (? (seq <span style="color: #79a8ff;">"http"</span> (? <span style="color: #79a8ff;">"s"</span>) <span style="color: #79a8ff;">"://"</span>)) hostport (? <span style="color: #79a8ff;">"/"</span> hpath (? <span style="color: #79a8ff;">"?"</span> search))))
</pre>
</div>
</div>
</div>
