.config/nixos/modules/emacs/config.org
** Conveniently browse to URLs

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq-default browse-url-new-window-flag t)
  (setq browse-url-browser-function 'browse-url-chromium)

  (defun jdb/chr (incognito url)
    "Start a chromium process at URL.
  If INCOGNITO is non-nil, start the chromium incognito."
    (interactive "P\nsURL: \n")
    (let ((browse-url-chromium-arguments (if incognito (cons "--incognito" browse-url-chromium-arguments) browse-url-chromium-arguments)))
      (browse-url-chromium url)))

  (use-package cl-lib)
  (defun jdb/chr-open (url buffer-regexp)
    "Open the buffer matching BUFFER-REGEXP or a new Chromium window for URL."
    (let ((meet-buffers (cl-remove-if-not (lambda (buffer)  (string-match-p buffer-regexp (buffer-name buffer))) (buffer-list))))
      (if (> (length meet-buffers) 0)
          (switch-to-buffer (buffer-name (car meet-buffers)) 'force-same-window)
        (browse-url url))))

  (defun jdb/meet () "Start a Google Meet." (interactive) (jdb/chr-open "https://meet.new" "Meet"))
  (defun jdb/whatsapp () "Open Whatsapp." (interactive) (jdb/chr-open "https://web.whatsapp.com" "Whatsapp"))
  (defun jdb/g-calendar () "Open Google Calendar." (interactive) (jdb/chr-open "https://calendar.google.com" "Grafana Labs - Calendar"))
  (defun jdb/browse-github-notifications () "Open GitHub notifications." (interactive) (jdb/chr-open "https://github.com/notifications" "Notifications"))
  (defun jdb/browse-github-project () "Open my work GitHub project." (interactive) (jdb/chr-open "https://github.com/orgs/grafana/projects/279/views/1" "jdb"))

  (defun jdb/yt (query)
    "Search YouTube with QUERY."
    (interactive "sQuery: \n")
    (jdb/chr t (concat "https://youtube.com/results?search_query=" (replace-regexp-in-string " " "+" query))))

  (defun jdb/yt-local (url)
    "Convert a YouTube URL into one for the local player."
    (interactive "sURL: \n")
    (string-match (rx (seq "v=" (group (= 11 (any alphanumeric))))) url)
    (kill-new (format "file:///home/jdb/youtube.html?v=%s&t=0" (match-string-no-properties 1 url))))

  (defun jdb/ddg (incognito query)
    "Search DuckDuckGo for QUERY.
  IF INCOGNITO is non-nil, search incognito."
    (interactive "P\nsQuery: \n")
    (jdb/chr incognito (concat "https://duckduckgo.com/?q=" (replace-regexp-in-string " " "+" query))))

  (defun jdb/search-go (package)
    "Search for PACKAGE on https://pkg.go.dev."
    (interactive "sPackage: \n")
    (browse-url (concat "https://pkg.go.dev/search?q=" package)))

  (defun jdb/search-nixos (package)
    "Search for PACKAGE in NixOS packages."
    (interactive "sPackage: \n")
    (browse-url (concat "https://search.nixos.org/packages?channel=unstable&from=0&size=50&sort=relevance&type=packages&query=" package)))

  (defun jdb/browse-pulls-on-github (org repo)
    "Browse my Pull Requests on GitHub for a specific ORG and REPO."
    (interactive "sOrg: \nsRepository: \n")
    (browse-url (format "https://github.com/%s/%s/pulls/@me" org repo)))

  (defun jdb/browse-github (org)
    "Browse the current file in GitHub.
  ORG is the Github repository owner."
    (interactive "sOrg: \n")
    (let ((url "https://github.com")
          (repo (car (last (delete "" (split-string (projectile-project-root) "/")))))
          (ref (shell-command-to-string "git rev-parse HEAD"))
          (file (string-remove-prefix (projectile-project-root) (buffer-file-name)))
          (line (line-number-at-pos)))
      (browse-url (format "%s/%s/%s/tree/%s/%s#L%s" url org repo ref file line))))

  (defun jdb/browse-aoc (year day)
    "Browse the Advent of Code puzzle corresponding to YEAR and DAY."
    (interactive "sYear: \nsDay: \n")
    (browse-url (format "https://adventofcode.com/%s/day/%s" year day)))

  (defun jdb/browse-geeksforgeeks ()
    "Browse the geeksforgeeks.org problems page."
    (interactive)
    (browse-url "https://practice.geeksforgeeks.org/explore?page=1&status[]=unsolved&sortBy=difficulty&utm_source=auth&utm_medium=profile&utm_campaign=empty-data"))

  (defun jdb/browse-pr (org repo pr)
    "Browse the GitHub pr number ISSUE for ORG/REPO."
    (interactive "sOrg: \nsRepo: \nnIssue: \n")
    (browse-url (format "https://github.com/%s/%s/pr/%s" org repo pr)))

  (defun jdb/browse-zendesk(id)
    "Browse a Zendesk ticket.  ID is the Zendesk ticket number."
    (interactive "sID: \n")
    (let ((url "https://grafana.zendesk.com/agent/tickets"))
      (browse-url (format "%s/%s" url id))))

  (defun jdb/docs-home-manager ()
    "Open the home-manager documentation."
    (interactive)
    (browse-url "https://nix-community.github.io/home-manager/"))

  (defun jdb/soccercatch ()
    "Browse to soccercatch.com."
    (interactive)
    (jdb/chr t "https://soccercatch.com"))
#+end_src

