.config/nixos/modules/emacs/config.html

<div id="outline-container-org3d14f7b" class="outline-3">
<h3 id="org3d14f7b"><span class="section-number-3">2.32.</span> Conveniently browse to URLs</h3>
<div class="outline-text-3" id="text-2-32">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq-default</span> browse-url-new-window-flag t)
(<span style="color: #b6a0ff;">setq</span> browse-url-browser-function 'browse-url-chromium)

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/chr</span> (incognito url)
  <span style="color: #9ac8e0;">"Start a chromium process at URL.</span>
<span style="color: #9ac8e0;">If INCOGNITO is non-nil, start the chromium incognito."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"P\nsURL: \n"</span>)
  (<span style="color: #b6a0ff;">let</span> ((browse-url-chromium-arguments (<span style="color: #b6a0ff;">if</span> incognito (cons <span style="color: #79a8ff;">"--incognito"</span> browse-url-chromium-arguments) browse-url-chromium-arguments)))
    (browse-url-chromium url)))

(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">cl-lib</span>)
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/chr-open</span> (url buffer-regexp)
  <span style="color: #9ac8e0;">"Open the buffer matching BUFFER-REGEXP or a new Chromium window for URL."</span>
  (<span style="color: #b6a0ff;">let</span> ((meet-buffers (cl-remove-if-not (<span style="color: #b6a0ff;">lambda</span> (buffer)  (string-match-p buffer-regexp (buffer-name buffer))) (buffer-list))))
    (<span style="color: #b6a0ff;">if</span> (&gt; (length meet-buffers) 0)
        (switch-to-buffer (buffer-name (car meet-buffers)) 'force-same-window)
      (browse-url url))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/meet</span> () <span style="color: #9ac8e0;">"Start a Google Meet."</span> (<span style="color: #b6a0ff;">interactive</span>) (jdb/chr-open <span style="color: #79a8ff;">"https://meet.new"</span> <span style="color: #79a8ff;">"Meet"</span>))
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/whatsapp</span> () <span style="color: #9ac8e0;">"Open Whatsapp."</span> (<span style="color: #b6a0ff;">interactive</span>) (jdb/chr-open <span style="color: #79a8ff;">"https://web.whatsapp.com"</span> <span style="color: #79a8ff;">"Whatsapp"</span>))
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/g-calendar</span> () <span style="color: #9ac8e0;">"Open Google Calendar."</span> (<span style="color: #b6a0ff;">interactive</span>) (jdb/chr-open <span style="color: #79a8ff;">"https://calendar.google.com"</span> <span style="color: #79a8ff;">"Grafana Labs - Calendar"</span>))
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/browse-github-notifications</span> () <span style="color: #9ac8e0;">"Open GitHub notifications."</span> (<span style="color: #b6a0ff;">interactive</span>) (jdb/chr-open <span style="color: #79a8ff;">"https://github.com/notifications"</span> <span style="color: #79a8ff;">"Notifications"</span>))
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/browse-github-project</span> () <span style="color: #9ac8e0;">"Open my work GitHub project."</span> (<span style="color: #b6a0ff;">interactive</span>) (jdb/chr-open <span style="color: #79a8ff;">"https://github.com/orgs/grafana/projects/279/views/1"</span> <span style="color: #79a8ff;">"jdb"</span>))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/yt</span> (query)
  <span style="color: #9ac8e0;">"Search YouTube with QUERY."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sQuery: \n"</span>)
  (jdb/chr t (concat <span style="color: #79a8ff;">"https://youtube.com/results?search_query="</span> (replace-regexp-in-string <span style="color: #79a8ff;">" "</span> <span style="color: #79a8ff;">"+"</span> query))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/yt-local</span> (url)
  <span style="color: #9ac8e0;">"Convert a YouTube URL into one for the local player."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sURL: \n"</span>)
  (string-match (<span style="color: #b6a0ff;">rx</span> (seq <span style="color: #79a8ff;">"v="</span> (group (= 11 (any alphanumeric))))) url)
  (kill-new (format <span style="color: #79a8ff;">"file:///home/jdb/youtube.html?v=%s&amp;t=0"</span> (match-string-no-properties 1 url))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/ddg</span> (incognito query)
  <span style="color: #9ac8e0;">"Search DuckDuckGo for QUERY.</span>
<span style="color: #9ac8e0;">IF INCOGNITO is non-nil, search incognito."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"P\nsQuery: \n"</span>)
  (jdb/chr incognito (concat <span style="color: #79a8ff;">"https://duckduckgo.com/?q="</span> (replace-regexp-in-string <span style="color: #79a8ff;">" "</span> <span style="color: #79a8ff;">"+"</span> query))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/search-go</span> (package)
  <span style="color: #9ac8e0;">"Search for PACKAGE on https://pkg.go.dev."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sPackage: \n"</span>)
  (browse-url (concat <span style="color: #79a8ff;">"https://pkg.go.dev/search?q="</span> package)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/search-nixos</span> (package)
  <span style="color: #9ac8e0;">"Search for PACKAGE in NixOS packages."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sPackage: \n"</span>)
  (browse-url (concat <span style="color: #79a8ff;">"https://search.nixos.org/packages?channel=unstable&amp;from=0&amp;size=50&amp;sort=relevance&amp;type=packages&amp;query="</span> package)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/browse-pulls-on-github</span> (org repo)
  <span style="color: #9ac8e0;">"Browse my Pull Requests on GitHub for a specific ORG and REPO."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sOrg: \nsRepository: \n"</span>)
  (browse-url (format <span style="color: #79a8ff;">"https://github.com/%s/%s/pulls/@me"</span> org repo)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/browse-github</span> (org)
  <span style="color: #9ac8e0;">"Browse the current file in GitHub.</span>
<span style="color: #9ac8e0;">ORG is the Github repository owner."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sOrg: \n"</span>)
  (<span style="color: #b6a0ff;">let</span> ((url <span style="color: #79a8ff;">"https://github.com"</span>)
        (repo (car (last (delete <span style="color: #79a8ff;">""</span> (split-string (projectile-project-root) <span style="color: #79a8ff;">"/"</span>)))))
        (ref (shell-command-to-string <span style="color: #79a8ff;">"git rev-parse HEAD"</span>))
        (file (string-remove-prefix (projectile-project-root) (buffer-file-name)))
        (line (line-number-at-pos)))
    (browse-url (format <span style="color: #79a8ff;">"%s/%s/%s/tree/%s/%s#L%s"</span> url org repo ref file line))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/browse-aoc</span> (year day)
  <span style="color: #9ac8e0;">"Browse the Advent of Code puzzle corresponding to YEAR and DAY."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sYear: \nsDay: \n"</span>)
  (browse-url (format <span style="color: #79a8ff;">"https://adventofcode.com/%s/day/%s"</span> year day)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/browse-geeksforgeeks</span> ()
  <span style="color: #9ac8e0;">"Browse the geeksforgeeks.org problems page."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (browse-url <span style="color: #79a8ff;">"https://practice.geeksforgeeks.org/explore?page=1&amp;status[]=unsolved&amp;sortBy=difficulty&amp;utm_source=auth&amp;utm_medium=profile&amp;utm_campaign=empty-data"</span>))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/browse-issue</span> (org repo issue)
  <span style="color: #9ac8e0;">"Browse the GitHub issue number ISSUE for ORG/REPO."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sOrg: \nsRepo: \nnIssue: \n"</span>)
  (browse-url (format <span style="color: #79a8ff;">"https://github.com/%s/%s/issues/%s"</span> org repo issue)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/browse-zendesk</span>(id)
  <span style="color: #9ac8e0;">"Browse a Zendesk ticket.  ID is the Zendesk ticket number."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sID: \n"</span>)
  (<span style="color: #b6a0ff;">let</span> ((url <span style="color: #79a8ff;">"https://grafana.zendesk.com/agent/tickets"</span>))
    (browse-url (format <span style="color: #79a8ff;">"%s/%s"</span> url id))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/docs-home-manager</span> ()
  <span style="color: #9ac8e0;">"Open the home-manager documentation."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (browse-url <span style="color: #79a8ff;">"https://nix-community.github.io/home-manager/"</span>))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/soccercatch</span> ()
  <span style="color: #9ac8e0;">"Browse to soccercatch.com."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (jdb/chr t <span style="color: #79a8ff;">"https://soccercatch.com"</span>))
</pre>
</div>
</div>
</div>
