.config/nixos/modules/emacs/config.org
** Manage brightness

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package f
    :ensure t
    :config
    (defun jdb/brightness (percentage)
      "Adjust the brightness to PERCENTAGE."
      (interactive "p")
      (let* ((backlight-path "/sys/class/backlight/intel_backlight")
             (path-join (lambda (&rest paths) (string-join paths "/")))
             (max-brightness-file (funcall path-join backlight-path "max_brightness"))
             (max-brightness (string-to-number (f-read-text max-brightness-file)))
             (brightness-file (funcall path-join backlight-path "brightness"))
             (brightness (* percentage (/ max-brightness 100))))
        (format "tee %s <<<%s" brightness-file brightness)))))
  (start-process-shell-command "brightness" nil
#+end_src

** Manage sound

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defun jdb/amixer-message ()
    "Output the current volume as a message."
    (message "%s" (shell-command-to-string "pactl get-sink-volume @DEFAULT_SINK@")))

  (defun jdb/amixer-set-vol (vol)
    "Set the volume to VOL percent."
    (shell-command (format "pactl set-sink-volume @DEFAULT_SINK@ %s%%" vol)))

  (defun jdb/amixer-mute ()
    "Mute sound."
    (interactive)
    (jdb/amixer-set-vol 0)
    (jdb/amixer-message))

  (defun jdb/amixer-unmute (vol)
    "Set sound level to 100% if VOL is nil otherwise, set to the value of VOL."
    (interactive "P")
    (jdb/amixer-set-vol (or vol 100))
    (jdb/amixer-message))
#+end_src

** Goto for compilation-mode errors

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package compile
    :config
    (add-to-list 'compilation-error-regexp-alist 'markdownlint-cli)
    (add-to-list 'compilation-error-regexp-alist-alist
                 '(markdownlint-cli .
                                    ("^\\([^:]+\\):\\([0-9]+\\):\\([0-9]+\\) .*$"
                                     1 2 3)))
    (add-to-list 'compilation-error-regexp-alist 'monkeyc)
    (add-to-list 'compilation-error-regexp-alist-alist
                 '(monkeyc .
                           ("^ERROR: [^:]+: \\([^:]+\\):\\([0-9]+\\),\\([0-9]+\\): .*$"
                            1 2 3)))
    (add-to-list 'compilation-error-regexp-alist 'doc-validator)
    (add-to-list 'compilation-error-regexp-alist-alist
                 '(doc-validator .
                                 ("^ERROR: \\([^:]+\\):\\([0-9]+\\):\\([0-9]+\\) .*$"
                                  1 2 3))))
#+end_src

** Snippets with yasnippet

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package yasnippet :ensure t :config (yas-global-mode))
#+end_src

** Use rx in re-builder

From https://www.masteringemacs.org/article/re-builder-interactive-regexp-builder.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package re-builder :config (setq reb-re-syntax 'rx))
#+end_src

** Format everything

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package format-all
    :ensure t
    :hook
    (prog-mode . format-all-mode)
    (markdown-mode . format-all-mode)
    (format-all-mode . format-all-ensure-formatter))
#+end_src

** NixOS

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defun jdb/nixos-flake-update (directory)
    "Update the system configuration flake.
  DIRECTORY configures which directory to update the flake in."
    (interactive "sDirectory: \n")
    (let ((compilation-buffer-name-function (lambda (_) "*jdb/nixos-flake-update*")))
      (compile (format "cd %s && nix flake update" (if (string-blank-p directory)  "~/.config/nixos" directory)))))

  (defun jdb/nixos-rebuild ()
    "Rebuild and switch to the new generation."
    (interactive)
    (let ((compilation-buffer-name-function (lambda (_) "*jdb/nixos-rebuild*")))
      ;; nix flake lock --update-input input
      (compile "cd ~/.config/nixos && nix flake lock --update-input xinput_exporter && sudo nixos-rebuild switch --flake ~/.config/nixos" t)))

  (defun jdb/nix-collect-garbage ()
    "Collect Nix garbage."
    (interactive)
    (let ((compilation-buffer-name-function (lambda (_) "*jdb/nix-collect-garbage*")))
      (compile "sudo nix-collect-garbage" t)))
#+end_src

