.config/nixos/modules/emacs/config.html

<div id="outline-container-org8ecf40e" class="outline-3">
<h3 id="org8ecf40e"><span class="section-number-3">2.33.</span> Manage brightness</h3>
<div class="outline-text-3" id="text-2-33">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">f</span>)
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/brightness</span> (percentage)
  <span style="color: #9ac8e0;">"Adjust the brightness to PERCENTAGE."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"p"</span>)
  (<span style="color: #b6a0ff;">let*</span> ((backlight-path <span style="color: #79a8ff;">"/sys/class/backlight/intel_backlight"</span>)
         (path-join (<span style="color: #b6a0ff;">lambda</span> (<span style="color: #6ae4b9;">&amp;rest</span> paths) (string-join paths <span style="color: #79a8ff;">"/"</span>)))
         (max-brightness-file (funcall path-join backlight-path <span style="color: #79a8ff;">"max_brightness"</span>))
         (max-brightness (string-to-number (f-read-text max-brightness-file)))
         (brightness-file (funcall path-join backlight-path <span style="color: #79a8ff;">"brightness"</span>))
         (brightness (* percentage (/ max-brightness 100))))
    (start-process-shell-command <span style="color: #79a8ff;">"brightness"</span> nil
                                 (format <span style="color: #79a8ff;">"tee %s &lt;&lt;&lt;%s"</span> brightness-file brightness))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1664b15" class="outline-3">
<h3 id="org1664b15"><span class="section-number-3">2.34.</span> Manage sound</h3>
<div class="outline-text-3" id="text-2-34">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/amixer-message</span> ()
  <span style="color: #9ac8e0;">"Output the current volume as a message."</span>
  (message <span style="color: #79a8ff;">"%s"</span> (shell-command-to-string <span style="color: #79a8ff;">"pactl get-sink-volume @DEFAULT_SINK@"</span>)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/amixer-set-vol</span> (vol)
  <span style="color: #9ac8e0;">"Set the volume to VOL percent."</span>
  (shell-command (format <span style="color: #79a8ff;">"pactl set-sink-volume @DEFAULT_SINK@ %s%%"</span> vol)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/amixer-mute</span> ()
  <span style="color: #9ac8e0;">"Mute sound."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (jdb/amixer-set-vol 0)
  (jdb/amixer-message))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/amixer-unmute</span> (vol)
  <span style="color: #9ac8e0;">"Set sound level to 100% if VOL is nil otherwise, set to the value of VOL."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"P"</span>)
  (jdb/amixer-set-vol (<span style="color: #b6a0ff;">or</span> vol 100))
  (jdb/amixer-message))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb9682d" class="outline-3">
<h3 id="orgeb9682d"><span class="section-number-3">2.35.</span> Goto for compilation-mode errors</h3>
<div class="outline-text-3" id="text-2-35">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">compile</span>
  <span style="color: #f78fe7;">:config</span>
  (add-to-list 'compilation-error-regexp-alist 'markdownlint-cli)
  (add-to-list 'compilation-error-regexp-alist-alist
               '(markdownlint-cli .
                                  (<span style="color: #79a8ff;">"^</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">[</span><span style="color: #ff5f59; font-weight: bold;">^</span><span style="color: #79a8ff;">:]+</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">:</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">[0-9]+</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">:</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">[0-9]+</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;"> .*$"</span>
                                   1 2 3)))
  (add-to-list 'compilation-error-regexp-alist 'monkeyc)
  (add-to-list 'compilation-error-regexp-alist-alist
               '(monkeyc .
                         (<span style="color: #79a8ff;">"^ERROR: [</span><span style="color: #ff5f59; font-weight: bold;">^</span><span style="color: #79a8ff;">:]+: </span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">[</span><span style="color: #ff5f59; font-weight: bold;">^</span><span style="color: #79a8ff;">:]+</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">:</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">[0-9]+</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">,</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">[0-9]+</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">: .*$"</span>
                          1 2 3)))
  (add-to-list 'compilation-error-regexp-alist 'doc-validator)
  (add-to-list 'compilation-error-regexp-alist-alist
               '(doc-validator .
                               (<span style="color: #79a8ff;">"^ERROR: </span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">[</span><span style="color: #ff5f59; font-weight: bold;">^</span><span style="color: #79a8ff;">:]+</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">:</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">[0-9]+</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">:</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">[0-9]+</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;"> .*$"</span>
                                1 2 3))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc2bf85f" class="outline-3">
<h3 id="orgc2bf85f"><span class="section-number-3">2.36.</span> Snippets with yasnippet</h3>
<div class="outline-text-3" id="text-2-36">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">yasnippet</span> <span style="color: #f78fe7;">:ensure</span> t <span style="color: #f78fe7;">:config</span> (yas-global-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org699f092" class="outline-3">
<h3 id="org699f092"><span class="section-number-3">2.37.</span> Use rx in re-builder</h3>
<div class="outline-text-3" id="text-2-37">
<p>
From <a href="https://www.masteringemacs.org/article/re-builder-interactive-regexp-builder">https://www.masteringemacs.org/article/re-builder-interactive-regexp-builder</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">re-builder</span> <span style="color: #f78fe7;">:config</span> (<span style="color: #b6a0ff;">setq</span> reb-re-syntax 'rx))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3fc105f" class="outline-3">
<h3 id="org3fc105f"><span class="section-number-3">2.38.</span> Format everything</h3>
<div class="outline-text-3" id="text-2-38">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">format-all</span>
  <span style="color: #f78fe7;">:ensure</span> t
  <span style="color: #f78fe7;">:hook</span>
  (prog-mode . format-all-mode)
  (markdown-mode . format-all-mode)
  (format-all-mode . format-all-ensure-formatter))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4471160" class="outline-3">
<h3 id="org4471160"><span class="section-number-3">2.39.</span> NixOS</h3>
<div class="outline-text-3" id="text-2-39">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/nixos-flake-update</span> (directory)
  <span style="color: #9ac8e0;">"Update the system configuration flake.</span>
<span style="color: #9ac8e0;">DIRECTORY configures which directory to update the flake in."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sDirectory: \n"</span>)
  (<span style="color: #b6a0ff;">let</span> ((compilation-buffer-name-function (<span style="color: #b6a0ff;">lambda</span> (_) <span style="color: #9ac8e0;">"*jdb/nixos-flake-update*"</span>)))
    (compile (format <span style="color: #79a8ff;">"cd %s &amp;&amp; nix flake update"</span> (<span style="color: #b6a0ff;">if</span> (string-blank-p directory)  <span style="color: #79a8ff;">"~/.config/nixos"</span> directory)))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/nixos-rebuild</span> ()
  <span style="color: #9ac8e0;">"Rebuild and switch to the new generation."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> ((compilation-buffer-name-function (<span style="color: #b6a0ff;">lambda</span> (_) <span style="color: #9ac8e0;">"*jdb/nixos-rebuild*"</span>)))
    <span style="color: #989898;">;; </span><span style="color: #989898;">nix flake lock --update-input input</span>
    (compile <span style="color: #79a8ff;">"cd ~/.config/nixos &amp;&amp; nix flake lock --update-input xinput_exporter &amp;&amp; sudo nixos-rebuild switch --flake ~/.config/nixos"</span> t)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/nix-collect-garbage</span> ()
  <span style="color: #9ac8e0;">"Collect Nix garbage."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> ((compilation-buffer-name-function (<span style="color: #b6a0ff;">lambda</span> (_) <span style="color: #9ac8e0;">"*jdb/nix-collect-garbage*"</span>)))
    (compile <span style="color: #79a8ff;">"sudo nix-collect-garbage"</span> t)))
</pre>
</div>
</div>
</div>
