.config/nixos/modules/emacs/config.org
** Git

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defun jdb/co-authored-by--grep-authors (regexp)
    "Find all authors in the git log that match REGEXP."
    (interactive "sRegexp: \n")
    (with-current-buffer (generate-new-buffer "grep-authors")
      (switch-to-buffer (current-buffer))
      (start-process-shell-command "grep-authors" (current-buffer) (format "git log | grep %s | sort -u" regexp))))

  (defun jdb/co-authored-by ()
    "Add a Co-authored-by line to a commit message."
    (interactive)
    (let ((tag "Co-authored-by: "))
      (ivy-read tag
                (lambda (&rest _) jdb/co-authored-by--collection)
                :action (lambda (author)
                          (customize-set-variable 'jdb/co-authored-by--collection
                                                  (add-to-list 'jdb/co-authored-by--collection author))
                          (customize-save-customized)
                          (insert (concat tag author)))
                :caller 'co-authored-by)))
#+end_src

** Speed up garbage collection

Make gc pauses faster by decreasing the threshold.

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (setq gc-cons-threshold (* 2 1000 1000))
#+end_src

** Miscellany
*** Convert a string to Slack alphabet emojis.

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  ;; (message (jdb/string-to-alphabet-emoji "test:smile:test" nil))
  (defun jdb/string-to-alphabet-emoji (str &optional white?)
    "Display the message STR as Slack alphabet emoji.
  WHITE? represents whether the character should be yellow (nil)
  or white (integer value)."
    (interactive "sMessage: \nP")

    ;; Taken from: https://emacs.stackexchange.com/questions/7148/get-all-regexp-matches-in-buffer-as-a-list
    (let ((find-matches (lambda (regexp str)
                          "Return a list of all matches of REGEXP in STR."
                          (let ((pos 0) matches)
                            (while (string-match regexp str pos)
                              (push (match-string 0 str) matches)
                              (setq pos (match-end 0)))
                            (reverse matches)))))
      (kill-new (message (mapconcat
                          (lambda (token)
                            (let ((color (if white? "yellow" "white"))
                                  (emoji? (< 1 (length token))))
                              (cond (emoji? token)
                                    ((and (org-string<= "A" token)
                                          (org-string<= token "z"))
                                     (format ":alphabet-%s-%s:"
                                             color
                                             (downcase token)))
                                    ((string-equal "!" token) (format ":alphabet-%s-exclamation:" color))
                                    ((string-equal "?" token) (format ":alphabet-%s-question:" color))
                                    ((string-equal "@" token) (format ":alphabet-%s-at:" color))
                                    ((string-equal "#" token) (format ":alphabet-%s-hash:" color))
                                    ((string-equal " " token) "   ")
                                    (t token))))
                          (funcall find-matches "\\(:[a-z-_+-]+:\\|.\\)" str)
                          "")))))
#+end_src

