.config/nixos/modules/emacs/config.html

<div id="outline-container-org7699cb3" class="outline-3">
<h3 id="org7699cb3"><span class="section-number-3">2.40.</span> Git</h3>
<div class="outline-text-3" id="text-2-40">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/co-authored-by--grep-authors</span> (regexp)
  <span style="color: #9ac8e0;">"Find all authors in the git log that match REGEXP."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sRegexp: \n"</span>)
  (<span style="color: #b6a0ff;">with-current-buffer</span> (generate-new-buffer <span style="color: #79a8ff;">"grep-authors"</span>)
    (switch-to-buffer (current-buffer))
    (start-process-shell-command <span style="color: #79a8ff;">"grep-authors"</span> (current-buffer) (format <span style="color: #79a8ff;">"git log | grep %s | sort -u"</span> regexp))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/co-authored-by</span> ()
  <span style="color: #9ac8e0;">"Add a Co-authored-by line to a commit message."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> ((tag <span style="color: #79a8ff;">"Co-authored-by: "</span>))
    (ivy-read tag
              (<span style="color: #b6a0ff;">lambda</span> (<span style="color: #6ae4b9;">&amp;rest</span> _) jdb/co-authored-by--collection)
              <span style="color: #f78fe7;">:action</span> (<span style="color: #b6a0ff;">lambda</span> (author)
                        (customize-set-variable 'jdb/co-authored-by--collection
                                                (add-to-list 'jdb/co-authored-by--collection author))
                        (customize-save-customized)
                        (insert (concat tag author)))
              <span style="color: #f78fe7;">:caller</span> 'co-authored-by)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb65133d" class="outline-3">
<h3 id="orgb65133d"><span class="section-number-3">2.41.</span> Speed up garbage collection</h3>
<div class="outline-text-3" id="text-2-41">
<p>
Make gc pauses faster by decreasing the threshold.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> gc-cons-threshold (* 2 1000 1000))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb5108e" class="outline-3">
<h3 id="orgeb5108e"><span class="section-number-3">2.42.</span> Miscellany</h3>
<div class="outline-text-3" id="text-2-42">
</div>
<div id="outline-container-org698d976" class="outline-4">
<h4 id="org698d976"><span class="section-number-4">2.42.1.</span> Convert a string to Slack alphabet emojis.</h4>
<div class="outline-text-4" id="text-2-42-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #989898;">;; </span><span style="color: #989898;">(message (jdb/string-to-alphabet-emoji "test:smile:test" nil))</span>
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/string-to-alphabet-emoji</span> (str <span style="color: #6ae4b9;">&amp;optional</span> white?)
  <span style="color: #9ac8e0;">"Display the message STR as Slack alphabet emoji.</span>
<span style="color: #9ac8e0;">WHITE? represents whether the character should be yellow (nil)</span>
<span style="color: #9ac8e0;">or white (integer value)."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sMessage: \nP"</span>)

  <span style="color: #989898;">;; </span><span style="color: #989898;">Taken from: https://emacs.stackexchange.com/questions/7148/get-all-regexp-matches-in-buffer-as-a-list</span>
  (<span style="color: #b6a0ff;">let</span> ((find-matches (<span style="color: #b6a0ff;">lambda</span> (regexp str)
                        <span style="color: #9ac8e0;">"Return a list of all matches of REGEXP in STR."</span>
                        (<span style="color: #b6a0ff;">let</span> ((pos 0) matches)
                          (<span style="color: #b6a0ff;">while</span> (string-match regexp str pos)
                            (<span style="color: #b6a0ff;">push</span> (match-string 0 str) matches)
                            (<span style="color: #b6a0ff;">setq</span> pos (match-end 0)))
                          (reverse matches)))))
    (kill-new (message (mapconcat
                        (<span style="color: #b6a0ff;">lambda</span> (token)
                          (<span style="color: #b6a0ff;">let</span> ((color (<span style="color: #b6a0ff;">if</span> white? <span style="color: #79a8ff;">"yellow"</span> <span style="color: #79a8ff;">"white"</span>))
                                (emoji? (&lt; 1 (length token))))
                            (<span style="color: #b6a0ff;">cond</span> (emoji? token)
                                  ((<span style="color: #b6a0ff;">and</span> (org-string&lt;= <span style="color: #79a8ff;">"A"</span> token)
                                        (org-string&lt;= token <span style="color: #79a8ff;">"z"</span>))
                                   (format <span style="color: #79a8ff;">":alphabet-%s-%s:"</span>
                                           color
                                           (downcase token)))
                                  ((string-equal <span style="color: #79a8ff;">"!"</span> token) (format <span style="color: #79a8ff;">":alphabet-%s-exclamation:"</span> color))
                                  ((string-equal <span style="color: #79a8ff;">"?"</span> token) (format <span style="color: #79a8ff;">":alphabet-%s-question:"</span> color))
                                  ((string-equal <span style="color: #79a8ff;">"@"</span> token) (format <span style="color: #79a8ff;">":alphabet-%s-at:"</span> color))
                                  ((string-equal <span style="color: #79a8ff;">"#"</span> token) (format <span style="color: #79a8ff;">":alphabet-%s-hash:"</span> color))
                                  ((string-equal <span style="color: #79a8ff;">" "</span> token) <span style="color: #79a8ff;">"   "</span>)
                                  (t token))))
                        (funcall find-matches <span style="color: #79a8ff;">"</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">:[a-z-_+-]+:</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">|</span><span style="color: #79a8ff;">.</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">"</span> str)
                        <span style="color: #79a8ff;">""</span>)))))
</pre>
</div>
</div>
</div>
