.config/nixos/modules/emacs/config.org
*** Apply an RCS formatted patch to a buffer

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  ;; Taken from https://github.com/dominikh/go-mode.el/blob/08aa90d52f0e7d2ad02f961b554e13329672d7cb/go-mode.el#L1852-L1894
  ;; Adjusted to avoid relying on cl-libs or other go-mode internal functions.
  (defun jdb/apply-rcs-patch (patch-buffer)
    "Apply an RCS-formatted diff from PATCH-BUFFER to the current buffer."
    (let ((target-buffer (current-buffer))
          ;; Relative offset between buffer line numbers and line numbers
          ;; in patch.
          ;;
          ;; Line numbers in the patch are based on the source file, so
          ;; we have to keep an offset when making changes to the
          ;; buffer.
          ;;
          ;; Appending lines decrements the offset (possibly making it
          ;; negative), deleting lines increments it. This order
          ;; simplifies the forward-line invocations.
          (line-offset 0)
          (column (current-column)))
      (save-excursion
        (with-current-buffer patch-buffer
          (goto-char (point-min))
          (while (not (eobp))
            (unless (looking-at "^\\([ad]\\)\\([0-9]+\\) \\([0-9]+\\)")
              (error "Invalid rcs patch or internal error in jdb/apply-rcs-patch"))
            (forward-line)
            (let ((action (match-string 1))
                  (from (string-to-number (match-string 2)))
                  (len  (string-to-number (match-string 3))))
              (cond
               ((equal action "a")
                (let ((start (point)))
                  (forward-line len)
                  (let ((text (buffer-substring start (point))))
                    (with-current-buffer target-buffer
                      (setq line-offset (- line-offset len))
                      (goto-char (point-min))
                      (forward-line (- from len line-offset))
                      (insert text)))))
               ((equal action "d")
                (with-current-buffer target-buffer
                  (goto-char (point-min))
                  (forward-line (1- (- from line-offset)))
                  (setq line-offset (+ line-offset len))
                  (dotimes (_ len)
                    (delete-region (point) (save-excursion (move-end-of-line 1) (point)))
                    (delete-char 1))))
               (t
                (error "Invalid rcs patch or internal error in jdb/apply-rcs-patch")))))))
      (move-to-column column)))
#+end_src

*** Implement watch buffer

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defun jdb/watch (command n)
    "Run a specific shell COMMAND every N seconds."
    (interactive "sCommand:\nnEvery:\n")
    (let* ((buffer (generate-new-buffer (format "watch: %s" command)))
           (updated (get-buffer-create (format "next %s" command)))
           ;; TODO: Remove timer after killing buffer?
           (timer (run-at-time n n
                               (lambda (buffer updated command)
                                 (with-current-buffer buffer
                                   ;; TODO: Avoid bringing up `updated' buffer.
                                   (shell-command command updated)
                                   (replace-buffer-contents updated)))
                               buffer updated command)))
      (switch-to-buffer buffer)
      (shell-command command (current-buffer))))
#+end_src

*** Caps lock minor mode

#+html: <aside>
#+begin_note
**NOTE:** It can be fun to disable this mode.  Don't forget about `\\[downcase-word]'!
#+end_note
#+html: </aside>

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defvar caps-lock-mode-map
    (let ((map (make-sparse-keymap)))
      (mapc (lambda (char) (keymap-set map (char-to-string char) 'caps-lock-mode-self-insert-command))
            "abcdefghijklmnopqrstuvwxyz")
      map))

  (defun caps-lock-mode-self-insert-command (&optional n)
    "Like `self-insert-command', but upcase the typed character.
  The numeric prefix argument N says how many times to repeat the insertion."
    (interactive "p")
    (insert-char (upcase last-command-event) n))

  (define-minor-mode caps-lock-mode
    "Insert all latin alphabet characters as caps.
  It can be fun to disable this mode.  Don't forget about `\\[downcase-word]'!"
    :global t :lighter " CAPS-LOCK")
#+end_src

*** Zap up to char

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (use-package misc :bind (("M-Z" . zap-up-to-char)))
#+end_src

*** Transpose lines

From https://emacsredux.com/blog/2013/04/02/move-current-line-up-or-down/.

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defun jdb/move-line-up ()
    "Move up the current line."
    (interactive)
    (transpose-lines 1)
    (forward-line -2)
    (indent-according-to-mode))

  (defun jdb/move-line-down ()
    "Move down the current line."
    (interactive)
    (forward-line 1)
    (transpose-lines 1)
    (forward-line -1)
    (indent-according-to-mode))
  (global-set-key (kbd "M-n") #'jdb/move-line-down)
  (global-set-key (kbd "M-p") #'jdb/move-line-up)
#+end_src

