.config/nixos/modules/emacs/config.html

<div id="outline-container-org5d9c4dc" class="outline-4">
<h4 id="org5d9c4dc"><span class="section-number-4">2.42.2.</span> Apply an RCS formatted patch to a buffer</h4>
<div class="outline-text-4" id="text-2-42-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #989898;">;; </span><span style="color: #989898;">Taken from https://github.com/dominikh/go-mode.el/blob/08aa90d52f0e7d2ad02f961b554e13329672d7cb/go-mode.el#L1852-L1894</span>
<span style="color: #989898;">;; </span><span style="color: #989898;">Adjusted to avoid relying on cl-libs or other go-mode internal functions.</span>
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/apply-rcs-patch</span> (patch-buffer)
  <span style="color: #9ac8e0;">"Apply an RCS-formatted diff from PATCH-BUFFER to the current buffer."</span>
  (<span style="color: #b6a0ff;">let</span> ((target-buffer (current-buffer))
        <span style="color: #989898;">;; </span><span style="color: #989898;">Relative offset between buffer line numbers and line numbers</span>
        <span style="color: #989898;">;; </span><span style="color: #989898;">in patch.</span>
        <span style="color: #989898;">;;</span>
        <span style="color: #989898;">;; </span><span style="color: #989898;">Line numbers in the patch are based on the source file, so</span>
        <span style="color: #989898;">;; </span><span style="color: #989898;">we have to keep an offset when making changes to the</span>
        <span style="color: #989898;">;; </span><span style="color: #989898;">buffer.</span>
        <span style="color: #989898;">;;</span>
        <span style="color: #989898;">;; </span><span style="color: #989898;">Appending lines decrements the offset (possibly making it</span>
        <span style="color: #989898;">;; </span><span style="color: #989898;">negative), deleting lines increments it. This order</span>
        <span style="color: #989898;">;; </span><span style="color: #989898;">simplifies the forward-line invocations.</span>
        (line-offset 0)
        (column (current-column)))
    (<span style="color: #b6a0ff;">save-excursion</span>
      (<span style="color: #b6a0ff;">with-current-buffer</span> patch-buffer
        (goto-char (point-min))
        (<span style="color: #b6a0ff;">while</span> (not (eobp))
          (<span style="color: #b6a0ff;">unless</span> (looking-at <span style="color: #79a8ff;">"^</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">[ad]</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">[0-9]+</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;"> </span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">[0-9]+</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">"</span>)
            (<span style="color: #fec43f;">error</span> <span style="color: #79a8ff;">"Invalid rcs patch or internal error in jdb/apply-rcs-patch"</span>))
          (forward-line)
          (<span style="color: #b6a0ff;">let</span> ((action (match-string 1))
                (from (string-to-number (match-string 2)))
                (len  (string-to-number (match-string 3))))
            (<span style="color: #b6a0ff;">cond</span>
             ((equal action <span style="color: #79a8ff;">"a"</span>)
              (<span style="color: #b6a0ff;">let</span> ((start (point)))
                (forward-line len)
                (<span style="color: #b6a0ff;">let</span> ((text (buffer-substring start (point))))
                  (<span style="color: #b6a0ff;">with-current-buffer</span> target-buffer
                    (<span style="color: #b6a0ff;">setq</span> line-offset (- line-offset len))
                    (goto-char (point-min))
                    (forward-line (- from len line-offset))
                    (insert text)))))
             ((equal action <span style="color: #79a8ff;">"d"</span>)
              (<span style="color: #b6a0ff;">with-current-buffer</span> target-buffer
                (goto-char (point-min))
                (forward-line (1- (- from line-offset)))
                (<span style="color: #b6a0ff;">setq</span> line-offset (+ line-offset len))
                (<span style="color: #b6a0ff;">dotimes</span> (_ len)
                  (delete-region (point) (<span style="color: #b6a0ff;">save-excursion</span> (move-end-of-line 1) (point)))
                  (delete-char 1))))
             (t
              (<span style="color: #fec43f;">error</span> <span style="color: #79a8ff;">"Invalid rcs patch or internal error in jdb/apply-rcs-patch"</span>)))))))
    (move-to-column column)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1886c1" class="outline-4">
<h4 id="orgb1886c1"><span class="section-number-4">2.42.3.</span> Implement watch buffer</h4>
<div class="outline-text-4" id="text-2-42-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/watch</span> (command n)
  <span style="color: #9ac8e0;">"Run a specific shell COMMAND every N seconds."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sCommand:\nnEvery:\n"</span>)
  (<span style="color: #b6a0ff;">let*</span> ((buffer (generate-new-buffer (format <span style="color: #79a8ff;">"watch: %s"</span> command)))
         (updated (get-buffer-create (format <span style="color: #79a8ff;">"next %s"</span> command)))
         <span style="color: #989898;">;; </span><span style="color: #989898;">TODO: Remove timer after killing buffer?</span>
         (timer (run-at-time n n
                             (<span style="color: #b6a0ff;">lambda</span> (buffer updated command)
                               (<span style="color: #b6a0ff;">with-current-buffer</span> buffer
                                 <span style="color: #989898;">;; </span><span style="color: #989898;">TODO: Avoid bringing up `</span><span style="color: #00bcff;">updated</span><span style="color: #989898;">' buffer.</span>
                                 (shell-command command updated)
                                 (replace-buffer-contents updated)))
                             buffer updated command)))
    (switch-to-buffer buffer)
    (shell-command command (current-buffer))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org00e1b0a" class="outline-4">
<h4 id="org00e1b0a"><span class="section-number-4">2.42.4.</span> Caps lock minor mode</h4>
<div class="outline-text-4" id="text-2-42-4">
<aside>
<div class="note" id="org8df1ed7">
<p>
<b><b>NOTE:</b></b> It can be fun to disable this mode.  Don't forget about `\\[downcase-word]'!
</p>

</div>
</aside>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defvar</span> <span style="color: #00d3d0;">caps-lock-mode-map</span>
  (<span style="color: #b6a0ff;">let</span> ((map (make-sparse-keymap)))
    (mapc (<span style="color: #b6a0ff;">lambda</span> (char) (keymap-set map (char-to-string char) 'caps-lock-mode-self-insert-command))
          <span style="color: #79a8ff;">"abcdefghijklmnopqrstuvwxyz"</span>)
    map))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">caps-lock-mode-self-insert-command</span> (<span style="color: #6ae4b9;">&amp;optional</span> n)
  <span style="color: #9ac8e0;">"Like `</span><span style="color: #00bcff;">self-insert-command</span><span style="color: #9ac8e0;">', but upcase the typed character.</span>
<span style="color: #9ac8e0;">The numeric prefix argument N says how many times to repeat the insertion."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"p"</span>)
  (insert-char (upcase last-command-event) n))

(<span style="color: #b6a0ff;">define-minor-mode</span> <span style="color: #feacd0;">caps-lock-mode</span>
  <span style="color: #9ac8e0;">"Insert all latin alphabet characters as caps.</span>
<span style="color: #9ac8e0;">It can be fun to disable this mode.  Don't forget about `\\[</span><span style="color: #00bcff;">downcase-word</span><span style="color: #9ac8e0;">]'!"</span>
  <span style="color: #f78fe7;">:global</span> t <span style="color: #f78fe7;">:lighter</span> <span style="color: #79a8ff;">" CAPS-LOCK"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org970a51f" class="outline-4">
<h4 id="org970a51f"><span class="section-number-4">2.42.5.</span> Zap up to char</h4>
<div class="outline-text-4" id="text-2-42-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">misc</span> <span style="color: #f78fe7;">:bind</span> ((<span style="color: #79a8ff;">"M-Z"</span> . zap-up-to-char)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a07080" class="outline-4">
<h4 id="org3a07080"><span class="section-number-4">2.42.6.</span> Transpose lines</h4>
<div class="outline-text-4" id="text-2-42-6">
<p>
From <a href="https://emacsredux.com/blog/2013/04/02/move-current-line-up-or-down/">https://emacsredux.com/blog/2013/04/02/move-current-line-up-or-down/</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/move-line-up</span> ()
  <span style="color: #9ac8e0;">"Move up the current line."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (transpose-lines 1)
  (forward-line -2)
  (indent-according-to-mode))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/move-line-down</span> ()
  <span style="color: #9ac8e0;">"Move down the current line."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (forward-line 1)
  (transpose-lines 1)
  (forward-line -1)
  (indent-according-to-mode))
(global-set-key (kbd <span style="color: #79a8ff;">"M-n"</span>) #'jdb/move-line-down)
(global-set-key (kbd <span style="color: #79a8ff;">"M-p"</span>) #'jdb/move-line-up)
</pre>
</div>
</div>
</div>
</div>
