.config/nixos/modules/emacs/config.org
** Legacy EXWM code

This code was useful when running with EXWM.
Perhaps it will be useful again.

#+begin_src emacs-lisp
  ;; Configure a logout function.
  (use-package recentf
    :commands (jdb/exwm-logout recentf-save-list)
    :config
    (defun jdb/quit ()
      "Quit Emacs."
      (interactive)
      (recentf-save-list)
      (save-some-buffers)
      (save-buffers-kill-emacs)))

  (defun jdb/chr--switch-buffer-action (buffer)
    "Switch to a buffer named BUFFER if it is live.
  If there is nota live buffer, and BUFFER looks an HTTP URL,
  open it in a browser.
  Otherwise, search for BUFFER with DuckDuckGo."
    (cond ((buffer-live-p (get-buffer buffer)) (switch-to-buffer buffer 'force-same-window))
          ;; Open URL from history.
          ((string-match (rx string-start https-urlish " | ") buffer) (jdb/chr current-prefix-arg (nth 0 (split-string buffer))))
          ((string-match (rx string-start https-urlish string-end) buffer) (jdb/chr current-prefix-arg buffer))
          (t (jdb/ddg current-prefix-arg (string-trim buffer)))))

  (defun jdb/chr--read-history ()
    "Read Chromium history file and add the URLs to ivy completion."
    (let* ((wd "/home/jdb/.config/chromium/Default")
           (history-file (string-join (list wd "History") "/"))
           (copy-file (concat history-file ".copy")))
      ;; Copy the file because Chromium keeps the database locked when running.
      (copy-file history-file copy-file "overwrite-if-exists")
      (butlast (split-string (shell-command-to-string (format "sqlite3 %s -separator ' | ' 'SELECT url,title FROM urls'" copy-file)) "\n" nil))))

  (use-package s)
  (defun jdb/chr-read ()
    "Switch to a chromium process or start a new one.
  INCOGNITO controls whether the window is opened incognito.
  URL is the optional URL to open the process on."
    (interactive)
    (ivy-read "Switch to buffer: "
              #'(lambda (_ _ _) (append (internal-complete-buffer "Chromium-browser" nil t) (jdb/chr--read-history)))
              :action #'jdb/chr--switch-buffer-action
              :caller 'jdb/chr-read))

  (global-set-key (kbd "C-x c") 'jdb/chr-read)
  ;; C-x C-c is originally bound to save-buffers-kill-terminal which is a little too
  ;; dangerous to have as a typo for jdb/chr-read.
  (global-unset-key (kbd "C-x C-c"))
#+end_src

** Add footer for linting

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (provide 'emacs)
  ;;; init.el ends here
#+end_src

* Footnotes
[fn:2]https://blog.d46.us/advanced-emacs-startup/
[fn:1]https://orgmode.org/manual/Creating-Footnotes.html
