.config/nixos/modules/emacs/config.html

<div id="outline-container-org92b2205" class="outline-3">
<h3 id="org92b2205"><span class="section-number-3">2.43.</span> Legacy EXWM code</h3>
<div class="outline-text-3" id="text-2-43">
<p>
This code was useful when running with EXWM.
Perhaps it will be useful again.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #989898;">;; </span><span style="color: #989898;">Configure a logout function.</span>
(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">recentf</span>
  <span style="color: #f78fe7;">:commands</span> (jdb/exwm-logout recentf-save-list)
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/quit</span> ()
    <span style="color: #9ac8e0;">"Quit Emacs."</span>
    (<span style="color: #b6a0ff;">interactive</span>)
    (recentf-save-list)
    (save-some-buffers)
    (save-buffers-kill-emacs)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/chr--switch-buffer-action</span> (buffer)
  <span style="color: #9ac8e0;">"Switch to a buffer named BUFFER if it is live.</span>
<span style="color: #9ac8e0;">If there is nota live buffer, and BUFFER looks an HTTP URL,</span>
<span style="color: #9ac8e0;">open it in a browser.</span>
<span style="color: #9ac8e0;">Otherwise, search for BUFFER with DuckDuckGo."</span>
  (<span style="color: #b6a0ff;">cond</span> ((buffer-live-p (get-buffer buffer)) (switch-to-buffer buffer 'force-same-window))
        <span style="color: #989898;">;; </span><span style="color: #989898;">Open URL from history.</span>
        ((string-match (<span style="color: #b6a0ff;">rx</span> string-start https-urlish <span style="color: #79a8ff;">" | "</span>) buffer) (jdb/chr current-prefix-arg (nth 0 (split-string buffer))))
        ((string-match (<span style="color: #b6a0ff;">rx</span> string-start https-urlish string-end) buffer) (jdb/chr current-prefix-arg buffer))
        (t (jdb/ddg current-prefix-arg (string-trim buffer)))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/chr--read-history</span> ()
  <span style="color: #9ac8e0;">"Read Chromium history file and add the URLs to ivy completion."</span>
  (<span style="color: #b6a0ff;">let*</span> ((wd <span style="color: #79a8ff;">"/home/jdb/.config/chromium/Default"</span>)
         (history-file (string-join (list wd <span style="color: #79a8ff;">"History"</span>) <span style="color: #79a8ff;">"/"</span>))
         (copy-file (concat history-file <span style="color: #79a8ff;">".copy"</span>)))
    <span style="color: #989898;">;; </span><span style="color: #989898;">Copy the file because Chromium keeps the database locked when running.</span>
    (copy-file history-file copy-file <span style="color: #79a8ff;">"overwrite-if-exists"</span>)
    (butlast (split-string (shell-command-to-string (format <span style="color: #79a8ff;">"sqlite3 %s -separator ' | ' 'SELECT url,title FROM urls'"</span> copy-file)) <span style="color: #79a8ff;">"\n"</span> nil))))

(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">s</span>)
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">jdb/chr-read</span> ()
  <span style="color: #9ac8e0;">"Switch to a chromium process or start a new one.</span>
<span style="color: #9ac8e0;">INCOGNITO controls whether the window is opened incognito.</span>
<span style="color: #9ac8e0;">URL is the optional URL to open the process on."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (ivy-read <span style="color: #79a8ff;">"Switch to buffer: "</span>
            #'(<span style="color: #b6a0ff;">lambda</span> (_ _ _) (append (internal-complete-buffer <span style="color: #79a8ff;">"Chromium-browser"</span> nil t) (jdb/chr--read-history)))
            <span style="color: #f78fe7;">:action</span> #'jdb/chr--switch-buffer-action
            <span style="color: #f78fe7;">:caller</span> 'jdb/chr-read))

(global-set-key (kbd <span style="color: #79a8ff;">"C-x c"</span>) 'jdb/chr-read)
<span style="color: #989898;">;; </span><span style="color: #989898;">C-x C-c is originally bound to save-buffers-kill-terminal which is a little too</span>
<span style="color: #989898;">;; </span><span style="color: #989898;">dangerous to have as a typo for jdb/chr-read.</span>
(global-unset-key (kbd <span style="color: #79a8ff;">"C-x C-c"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f64042" class="outline-3">
<h3 id="org1f64042"><span class="section-number-3">2.44.</span> Add footer for linting</h3>
<div class="outline-text-3" id="text-2-44">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">provide</span> '<span style="color: #00bcff;">emacs</span>)
<span style="color: #989898;">;;; </span><span style="color: #989898;">init.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://orgmode.org/manual/Creating-Footnotes.html">https://orgmode.org/manual/Creating-Footnotes.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://blog.d46.us/advanced-emacs-startup/">https://blog.d46.us/advanced-emacs-startup/</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Jack Baldry</p>
<p class="date">Created: 2023-03-21 Tue 14:00</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>